{"title":"High Sparrow","season":"5","episode":"3","date":"Sun Apr 26 2015","authors":["David Benioff","D.B. Weiss"],"directors":["Mark Mylod"],"info":"\"High Sparrow\" is the third episode of the fifth season of Game of Thrones. It is the forty-third episode of the series overall. It premiered on April 26, 2015. It was written by David Benioff and D.B. Weiss, and directed by Mark Mylod.","plot":"In Braavos, Arya sees the Many-Faced God. In King's Landing, Queen Margaery enjoys her new husband. Tyrion and Varys walk the Long Bridge of Volantis.","summary":[{"location":"In King's Landing","content":"Tommen and Margaery are wed.  As Cersei Lannister passes a large crowd on her way to the Great Sept of Baelor, she is increasingly annoyed as people cheer on Margaery, completely ignoring her. Tommen Baratheon and Margaery Tyrell are wed, much to the dismay of Cersei. That night, they consummate their marriage. They are elated and discuss their future together. Tommen thinks that his mother is unhappy in King's Landing. Seeing an opportunity, Margaery manipulates Tommen into thinking that as long as Cersei stays in King’s Landing, she will continue to treat him like a child, watching over him. The next morning, Tommen and Cersei are out for a walk. Tommen tells his mother that he thinks she should return to Casterly Rock if it will make her happy, since she used to talk so fondly of it, but Cersei declines. Deducing that this is Margaery’s doing, Cersei pays her a visit, to find Margaery busy gloating about her “exhausting” night with the King. Greeting her mother-in-law, Margaery now more confident than ever, subtly rubs her queenship in Cersei’s face. Seeing herself losing, Cersei walks away.\nIn Littlefinger's brothel, the Sparrows attack the High Septon as he engages the services of prostitutes dressed as the Seven. He is forced to walk naked through the streets while the Sparrows proclaim him a sinner. Angered by the humiliation, he wants the Small Council to arrest the Sparrows and execute their leader, the High Sparrow. Although unsympathetic, Cersei decides to meet with the High Sparrow, who turns out to be a humble man serving food to the poor, barefoot. The High Sparrow makes no efforts to hide the actions of the other Sparrows. Cersei tells him that he will not be arrested or executed, and that the High Septon has been imprisoned instead, which surprises the High Sparrow. Returning to the Red Keep, Cersei has Qyburn send a message to Petyr Baelish. As Qyburn writes, behind him, the body of Gregor Clegane begins shaking under the sheet, but Qyburn shushes him calmly.\n\nI"},{"location":"In the North","content":"While being served lunch by Reek, Roose Bolton scolds Ramsay on his recent flaying of Lord Cerwyn and his family on what was supposed to be a routine tax collection. Ramsay points out that he eventually got the taxes, but Roose reminds his son that terror cannot sustain their hold on the North and that they are outnumbered if the other houses rise up in rebellion. With Tywin Lannister's death, the pact between the Lannisters and the Boltons is effectively dead. Roose then declares that the best way to cement Bolton control of the North is through marriage.\nSansa Stark is horrified to see Moat Cailin. There is only one reason Baelish could be taking her there - he means to return her to Winterfell, straight into the arms of the Boltons. Recalling their earlier discussion of a marriage proposal, Sansa realizes that the proposal is not for him, but for her, and furiously declares that she would rather die than marry Roose Bolton. Littlefinger corrects her and clarifies that she will be marrying Ramsay Bolton, then calms her down by convincing her that nobody will look for her there, and suggesting that this is her best opportunity for revenge. Sansa reluctantly agrees.\n\n    The Boltons greet Sansa and Baelish  At Winterfell itself, the Boltons and their households greet Sansa and Littlefinger. After a tense moment, Sansa graciously accepts Roose's welcome, putting on an air of politeness that protected her in King's Landing, while from afar, Ramsay's bedwarmer and secret lover, Myranda, observes with jealousy and anger. Sansa is later shown to her old room, seemingly foreign to her after all this time. To her surprise, the servant attending her welcomes her back and quietly assures her that, \"the North remembers.\" Later, as Sansa explores the castle, Reek hides his face from her, but seems to have difficulty forcing himself not to call out to her.\nElsewhere in the castle, Baelish subtly warns Ramsay against inflicting any harm on Sansa, and discusses the situation with Roose, who is suspicious of Littlefinger's motives in betraying the Lannisters. Baelish points out that Tywin is dead, Jaime is one-handed and politically useless, and that Cersei is about to be forced into the background by Margaery, who is quite fond of Sansa. Bolton, nevertheless, demands to read any messages Littlefinger might send off back to the Capital.\n\nA"},{"location":"At the Wall","content":"King Stannis Baratheon tries unsuccessfully to convince the new Lord Commander of the Night's Watch, Jon Snow, to accept his offer of legitimization. Jon declines Stannis's offer and reiterates that his place is with the Night's Watch. Jon also reiterates the Night's Watch's neutrality in the affairs of the Seven Kingdoms and asks Stannis when he plans to leave; Castle Black's stores are insufficient to feed the Night's Watch, Stannis's army, and the wildling prisoners indefinitely. Stannis confirms that his army will leave soon enough to confront the Boltons at Winterfell before the winter snows trap them at the Wall. He leaves the fate of the wildling prisoners in Jon's hands, allowing Jon to decide whether to execute them or to see if Tormund is more willing to negotiate than Mance. When Stannis suggests appointing Alliser Thorne as the new commander of Eastwatch-by-the-Sea, Jon retorts that \"it is better to have your enemies close by than far away.\" As Davos Seaworth prepares to leave with his liege, he invites Jon to ponder on the second-to-last stanza on the Night's Watch oath: \"I am the shield that guards the realms of men.\" He also assures Jon that Stannis's leadership advice is offered because the king has taken a liking to him.\nLater, at the mess hall, Lord Commander Jon Snow asks Sam about Maester Aemon and it is learned his health is waning and entrusts his care in Sam's hands. Jon begins assigning roles to members of the Watch. He assigns one black brother to oversee the digging of a new latrine pit to accommodate the wildling prisoners. Snow also shows respect to Ser Alliser Thorne by appointing him as the new First Ranger, commending his experience. Finally, Lord Commander Snow assigns Janos Slynt with the task of restoring and manning the abandoned castle Greyguard. Slynt refuses Jon not once, but three times. Even after being warned that he is disobeying a direct order, he flippantly tells Jon that he can take his order and 'shove it up his bastard arse.' Having publicly disobeyed and insulted Jon, the Lord Commander orders Janos taken outside, and calls for Olly to fetch him his sword. Ser Alliser briefly hesitates but then moves out of the way to let Dolorous Edd and others grab Slynt, who angrily protests that he has important friends at court and dismisses the matter as a scare tactic.\n\n    Small justice for Ned Stark.  \nJon has Janos dragged out into the courtyard where, obedient to the laws of his father Eddard Stark - that the man who passes the sentence must swing the sword - he prepares to publicly behead him for treason. Slynt's bluster is lost, and the man who once took a baby girl from her mother's arms and killed her starts crying and begging for mercy, saying he will do whatever Jon asks and that he is afraid. Jon hesitates for a moment, but then fixes his nerve and executes the cowardly former Commander of the City Watch with a single swing of his sword - incidentally exacting small justice on one of the men who betrayed his own father to his death and murdered Robert Baratheon's children. From across the courtyard, Stannis Baratheon sees Jon behead Janos for refusing his orders, and slightly nods in approval.\n\nI"},{"location":"In the Free Cities","content":"Arya is accosted by The Waif  In Braavos, Arya Stark has been put to work cleaning the main sanctuary of the House of Black and White. She watches as Jaqen H'ghar assists a supplicant in drinking from the temple's well. She protests to Jaqen that she wants to learn, but he brushes off her discontent. Later on, Arya is accosted in her room by The Waif, who repeatedly asks her who she is, hitting her when she gives the expected response of \"no one.\" Jaqen eventually arrives and demands to know what is going on, as the Waif has overstepped her bounds. He does, however, point out that Arya cannot be no one, as she is wearing Arya Stark's clothes, is in possession of silver stolen by Arya Stark, and was about to attack the Waif using Arya Stark's sword. Realizing his point, Arya binds her old clothing to a rock and tosses it into the lagoon along with the stolen silver. She cannot bring herself to discard Needle so easily, and instead hides it within a sea wall nearby. Back at the House, Jaqen allows Arya to progress to an inner chamber where she is to assist the Waif in stripping and washing corpses. The Waif is silent when Arya asks what happens to the bodies after they are cleaned.\n    The Red Priestess  \nMeanwhile, further south in the Free Cities, Tyrion Lannister and Varys finally arrive at Volantis. Sick of the carriage they've been riding in, Tyrion again dismisses the dangers and insists they leave to explore. The pair move through the Long Bridge's markets, where Varys explains the meaning of the various tattoos Volantene slaves must sport. Varys nearly loses Tyrion, but finds him observing the sermon of a Red Priestess. Tyrion claims curiosity, since Thoros of Myr was the only Red Priest in King's Landing. The Red Priestess evangelizes in High Valyrian, telling the tale of how she was once a slave herself. Like another Red Priestess, she preaches of a prophesied savior, a Dragon Queen. Tyrion's interest in the scene wanes when the Priestess halts in her sermon and stares directly into his eyes.\nTyrion next leads Varys to a brothel. Catching sight of a prostitute dressed as Daenerys, Varys tells Tyrion that a woman who inspires both sermons and whores is probably worth meeting. Tyrion woos a dark-haired prostitute, but when she finally agrees to service him, he finds that he can't bring himself to patronize her. He then goes to urinate off the side of the bridge, with Varys losing sight of him. As Tyrion finishes, he is abducted by Jorah Mormont, who declares that he is taking him to \"the queen.\""}],"firsts":["Lord Medger Cerwyn (Deceased)","Lady Cerwyn (Deceased)","Unidentified Cerwyn (Deceased)","The Waif","The High Sparrow","Red Priestess","Clea"],"deaths":["Lord Medger Cerwyn (Off-screen)","Lady Cerwyn (Off-screen)","Unidentified Cerwyn (Off-screen)","Despondent man","Lord Janos Slynt"],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Lena Headey","character":"Queen Cersei Lannister"},{"actor":"Kit Harington","character":"Lord Commander Jon Snow"},{"actor":"Aidan Gillen","character":"Petyr 'Littlefinger' Baelish"},{"actor":"Natalie Dormer","character":"Queen Margaery Tyrell"},{"actor":"Stephen Dillane","character":"King Stannis Baratheon"},{"actor":"Liam Cunningham","character":"Ser Davos Seaworth"},{"actor":"Conleth Hill","character":"Lord Varys"},{"actor":"Alfie Allen","character":"Reek"},{"actor":"Sophie Turner","character":"Sansa Stark"},{"actor":"Maisie Williams","character":"Arya Stark"},{"actor":"John Bradley","character":"Samwell Tarly"},{"actor":"Gwendoline Christie","character":"Brienne of Tarth"},{"actor":"Dean-Charles Chapman","character":"King Tommen Baratheon"},{"actor":"Tom Wlaschiha","character":"Jaqen H'ghar"},{"actor":"Michael McElhatton","character":"Lord Roose Bolton"},{"actor":"Iwan Rheon","character":"Ramsay Bolton"},{"actor":"Iain Glen","character":"Ser Jorah Mormont"},{"actor":"Jonathan Pryce","character":"the High Sparrow"},{"actor":"Julian Glover","character":"Grand Maester Pycelle"},{"actor":"Anton Lesser","character":"Qyburn"},{"actor":"Owen Teale","character":"Ser Alliser Thorne"},{"actor":"Roger Ashton-Griffiths","character":"Mace Tyrell"},{"actor":"Ben Crompton","character":"Eddison Tollett"},{"actor":"Faye Marsay","character":"The Waif"},{"actor":"Daniel Portman","character":"Podrick Payne"},{"actor":"Dominic Carter","character":"Janos Slynt"},{"actor":"Ian Beattie","character":"Ser Meryn Trant"},{"actor":"Eugene Simon","character":"Ser Lancel Lannister"},{"actor":"Brenock O'Connor","character":"Olly"},{"actor":"Will Tudor","character":"Olyvar"},{"actor":"Finn Jones","character":"Ser Loras Tyrell"},{"actor":"Charlotte Hope","character":"Myranda"},{"actor":"Rila Fukushima","character":"Red Priestess"},{"actor":"Elizabeth Webster","character":"Walda Bolton"},{"actor":"Paul Bentley","character":"the High Septon"},{"actor":"Brian Fortune","character":"Othell Yarwyck"},{"actor":"Michael Condron","character":"Bowen Marsh"},{"actor":"Stella McCusker","character":"Old woman"},{"actor":"Mishael Lopes Cardozo","character":"Brothel guard"},{"actor":"David Garlick","character":"Despondent man"},{"actor":"Matt McArdle","character":"Sellsword"},{"actor":"Eddie Elks","character":"a Sellsword 2"},{"actor":"Gwyneth Keyworth","character":"Clea"},{"actor":"Emina Muftic","character":"Beggar woman"},{"actor":"Samantha Bentley","character":"\"The Mother of Dragons\" and The Stranger"},{"actor":"Xena Avramidis","character":"The Warrior"},{"actor":"Portia Victoria","character":"The Smith"},{"actor":"Em Scribbler","character":"The Mother"},{"actor":"Rebecca Scott","character":"The Maiden"},{"actor":"Rosie Ruthless","character":"The Crone"},{"actor":"James Bleakney","character":"a Baratheon Soldier"},{"actor":"Cillean Campbell","character":"a Lannister Lord"},{"actor":"Bobby Marno","character":"a Night's Watch Man"},{"actor":"Michael Stuart","character":"a Night's Watch Officer"}]}
