{"title":"Mother's Mercy","season":"5","episode":"10","date":"Sun Jun 14 2015","authors":["David Benioff","D.B. Weiss"],"directors":["David Nutter"],"info":"\"Mother's Mercy\" is the tenth and final episode of the fifth season of Game of Thrones. It is the fiftieth episode of the series overall. It premiered on June 14, 2015. It was written by David Benioff and D.B. Weiss, and directed by David Nutter.","plot":"Stannis marches. Dany is surrounded by strangers. Cersei seeks forgiveness. Jon is challenged.","summary":[{"location":"In the North","content":"As the snow begins to melt, Melisandre is elated. Still grieving, Stannis prepares to march on Winterfell. However, one of his generals informs him that nearly half of his men have deserted - mainly the sellswords, who have also run away with all their horses. Another soldier comes with more bad news: Selyse has hanged herself out of grief for her daughter. As he views her body, his general reports that Melisandre has fled.\n\n    Battle of Winterfell.  \nMarching across the fields with less than half the men he once had, Stannis has his men start preparing for the siege, but is instead met in combat early by the Bolton army. The mounted Bolton army easily defeats Stannis' tired and mountless army. Wounded and exhausted, Stannis fights off two remaining soldiers in the aftermath of the carnage and collapses against a tree.\nBrienne of Tarth was warned by Podrick Payne of Stannis's arrival and leaves her watch for Sansa's signal. After the battle she waits and finds a wounded Stannis. She declares who she is and that her king was killed by his brother's shadow that bore his face, before drawing her sword to slay him. Stannis, having lost everything, simply accepts his fate to die: he tells Brienne to do her \"duty\". After a moment's hesitation, Brienne swings her sword at him. Elsewhere, Ramsay finishes off the few remaining Baratheon soldiers and heads back to Winterfell.\n\n    Theon and Sansa prepare to jump.  \nIn Winterfell itself, Sansa uses a corkscrew she pocketed earlier to escape her room, and seeks out the tower to light her signal. After the candle is lit, she sees the Boltons clash with Stannis's army and sees this as a time to slip out of Winterfell. Desperately running across the ramparts, she is caught by Myranda and Reek. Myranda threatens Sansa with a bow, however Sansa, weary and realizing she can't escape a shot from a bow, tells her to kill her while there is still a part of the real her left. Myranda tells Sansa that Ramsay needs her to have an heir and nothing more afterwards, but he does not need all of her in one piece to accomplish that. Sansa braces herself for the worst as Myrnada tenses her bow, but the worst does not come... for her anyway. Theon finally breaks the Bolton's hold on him and causes Myranda to misfire, then grabs and hurls the screaming sadist over the ramparts, where she is killed instantly upon impact with the stone floor of the courtyard far below. Sansa and Theon run, but with Ramsay just returning from the battle, they find themselves with nowhere to go. Hoping to land in deep snow and survive the long fall, the two of them grasp their hands together and jump off the rampart."},{"location":"In Braavos","content":"Arya kills Meryn Trant  Ser Meryn Trant is looking upon three young girls in the Braavosi brothel. Of the three girls, two begin to cry and scream when they are whipped by Meryn, however the last girl has no reaction when whipped. Meryn sends the two weak girls away, and punches the last in the stomach. However, the last girl is revealed to be Arya Stark, after removing her fake face. She pulls out a knife and stabs Meryn in both eyes and chest repeatedly, and puts a gag in his mouth to silence his cries. She then reveals her identity and reminds Meryn of how he killed her dance master, Syrio Forel, before calling him 'no one' and slitting his throat.\nArya then returns to the House of Black and White and returns the face that she used to hide her identity. However, Jaqen H'ghar and the Waif appear and say that Meryn's life was not hers to take, and that a debt must be paid. The Waif grabs Arya as Jaqen pulls out a vial, presumably containing some kind of poison. However, he drinks the poison himself and collapses, with Arya screaming for him to stay alive. Arya states that he was her friend, and hears Jaqen's voice behind her say 'he was no one'. She turns around to see that the Waif now has Jaqen's face. Arya asks who the person on the floor with Jaqen's face is. Jaqen, in the Waif's body, says that he is no one. Arya begins to remove multiple faces from the person on the floor, until she sees her own face. She then begins to lose her sight as her eyes turn white and screams for help."},{"location":"In Meereen","content":"With Daenerys gone, her council is unsure on how they should continue. Tyrion addresses both Jorah and Daario's feelings for her, understanding all too well how one could love the wrong woman. The three argue about Jorah's betrayal, but they will not make any judgments without Daenerys first. The dragon was seen taking her north and that is where they need to search for their queen. Grey Worm, still recovering from his injuries, offers to go with Jorah and Daario, as does Tyrion. Daario firmly nixes both ideas: Grey Worm is needed to command the Unsullied in keeping the city under control, while Tyrion is the only one of them to have any actual political experience. He expresses confidence that with Missandei's help, the pair of them should be able to keep Meereen under control until they return with Daenerys.\nAs Tyrion watches Daario and Jorah depart the city, Varys calmly walks up to Tyrion. Teasing Tyrion about abandoning him in Volantis, he is pleased to see Tyrion already settling into a role that suits him. He reminds Tyrion that he has experience running a city full of people trying to kill each other, and implies that he – and his little birds – are there to help.\n\nI"},{"location":"In the Dothraki Sea","content":"A khalasar surrounds Daenerys.  Meanwhile, Daenerys finds herself far away from Meereen, atop an impressive hill in a sea of green grass. Drogon is still recovering from the wounds he received from the arena in Meereen and is uninterested in flying back. Unfortunately, he's also not interested in finding them any food. Daenerys wanders away to find something for them, but is thrown to see a trio of Dothraki bloodriders emerge. Within minutes, an entire khalasar has her surrounded. Understanding what might happen to her, she quickly removes a ring and drops it in the grass, determined to leave a trail."},{"location":"In Dorne","content":"Ellaria kisses Myrcella goodbye  \nJaime, Bronn, Myrcella and Trystane say their farewells to the Martells to return to King's Landing. Upon saying goodbye, Ellaria Sand kisses Myrcella on the lips, while Tyene Sand flirts with Bronn. Aboard the ship, Myrcella and Jaime talk about Cersei. Jamie begins to come clean to Myrcella, awkwardly telling her that we cannot choose who we love. Myrcella then reveals that she knows that Jamie is her real father, and that she is glad that he is, and the two embrace. However, Myrcella's expression changes, the smile fades on her face and her nose starts to bleed. She collapses in Jaime's arms. Back in Dorne, Ellaria wipes the blood from her nose and takes the antidote for the poison coated on her lips."},{"location":"In King's Landing","content":"Cersei prepares for her penance.  Septa Unella enters Cersei's cell and orders her to confess. Finally giving in, Cersei is brought before the High Sparrow to confess her sins. She confesses her adultery with Ser Lancel, but denies her incestuous relationship with her brother Jaime. Cersei begs to be allowed to go to the Red Keep to see her son Tommen. The High Sparrow grants her request but say that there will still be a trial to ascertain the truth behind the other charges that she still denies: incest and regicide. Cersei is brought to a cell where she is stripped naked and roughly washed before her hair is quickly cut short. She is brought outside were she has to walk naked through the streets of Kings Landing from the Great Sept of Baelor to the Red Keep as punishment. Accompanied by Septa Unella, who repeats the word \"shame\" three times and rings a bell every few steps, and six members of the Faith Militant, Cersei performs her walk of atonement amidst the leering crowds who immediately begin pelting her with filth and vicious insults, such as \"cunt\" and \"brotherfucker\". With bloody feet, Cersei eventually makes it to the Red Keep and bursts into tears. Upon entering the gates, Cersei finds her uncle Kevan Lannister, Grand Maester Pycelle and Qyburn waiting for her. Qyburn attempts to comfort her by covering her body with a cloak. Heavy footsteps are heard, and Qyburn introduces Cersei to the newest member of the Kingsguard: a 7-8 foot tall man in golden armor. Qyburn suggests Cersei go inside where he can attend to her feet, which are badly injured, when the huge knight lifts her up and carries her away."},{"location":"At The Wall","content":"Jon Snow tells Sam what he witnessed at Hardhome. He hopes the White Walkers can't climb the Wall as there is not enough Dragonglass or Valyrian steel in Westeros to combat them. Sam asks Jon if he can travel to Oldtown to study and replace Aemon as the new Maester of the Watch. He feels there is no other way he can help them as he cannot fight, he is also afraid for Gilly and her child's safety, and wishes to take them along. Jon reminds him that the The Citadel will also not allow Sam to be with women, but is humored to hear that it is already too late for that. Sam promises he will return, they toast to that and Jon sees his only friend off.\nDavos, having returned to Castle Black at Stannis' orders, urges Jon to convince the Wildlings for aid. Jon refuses him, saying that they wouldn't side with Stannis and this is not their fight. Both of them are shocked to see a speechless and despondent Melisandre return to the Wall. Ser Davos pressures Melisandre for news, specifically asking after Shireen, but Melisandre remains silent. After seeing the empty look in her eyes, Davos lets her leave.\n\n    Olly deals the final blow to the Lord Commander.  \nThat night, Jon is reading messages when his steward Olly tells him that a wildling knows of the whereabouts of his long missing uncle. Jon Snow quickly rushes with Thorne to a gathered group of Watch men, only to see a placard with the word \"traitor\" written on it. He turns around to find his Brothers staring him down. Thorne makes the first move and stabs the Lord Commander. \"For the Watch\" Thorne says, as well as the others as they close in and continue stabbing him. One after another, Jon Snow is betrayed, \"For the Watch.\" Finally a tearful-eyed Olly approaches last. After a moment of pause Jon gasps \"Olly\" before Olly delivers the final blow, repeating the pledge. The brothers leave Jon to die alone in the snow."}],"firsts":["Gordy","Simpson"],"deaths":["Queen Selyse Baratheon","Baratheon General","Gordy","Simpson","King Stannis Baratheon","Myranda","Princess Myrcella Baratheon","Ser Meryn Trant","Lord Commander Jon Snow"],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Nikolaj Coster-Waldau","character":"Ser Jaime Lannister"},{"actor":"Lena Headey","character":"Queen Cersei Lannister"},{"actor":"Emilia Clarke","character":"Queen Daenerys Targaryen"},{"actor":"Kit Harington","character":"Lord Commander Jon Snow"},{"actor":"Stephen Dillane","character":"King Stannis Baratheon"},{"actor":"Liam Cunningham","character":"Ser Davos Seaworth"},{"actor":"Carice van Houten","character":"Melisandre"},{"actor":"Indira Varma","character":"Ellaria Sand"},{"actor":"Maisie Williams","character":"Arya Stark"},{"actor":"Sophie Turner","character":"Lady Sansa Stark"},{"actor":"John Bradley","character":"Samwell Tarly"},{"actor":"Hannah Murray","character":"Gilly"},{"actor":"Nathalie Emmanuel","character":"Missandei"},{"actor":"Michiel Huisman","character":"Daario Naharis"},{"actor":"Conleth Hill","character":"Varys"},{"actor":"Jerome Flynn","character":"Ser Bronn"},{"actor":"Alfie Allen","character":"Reek"},{"actor":"Iwan Rheon","character":"Ramsay Bolton"},{"actor":"Gwendoline Christie","character":"Brienne of Tarth"},{"actor":"Tom Wlaschiha","character":"Jaqen H'ghar"},{"actor":"with Iain Glen","character":"Ser Jorah Mormont"},{"actor":"Jonathan Pryce","character":"the High Sparrow"},{"actor":"Owen Teale","character":"Ser Alliser Thorne"},{"actor":"Tara Fitzgerald","character":"Queen Selyse Baratheon"},{"actor":"Ian Beattie","character":"Ser Meryn Trant"},{"actor":"Anton Lesser","character":"Qyburn"},{"actor":"Julian Glover","character":"Grand Maester Pycelle"},{"actor":"Alexer Siddig","character":"Prince Doran Martell"},{"actor":"Jacob Anderson","character":"Grey Worm"},{"actor":"Daniel Portman","character":"Podrick Payne"},{"actor":"Faye Marsay","character":"The Waif"},{"actor":"DeObia Oparei","character":"Areo Hotah"},{"actor":"Keisha Castle-Hughes","character":"Obara Sand"},{"actor":"Rosabell Laurenti Sellers","character":"Tyene Sand"},{"actor":"Jessica Henwick","character":"Nymeria Sand"},{"actor":"Brenock O'Connor","character":"Olly"},{"actor":"Charlotte Hope","character":"Myranda"},{"actor":"Ian Gelder","character":"Ser Kevan Lannister"},{"actor":"Nell Tiger Free","character":"Princess Myrcella Baratheon"},{"actor":"Toby Sebastian","character":"Prince Trystane Martell"},{"actor":"Hannah Waddingham","character":"Septa Unella"},{"actor":"Hafþór Júlíus Björnsson","character":"Gregor Clegane"},{"actor":"Brian Fortune","character":"First Builder Othell Yarwyck"},{"actor":"Michael Condron","character":"First Steward Bowen Marsh"},{"actor":"Nigel O'Neill","character":"a Baratheon General"},{"actor":"Maggie Hayes","character":"Septa Moelle"},{"actor":"Mary Jordan","character":"Septa Scolera"},{"actor":"Hattie Gotobed","character":"Ghita"},{"actor":"Ella Tweed","character":"a Brothel child"},{"actor":"Isabelle Jones","character":"a Brothel child"},{"actor":"David Fennelly","character":"a Baratheon soldier"},{"actor":"Jason McLaughlin","character":"a Baratheon soldier"},{"actor":"Tristan McConnell","character":"Gordy"},{"actor":"Laurence O'Fuarain","character":"a Simpson"},{"actor":"Ralph R. Clemente","character":"a woodcutter"},{"actor":"Anthony John Crocker","character":"King's Landing drunkard"},{"actor":"Kirsty Nicholls","character":"King's Landing whore"},{"actor":"Munro Graham","character":"King's Landing flasher"},{"actor":"Ben Kelly","character":"King's Landing flasher 2"},{"actor":"Rebecca Van Cleave","character":"Cersei Lannister (body double)"},{"actor":"James Bleakney","character":"a Baratheon Soldier"},{"actor":"Graeme Peacock","character":"a Baratheon Soldier"},{"actor":"Unknown","character":"Boake"},{"actor":"Unknown","character":"Curlew"}]}
