{"title":"The Dance of Dragons","season":"5","episode":"9","date":"Sun Jun 07 2015","authors":["David Benioff","D.B. Weiss"],"directors":["David Nutter"],"info":"\"The Dance of Dragons\" is the ninth episode of the fifth season of Game of Thrones. It is the forty-ninth episode of the series overall. It premiered on June 7, 2015. It was written by David Benioff and D.B. Weiss, and directed by David Nutter.","plot":"Stannis confronts a troubling decision. Jon returns to the Wall. Mace visits the Iron Bank. Arya encounters someone from her past. Dany reluctantly oversees a traditional celebration of athleticism.","summary":[{"location":"At the Wall","content":"Jon watches wildlings enter inside Castle Black.  \nJon Snow, Tormund, and the surviving few thousand wildlings from Hardhome arrive at the Wall, before the gates of Castle Black. For a tense moment Ser Alliser Thorne hesitates to let all of their old enemies through, but finally he gives the order to open the gate. Thousands of wildlings come through the Wall to Castle Black itself, including many women and children, and even the giant Wun Wun. Many men of the Night's Watch glare at them. Alliser coolly says to Jon that he has a good heart (to save so many people), but that it may end up getting them all killed .\nJon reunites with Samwell Tarly, but is despondent, saying that the mission was a disaster and they only managed to save a small fraction of the wildlings at Hardhome. Sam points to different wildlings passing by and notes that each of them would have died if he had done nothing at all, so it wasn't a complete failure.\n\nI"},{"location":"In the North","content":"During the night at Stannis Baratheon's army camp, Melisandre gazes intently into the flames of her tent's brazier hoping to receive visions from the Lord of Light. In the distance, several tents burst into flames, sending confused men shouting, and one horse screams as he runs away on fire. During the night, Ramsay Bolton and twenty men raided the camp, burning much of their food supplies and heavy siege weapons. Hundreds of horses also died in the fire. Davos notes that their situation is now dire: they don't have enough food to make the march back to Castle Black or to advance to Winterfell, and without their siege weapons they have little chance of storming the castle to take its food supplies anyway. Stannis asks how this could happen and Davos insists that the Boltons know the North's terrain better than they do so it was easy for a raiding party to sneak into camp. Stannis suggests that the watchmen were either collaborating with the enemy or simply not attentive enough at their posts to allow such a disaster - either way he orders them to be executed. Stannis says to slaughter the dead horses for their meat, which should at least buy them a little time.\nStannis's demeanor becomes grave and half-stunned, as he believes there is only one course of action to take. He starts by ordering Davos to return to Castle Black to ask for more supplies from Jon Snow. Davos is confused given that even if Jon did decide to resupply them the provisions probably wouldn't reach them in time, and wonders why Stannis would send him instead of just a messenger. Stannis insists that it is because he needs his Hand of the King to engage in diplomacy to win Jon over - but in reality, Stannis sends Davos away so he wouldn't be around to stop what Stannis was planning on doing next.\nDavos visits the tent of Stannis's daughter Shireen Baratheon to say goodbye. She is enjoying reading a book by Grand Maester Munkun about the Dance of the Dragons, a major civil war in the history of the Seven Kingdoms. They share a laugh about how a knight tried to kill the dragon Vhagar by sneaking up on it with a mirrored shield, but it didn't fool the dragon, who promptly roasted the knight. Davos gives her a wooden stag figurine he has been carving as a present. She asks why he has been so nice to her, and he explains that he felt bad that his son Matthos always insisted that his father learn to read and he never did. Matthos died in the war, and by teaching Davos to read Shireen helped him fulfill his son's wish.\nSome time after Davos leaves, Stannis himself visits Shireen, visibly shaken but trying to speak to her kindly. He asks about her reading, and she explains that \"The Dance of the Dragons\" was a great civil war between Rhaenyra Targaryen and her half-brother Aegon, each of whom thought they deserved to sit on the Iron Throne. The great lords of the Seven Kingdoms each declared for one or the other, dividing the realm in half, and tearing Westeros apart. Brother fought brother and dragon fought dragon in the devastating war. It was a disaster for House Targaryen as well, who never truly recovered. Stannis asks who she would have chosen, Rhaenyra or Aegon, and she says she wouldn't have chosen either - it was all of the choosing sides that plunged Westeros into civil war. Stannis gravely responds that sometimes the world forces a man to choose even if he doesn't want to, but if he stays true to himself he knows what he must do, and then it isn't really a choice at all - even if he hates doing it. Shireen says it's all right and she wants to help him, though he responds that she doesn't even know what he wants. She doesn't care and asks if there is any way she can help, and he says that there is. Shireen insists that she wants to, because she is Princess Shireen of House Baratheon, his daughter. They hug and he embraces her tightly and Stannis whispers \"forgive me\".\nLater, Shireen exits her tent as well and sees all of the soldiers gathered around, and asks where her father is. Coming to the front of the assembly, she sees Melisandre in front of a wooden pyre with a large stake in the middle. She starts shouting to see her father, but is grabbed by soldiers who drag her to the pyre and tie her to the stake. Melisandre soothingly tries to calm her by saying that it will all be over soon. Shireen's cries ring out through the camp, but no one intervenes. Stannis and Shireen's mother Selyse then appear in the crowd. Shireen sees them and begs her mother and father to help, but they do nothing. Selyse insists aloud to herself that the sacrifice is what the Lord of Light wants.\n\n    Stannis watches as Shireen is sacrificed.  \nMelisandre begins praying and announces that they offer up the life of this girl to the Lord of Light, and sets the pyre on fire. As she explained to Stannis before, she believes that sacrificing Shireen's life - which contains the power of a king's blood - will gain the Lord of Light's favor, who in return will aid them in their time of need by lifting the blizzard. Stannis believes that if they do nothing, they will remain snowbound and all starve to death here. Shireen continues to repeatedly cry \"Mother, please!\" and \"Father, please!\" - eventually even Selyse, who only had a cold and non-existent relationship with her daughter, suddenly breaks and rushes forward, begging that they can't go through with it. Soldiers restrain her, however, and she sinks to the ground crying in despair. Shireen's cries become even more frightened, but Stannis continues to watch even as Selyse sobs on the ground. As the flames begin to consume Shireen she wordlessly screams in pain and fear, and eventually even Stannis cannot bear to look anymore as she burns to death.\n\nI"},{"location":"In Dorne","content":"Jaime sits and speaks with Doran.  \nJaime Lannister is escorted into the main apartments of the Water Gardens by Areo Hotah, to be received by Prince Doran Martell in a luxurious solar, along with Ellaria Sand, Doran's son Trystane Martell, and Jaime's \"niece\" Myrcella Baratheon. They lounge on a circle of couches, Myrcella cuddling with Trystane. Jaime notes that Myrcella is wearing a revealing Dornish-style dress now, and she says that the warm climate of Dorne agrees with her.\nComing to the point, Doran asks Jaime why he has snuck in to Dorne to abduct Myrcella back to King's Landing. He says he feared for her safety, but when Doran insists why he didn't just send a letter by messenger-raven, he explains that they received a threatening message: Myrcella's Lannister lion pendant jammed in the mouth of dead viper. Doran glares at Ellaria, while a confused Myrcella explains that her pendant was simply stolen from her room.\nJaime asks if Doran intends to behead him, but (acting more sympathetic now that Jaime revealed he was threatened first) he says that he will not, because he wishes to avoid war. He has seen what war can do, bodies piled on the battlefield and orphans left starving in cities at home, and he will not lead his people into that. Ellaria bluntly asks what he will do, break bread with the Lannisters? However he says that is precisely what he will do, as wine is poured for Jaime, and he raises his own goblet and offers a toast to King Tommen, First of His Name, long may he reign. Jaime returns the toast but Ellaria deliberately pours out her wine onto the floor in disgust.\nDoran asks if Tommen indeed commands that his sister be returned to the capital, and Jaime politely says he does, to which Doran says he cannot disobey his king - Myrcella will return to King's Landing. She is upset for a moment, but then Doran explains his solution: his son Trystane will go along with them, to take over the seat on the Small Council which Tywin granted to Oberyn, but which was vacated by his death. Doran insists that for the alliance between the Iron Throne and Dorne to continue, the engagement of Trystane and Myrcella must stand, and Trystane will simply take his uncle Oberyn's place on the Small Council. Jaime finds Doran's request entirely reasonable, and Myrcella is ecstatic that she will not be separated from Trystane, so Jaime agrees. Ellaria gets up to leave and snaps that it is no wonder that Doran cannot stand, because he has no spine. As she walks out he grabs her by the arm and lowers his voice, saying that she is the mother of four of his nieces and for their sake he hopes she has a long and happy life but if she talks to him that way again, she will not.\nJaime then asks what fate will befall Bronn, who is still imprisoned. Bronn punched out Trystane when they tried to take Myrcella, and Jaime is asked what the normal punishment is for striking a prince where he is from. Jaime politely insists that Bronn was only following orders and they can't punish him for simply following Jaime's commands. Trystane agrees, saying he has learned the value of mercy from his father, but that he has one \"condition\".\nIn the prison cells, Nymeria and Tyene Sand spar out of boredom, as Obara tries to ignore them and get some sleep. The guards arrive and release Bronn, and Tyene mocks him as he leaves. Areo leads Bronn back to the solar where Doran, Jaime, and the rest remain. Bronn apologizes to Trystane when he sees him and says he didn't mean anything by hitting him before. Jaime then gladly informs Bronn that the Martells agreed to let Bronn go with Jaime, but on one condition: wordlessly, Areo then delivers it by striking Bronn in the face with his elbow, the large guard captain hitting him so hard that he is knocked to the floor. Thus his debt to Trystane is settled.\nLater, in the courtyard, Areo brings Ellaria and the Sand Snakes before Prince Doran in his wheelchair. Doran gives Ellaria an ultimatum: she can either choose to swear allegiance to him (and that she will not try something like this again), or she can choose death. Restraining tears, she kneels and kisses his hand. Doran says that he believes in second chances and she is forgiven - but sternly warns her that he does not believe in third chances.\nEllaria then finds Jaime in a study writing a letter back to King's Landing informing of his return. He writes very poorly, given that he is using his non-dominant left hand, and Ellaria remarks that he writes like a seven year old. Ellaria notes how odd it is that she and Oberyn were looked down on for their sexuality in King's Landing, and Jaime is scorned for his incestuous love for Cersei - to which he remains silent and gives no acknowledgement - though a hundred years ago, if his name were Targaryen, no one would have blinked an eye at such a relationship. Cryptically (perhaps spurred by Doran), she then says that she knows \"your daughter\" Myrcella had no part in what befell Oberyn, and maybe even Jaime is innocent of that (and indeed he is, as Oberyn volunteered for the trial by combat). She exits, and Jaime is left to ponder what seems to be her apology.\n\nI"},{"location":"In Braavos","content":"Arya, or \"Lanna\", sells oysters, clams, and cockles on the canal streets.  \nArya, in her \"Lanna\" persona, is once again pushing her cart through the canal streets of Braavos selling oysters, clams, and cockles. She passes the \"Thin man\" who sells insurance to sailors, having been given a mission by the Faceless Men to assassinate him with poisoned oysters. Just as she reaches him, however, she stops in her tracks and stares fixedly on a boat at the dock which has caught her full attention. Stepping out of the boat is Master of Coin Mace Tyrell - and the commander of his guards is none other than Ser Meryn Trant of the Kingsguard, one of the names on Arya's kill list which she recites as a daily prayer. Meryn helped betray her father and killed her Water Dancing trainer Syrio Forel. Mace was sent by Cersei Lannister to treat with the Iron Bank of Braavos, which has started calling in the crown's massive debts, and at least try to gain a little more time to deal with the problem from the bankers. Mace is greeted at the dock by the bank's representative, Tycho Nestoris. Mace addresses Tycho politely and amiably, though he doesn't realize that his jokes aren't really funny. All the while Arya remains frozen and staring at Ser Meryn, ignoring the thin man's requests for some of her oysters.\nArya abandons her mission to assassinate the Thin Man, and instead follows Ser Meryn as he accompanies Mace. After visiting the Iron Bank building, Meryn and a few other Lannister guards depart from Mace at night and go to visit a local brothel. Arya sneaks into the brothel under the guise of simply selling her oysters and clams from a hand basket. The bouncer Brusco doesn't want her in at first but the prostitute Lhara, who is one of Arya's regular customers, tells him to let her stay, as oysters are held to be an aphrodisiac. Arya sells a few and then makes her way to the back chambers where she spies on Meryn from behind some shutters. Meryn catches a brief look at her at one point, and she seems vaguely familiar, but he just shrugs it off (it has been years since he last saw her, she is older and thus looks different, she has different Braavosi-style hair and clothes, and he doesn't think that Arya would logically be in Braavos).\nThe brothel's madam presents several girls in succession to Meryn, but he passes on each as too old. She brings out her best and most expensive prostitute, a beautiful young woman named Anara, but Meryn again dismisses her as too old. The madam slowly realizes that Meryn is perversely interested in young girls who are barely teenagers - around Arya's age - so she brings out a very young girl who Meryn accepts gruffly, bluntly saying he expects another \"fresh\" one tomorrow. After he leaves the madam runs into Arya and shoos her out.\nLater, Arya returns to the House of Black and White empty-handed, having abandoned her first mission for the Faceless Men. When Jaqen H'ghar asks what happened, she lies to him and says that the Thin Man simply wasn't hungry today and didn't order any of her oysters. Jaqen quips that perhaps this is why he is a \"thin man\", and Arya promises that she will follow through on the assassination tomorrow. She departs, and while Jaqen seems to suspect that she was lying, he makes no outward reaction to it.\n\nI"},{"location":"In Meereen","content":"Dany claps to start the fights.  \nAttended by Tyrion Lannister, Missandei, and Daario Naharis, Daenerys sits in the royal box at the Daznak's Pit. Hizdahr zo Loraq arrives late, claiming to have been putting the final touches on the arrangements for the event. When the first two combatants take the field, Hizdahr indicates that Daenerys is to start the fight with a clap of her hands. Daario verbally spars with Hizdahr for much of the first match, drawing Daenerys's attention from the spectacle in front of her. Her attention returns to the arena when Jorah Mormont gives the traditional dedication to her. In spite of Jorah's previous successes, he has decidedly mixed results in the grand melee he finds himself in. The grand melee begins with six fighters, with Jorah pairing up against a Norvosi long-axe fighter. The Norvosi is able to land several blows against Jorah, eventually knocking him to the ground, however Jorah is able to bring out his dagger and eventually bury it into the Norvosi's chest after a brief melee. \n\n    Dany and Missandei during the riots.  \nMeanwhile, a Braavosi Water Dancer easily dispatches his Dothraki opponent, and then focuses his attention on Jorah. Jorah finds himself hopelessly outmatched by the Water Dancer and suffers many cuts from his opponent's rapier. During the fight, a Meerenese Pit Fighter is able to lance his opponent in the chest. The Water Dancer eventually knocks Jorah to the ground, and is about to deliver a killing blow, but fails to notice the pit fighter who kills him from behind. Jorah then battles the pit fighter and kills him and is the last fighter standing.\nAt this moment Jorah suddenly grabs and hurls a spear at the royal box – embedding itself in a Son of the Harpy sneaking up behind Daario. The Sons of the Harpy reveal themselves on every level of the arena and begin slaughtering collaborating Masters and freedmen alike – Hizdahr included. Jorah and Daario evacuate Daenerys from the royal box, while Tyrion rescues Missandei. Finding the exits blocked, the group makes a stand in the center of the Pit with remainder of the Unsullied defenders. Seeing they are hopelessly outnumbered, Daenerys takes Missandei's hand and closes her eyes, ready to face her death.\n\n    Dany climbs on, and rides Drogon.  \nAt that moment, a draconic screech pierces the air, and Drogon descends upon the arena, flying out of a giant flame burst.\nMany of the Sons scatter in terror as Drogon bites, crushes and mercilessly burns the nearest ones to death. The Sons rally enough to attack Drogon with spears, which Daenerys hastily makes an effort to remove. Trying to get Drogon out of the Sons' range, Daenerys climbs atop his back and bids him to fly (\"Valahd\"), becoming the first Targaryen dragonrider in over a century. The Sons of the Harpy routed for now, Daario, Jorah, Missandei and Tyrion look on in astonishment as Drogon soars away."}],"firsts":["Brusco","Braavosi madam","Brea","Anara","Aya"],"deaths":["Princess Shireen Baratheon","Dothraki pit fighter","Norvoshi pit fighter","Pit fighter","Water Dancer","Meereenese champion","Hizdahr zo Loraq"],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Nikolaj Coster-Waldau","character":"Ser Jaime Lannister"},{"actor":"Emilia Clarke","character":"Queen Daenerys Targaryen"},{"actor":"Kit Harington","character":"Lord Commander Jon Snow"},{"actor":"Stephen Dillane","character":"King Stannis Baratheon"},{"actor":"Liam Cunningham","character":"Ser Davos Seaworth"},{"actor":"Carice van Houten","character":"Melisandre"},{"actor":"Indira Varma","character":"Ellaria Sand"},{"actor":"Maisie Williams","character":"Arya Stark"},{"actor":"Jerome Flynn","character":"Ser Bronn"},{"actor":"John Bradley","character":"Samwell Tarly"},{"actor":"Kristofer Hivju","character":"Tormund Giantsbane"},{"actor":"Tom Wlaschiha","character":"Jaqen H'ghar"},{"actor":"Michiel Huisman","character":"Daario Naharis"},{"actor":"Nathalie Emmanuel","character":"Missandei"},{"actor":"with Iain Glen","character":"Ser Jorah Mormont"},{"actor":"Owen Teale","character":"Ser Alliser Thorne"},{"actor":"Tara Fitzgerald","character":"Queen Selyse Baratheon"},{"actor":"Mark Gatiss","character":"Tycho Nestoris"},{"actor":"Alexer Siddig","character":"Prince Doran Martell"},{"actor":"DeObia Oparei","character":"Areo Hotah"},{"actor":"Joel Fry","character":"Hizdahr zo Loraq"},{"actor":"Ian Beattie","character":"Ser Meryn Trant"},{"actor":"Roger Ashton-Griffiths","character":"Lord Mace Tyrell"},{"actor":"Ben Crompton","character":"Eddison Tollett"},{"actor":"Keisha Castle-Hughes","character":"Obara Sand"},{"actor":"Rosabell Laurenti Sellers","character":"Tyene Sand"},{"actor":"Jessica Henwick","character":"Nymeria Sand"},{"actor":"Nell Tiger Free","character":"Princess Myrcella Baratheon"},{"actor":"Toby Sebastian","character":"Prince Trystane Martell"},{"actor":"Kerry Ingram","character":"Princess Shireen Baratheon"},{"actor":"Brenock O'Connor","character":"Olly"},{"actor":"Ian Whyte","character":"Wun Wun"},{"actor":"Nicholas Boulton","character":"Fighting pit announcer"},{"actor":"Oengus MacNamara","character":"the thin man"},{"actor":"Lacy Moore","character":"the Braavosi Madam"},{"actor":"Jack Hickey","character":"a Young Bravo"},{"actor":"Sarine Sofair","character":"Lhara"},{"actor":"Karla Lyons","character":"Johnna's sister"},{"actor":"Ali Lyons","character":"Johnna"},{"actor":"Brian Fortune","character":"First Builder Othell Yarwyck"},{"actor":"Michael Condron","character":"First Steward Bowen Marsh"},{"actor":"Danny O'Connor","character":"a Lannister guard"},{"actor":"Garry Mountaine","character":"Brusco"},{"actor":"Dylan McDonough","character":"a sailor"},{"actor":"Jason McLaughlin","character":"a Baratheon soldier"},{"actor":"Ollie Kram","character":"Anara"},{"actor":"Gemita Samarra","character":"Brea"},{"actor":"Irma Mali","character":"a prostitute"},{"actor":"Aifric O'Donnell","character":"Aya[1]"},{"actor":"Fiach Kunz","character":"a Lannister guard"},{"actor":"Michael Johnston","character":"TBA"},{"actor":"Nigel O'Neill","character":"a Baratheon General"},{"actor":"Adam Basil","character":"a Strong Fighter"},{"actor":"James Bleakney","character":"a Baratheon Soldier"},{"actor":"Charles Jarman","character":"a Pit Fighter"},{"actor":"Graeme Peacock","character":"a Baratheon Soldier"},{"actor":"Mark Quigley","character":"a Baratheon Soldier"},{"actor":"Jessica Stevenson","character":"a Wildling"},{"actor":"Michael Stuart","character":"a Night's Watch Officer"}]}
