{"title":"Kill the Boy","season":"5","episode":"5","date":"Sun May 10 2015","authors":["Bryan Cogman"],"directors":["Jeremy Podeswa"],"info":"\"Kill the Boy\" is the fifth episode of the fifth season of Game of Thrones. It is the forty-fifth episode of the series overall. It premiered on May 10, 2015. It was written by Bryan Cogman and directed by Jeremy Podeswa.","plot":"Dany makes a difficult decision in Meereen. Jon recruits the help of an unexpected ally. Brienne searches for Sansa. Theon remains under Ramsay's control.","summary":[{"location":"In Meereen","content":"Missandei     Daenerys watches on as her dragons set a head of great family on fire and proceed to eat him.   watches over the wounded Grey Worm, who is still unconscious from his wounds sustained by the Sons of the Harpy. Daenerys and Daario Naharis wake over the deceased Ser Barristan Selmy. Hizdahr zo Loraq enters to extend his condolences. Daario suggests pulling back around the pyramid to use it as a base from which to eradicate the Sons of the Harpy. Daenerys instead opts for rounding up the leaders of each great family in Meereen, including Hizdahr. The leaders are brought to the catacombs where Rhaegal and Viserion are chained up. Daenerys's Unsullied push the leaders slowly towards the two dragons, who can be heard growling from the darkness. Daenerys states that good mothers do not give up on their children, they discipline them if needed, but never give up on them. She nods to Daario to push one of the leaders further forward. A stream of fire coming from Rhaegal sets the man aflame before he is torn apart and eaten by both dragons. Daenerys suggests that the dragons may determine the innocence of the captives and touches Hizdahr's back as if she wanted to push him but then she pretends she wants not to overfeed the dragons and lets the rest of the men be led away.\nGrey Worm wakes up later with Missandei sitting beside him. He asks if Barristan Selmy survived the attack by the Sons of the Harpy but Missandei shakes her head. Grey Worm thinks he has failed Ser Barristan, his men and Daenerys -- a claim Missandei denies. Missandei tells him he shouldn't be ashamed for being wounded given that he was ambushed and outnumbered, but Grey Worm says he is ashamed that he was afraid when he was stabbed. Missandei says that everyone fears death. However, Grey Worm says it isn't death he fears, it is the thought of never getting to see Missandei again that terrified him. Missandei is noticeably touched and kisses Grey Worm.\nDaenerys asks Missandei whether she should reopen the fighting pits. Missandei only says that she has seen Daenerys listening to her counselors when her own experience was lacking and ignoring them when she thought they were wrong. Daenerys visits the imprisoned Hizdahr, who begs for his life. Daenerys tells him she has decided to reopen the fighting pits, but only for free men. She also says that she will marry the head of an ancient family of Meereen to forge a bond with the people of the city, and that she luckily has one of them on his knees already. She leaves a very confused Hizdahr to ponder that he will live, and that he will soon be Meereen's prince consort.\n\nA"},{"location":"At the Wall","content":"Maester Aemon  Sam reads a note from Slaver's Bay to Maester Aemon updating him on Daenerys's situation. Sam praises Daenerys's courage but Maester Aemon worries about his great-niece's safety because she is all alone, under siege, and with hardly anyone to guide her, while her \"last relation\" is useless and dying thousands of miles away. Jon Snow enters to speak with Aemon in private. He needs the maester's advice on a controversial order that many of the Night's Watch will hate him for. Aemon tells Jon that half the men at Castle Black already hate him, but that he should trust in his command. He says that Jon will not enjoy being Lord Commander, but with luck, he may find the strength to do what needs to be done. Jon is told to \"kill the boy, and let the man be born.\"\nJon then meets with Tormund Giantsbane and offers to forge an alliance with the wildlings, bidding Tormund to go north of the wall and rally them all. He will open the gates for them and give them land south of the wall in which to settle. In return, the wildlings will fight alongside the Night’s Watch when White Walkers arrive. Tormund is initially reluctant and to convince him, Jon unlocks his chains, freeing him. Tormund relents, and reveals that most of the wildlings are up at Hardhome. Jon offers him horses and men to bring the wildlings back. Tormund tells him that they’ll need ships to bring his people back, which Jon says he’ll borrow from Stannis. Tormund's final condition is that Jon accompany him as a guarantee that the wildlings will not fall prey to any traps set by the Night's Watch.\nThe men of the Night’s Watch do not take news of the alliance well, citing the countless innocent lives lost due to the wildlings. Even Jon’s friend Edd rejects this decision, stating that the wildlings killed their friends Grenn and Pyp. Nevertheless, Jon decides to go ahead with his plan. In the library, Sam tells Gilly about his wish to go to Citadel and become a maester before he was sent to the Night’s Watch, when Stannis Baratheon walks in. Stannis reminisces about how Sam’s father, Randyll Tarly, defeated Robert Baratheon in the Battle of Ashford. Stannis wants to know how Sam killed the White Walker and Sam tells him how he did it with a dagger made of dragonglass. Stannis muses that it is abundantly available in Dragonstone. Sam has been researching dragonglass and how it can kill White Walkers, but has yet to come up with anything. Stannis tells him to continue his research and leaves.\nLater, Stannis tells Ser Davos that they will march toward Winterfell the next morning. Davos suggests waiting until Jon returns with the wildlings, but Stannis decides against it, as any delay improves the Boltons' chances. He also wants to take Selyse and Shireen with them, as he does not think they will be safe at the Wall, surrounded by criminals. The next morning, Stannis’s army, with Stannis and Melisandre at its head, starts its journey to Winterfell.\n\nI"},{"location":"In the North","content":"Brienne of Tarth and Podrick Payne, still pursuing Sansa Stark, arrive at an inn near Winterfell. Podrick thinks that Sansa may be better off at Winterfell now that she is far away from the Lannisters, but Brienne believes that Sansa will not be safe around the people who murdered her mother and brother - the Boltons. Their conversation is interrupted by a servant. Correctly suspecting that he is still loyal to the Starks, Brienne tells of her allegiance to Catelyn Stark and convinces the servant to get a message through to Sansa – her presence still being something of a secret, the old servant seems to gain strength from the idea of a surviving Stark.\nIn Winterfell, Ramsay Bolton and his bedwarmer Myranda discuss Ramsay’s upcoming marriage to Sansa. Myranda admits her jealousy of Sansa, especially since he had promised to marry Myranda back when he was a bastard. Ramsay disregards Myranda’s insecurities, causing Myranda to proclaim that perhaps she will marry too. Ramsay is angered and violently tells her that she is his and she is not going anywhere unless she continues to bore him with her jealousy. He threateningly reminds her what he does to people who bore him, and hearing this Myranda swears never to bore him again.\nMeanwhile, Sansa’s maid carries a message to her. Consoling Sansa that she still has allies in the North, she tells Sansa to light a candle in the highest window of the Broken Tower if she ever needs help. As Sansa wanders around the castle, coming to the tower where Jaime Lannister pushed her brother Brandon out of the window, she runs into Myranda. Myranda puts on a friendly façade, talking to Sansa about her mother’s demise. To help Sansa “remember” how things used to be, Myranda leads Sansa down to the kennels, where she finds Reek, formerly Theon Greyjoy, asleep in one of the cages. Awoken by Sansa’s arrival, he just shakes his head, when Sansa calls him \"Theon.\" He warns her that she shouldn't be down there. Seeing Reek in such a pitiful condition, Sansa angrily storms away.\n\n    Sansa at the \"family\" dinner.  As Reek helps Ramsay get ready for dinner, he confesses to Ramsay that earlier that day, Sansa saw him in his cage. Ramsay, for his own amusement, makes it seem as though he’s going to punish Reek severely, before simply forgiving him. At dinner, Ramsay is initially well-behaved, toasting his wedding to Sansa, but is soon back to his old ways as he forces Reek to apologize to Sansa for murdering Bran and Rickon. With much difficulty, Reek finally mutters an apology. Ramsay then suggests that Reek be the one to give Sansa away at the wedding, since he is the closest thing Sansa has to kin and Roose Bolton accepts the suggestion. Seeing that Ramsay is getting complacent, however, Roose has Walda announce that she is pregnant with a boy. Ramsay is clearly distressed by the news, which in turn delights Sansa.\n    Roose tells Ramsay about his conception.  \nAfter dinner, Ramsay expresses his distress at the possibility of the unborn child jeopardizing his claim on the North. Roose reprimands his son for disgracing himself at dinner but seemingly dismisses his concern. He then shares the story of Ramsay’s birth; Roose raped a miller’s wife, who had married without his consent, after hanging her husband. A year later, she showed up with Ramsay, claiming that the baby was his. Roose nearly had her whipped and the baby drowned, but when Roose laid eyes upon Ramsay, he was convinced that he was his son and decided to keep him. He then reveals to Ramsay that Stannis has an army at Castle Black. Stannis plans to take the Iron Throne and the road to King’s Landing passes through Winterfell, which means that Stannis also intends to take the North. He wants Ramsay’s help in defeating Stannis, and Ramsay agrees.\n\nO"},{"location":"Old Valyria","content":"Tyrion and Jorah are attacked by the Stonemen  \nAs Jorah and Tyrion continue their journey to Meereen, and following Jorah's violent reaction to a previous conversation, Tyrion tries to civilize their relationship and asks where they are. As Jorah stands up to look at the foggy ruins on the horizon, Tyrion deduces that they are going to pass through the remains of Old Valyria, a shorter route to Meereen and one which pirates will avoid because of Valyria's reputation. Tyrion is apprehensive, but still excited to see the ruins of what was once the greatest civilization in the world.\nAs they catch glimpses of domes, towers and aqueducts, Tyrion recites a poem about the Doom of Valyria, with Jorah joining in at the end. Suddenly, through the fog, they see Drogon fly into view. Although he had been hearing about the dragons for some time, Tyrion is still utterly gobsmacked to see one in person. Jorah is struck silent too, as Drogon is even bigger and more majestic than when he left. So distracted are they that they don't notice when the statues on a nearby aqueduct stand up and leap at the boat: they are Stone Men - victims of greyscale so far gone that they have been sent to live out the rest of their lives in quarantine in the ruins. Jorah tells Tyrion not to let them touch him and fights them off.  However, as Tyrion is tied up, he is cornered at one end of the boat with a stone man advancing on him while Jorah battles more at the other end.  Just before the stone man is able to grab him, Tyrion rolls off of the boat and into the water to escape, where he is then pulled down by more stone men under the water.\nAn undetermined amount of time later, Tyrion wakes up and finds himself on a shore, dragged out of the water by Jorah. After confirming to each other that they had not been touched by the stone men, Jorah tells Tyrion that he hopes to find a fishing village and get a boat soon, otherwise they'll have to walk all the way around Slaver's Bay to eventually reach Meereen. Tyrion seems up for it and Jorah goes to look for firewood so they can make camp. However, once out of Tyrion's view, he pulls back his sleeve to inspect the cracked skin on his wrist, confirming that he had been infected with greyscale during the fight with the stone men. He looks at Tyrion and then glances in the direction of Meereen, knowing that even if he dies, he needs to get Tyrion to Daenerys."}],"firsts":["Stone men","Master Eaton","Elboneno"],"deaths":["Master Eaton"],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Emilia Clarke","character":"Queen Daenerys Targaryen"},{"actor":"Kit Harington","character":"Lord Commander Jon Snow"},{"actor":"Stephen Dillane","character":"King Stannis Baratheon"},{"actor":"Liam Cunningham","character":"Ser Davos Seaworth"},{"actor":"Carice van Houten","character":"Lady Melisandre"},{"actor":"Alfie Allen","character":"Reek"},{"actor":"John Bradley","character":"Samwell Tarly"},{"actor":"Sophie Turner","character":"Lady Sansa Stark"},{"actor":"Hannah Murray","character":"Gilly"},{"actor":"Michiel Huisman","character":"Daario Naharis"},{"actor":"Nathalie Emmanuel","character":"Missandei"},{"actor":"Gwendoline Christie","character":"Brienne of Tarth"},{"actor":"Kristofer Hivju","character":"Tormund Giantsbane"},{"actor":"Michael McElhatton","character":"Lord Roose Bolton"},{"actor":"Iwan Rheon","character":"Ramsay Bolton"},{"actor":"with Iain Glen","character":"Ser Jorah Mormont"},{"actor":"Ian McElhinney","character":"Ser Barristan Selmy"},{"actor":"Peter Vaughan","character":"Maester Aemon"},{"actor":"Tara Fitzgerald","character":"Queen Selyse Baratheon"},{"actor":"Owen Teale","character":"Ser Alliser Thorne"},{"actor":"Jacob Anderson","character":"Grey Worm"},{"actor":"Joel Fry","character":"Hizdahr zo Loraq"},{"actor":"Ben Crompton","character":"Eddison Tollett"},{"actor":"Daniel Portman","character":"Podrick Payne"},{"actor":"Charlotte Hope","character":"Myranda"},{"actor":"Kerry Ingram","character":"Princess Shireen Baratheon"},{"actor":"Brenock O'Connor","character":"Olly"},{"actor":"Elizabeth Webster","character":"Lady Walda Bolton"},{"actor":"Brian Fortune","character":"Othell Yarwyck"},{"actor":"Michael Condron","character":"Bowen Marsh"},{"actor":"Stella McCusker","character":"an old woman"},{"actor":"Gianpiero Cognoli","character":"a Great Master"},{"actor":"Raymond Keane","character":"Winter town man"},{"actor":"Ratib Asghar","character":"a Great Master"},{"actor":"Peter Silverleaf","character":"a Great Master"},{"actor":"Davor Jozinovic","character":"a Great Master"},{"actor":"Ivan Peric","character":"a Great Master"},{"actor":"Hadi Kermani","character":"a Great Master"},{"actor":"Tonci Banov","character":"a Great Master"},{"actor":"Calvin Heasman","character":"a Stone Man"},{"actor":"Bobby Marno","character":"a Night's Watch Man"},{"actor":"Michael Stuart","character":"a Night's Watch Officer"}]}
