{"title":"The Wars to Come","season":"5","episode":"1","date":"Sun Apr 12 2015","authors":["David Benioff","D.B. Weiss"],"directors":["Michael Slovis"],"info":"\"The Wars to Come\" is the first episode of the fifth season of Game of Thrones. It is the forty-first episode of the series overall. It premiered on April 12, 2015. It was written by David Benioff and D.B. Weiss, and directed by Michael Slovis.","plot":"Cersei and Jaime adjust to a world without Tywin. Varys reveals a conspiracy to Tyrion. Dany faces a new threat to her rule. Jon is caught between two kings.","summary":[{"location":"Prologue - about 25 years ago, In the Westerlands","content":"Young Cersei and Melara, in the Prologue flashback  \nA young Cersei Lannister and her wary tag-along Melara Hetherspoon are creeping through the woods of the Westerlands. Melara doesn't want to continue, but young Cersei eggs her on. They reach a hut within the woods, which belongs to a Woods witch named Maggy. Unafraid, Cersei walks in first. Upon meeting this \"witch,\" Cersei demands to have her future read. Maggy is hesitant at first, but after Cersei threatens to have her eyes gouged out, the witch relents. She says she will need a drop of Cersei's blood, so Cersei pricks her finger on a dagger. Maggy tastes her blood and offers the young girl three questions. Cersei's first question was if she will marry the prince. Maggy says she will not marry the prince, though she will marry the king, and become queen. She then asks if she and the king will have children, and Maggy tells her that the king will have twenty children, but she will have three: gold will be their crowns - and gold their burial shrouds (indicating that all three will predecease their mother). Finally, she tells Cersei that her reign will not last: she will be queen, but eventually a younger and more beautiful queen is fated to take her place, along with everything she holds dear.\n\nI"},{"location":"In King's Landing","content":"Cersei kissing her deceased father Tywin.  \nIn the present, Cersei arrives at the Great Sept of Baelor to pay respect to her deceased father Tywin. Once inside the Sept, she chastises her brother Jaime for freeing their brother Tyrion and indirectly causing their father's death. At Tywin's wake, Cersei is approached by Lancel Lannister. He has become a devout member of the Sparrows, a religious cult, and asks Cersei's forgiveness for their adulterous relationship, as well as getting her husband Robert Baratheon obscenely drunk on the day he died. Cersei denies any knowledge of her husband's murder, and shrugs off Lancel.\n\n    Loras in bed with Olyvar.  \nWhile in bed together, Loras and the male prostitute Olyvar contemplate a birthmark on Loras's thigh which looks a little like Dorne. Margaery walks in on them, complains about his lack of discretion and sends Olyvar away. Loras retorts that since his sexuality is an open secret anyway, there isn't much point in discretion. He also opines that as Tywin is dead, no one will force Cersei to marry him anymore. He points out how this will leave Cersei in King's Landing, free to harass Margaery. Margaery simply replies with \"perhaps.\"\n\nI"},{"location":"In the Free Cities","content":"In Pentos, Varys speaks to Tyrion about his future.  \nTyrion arrives in Pentos, with the aid of Varys. Varys tells Tyrion that he and Illyrio Mopatis had worked together in secret to restore House Targaryen to the rule of Westeros, but that their errors have left them in Pentos, unable to return to King's Landing. Tyrion has descended into bitterness and self-loathing, seemingly determined to drink himself to death, but Varys angrily snaps him out of his self pity, telling Tyrion that he still has talents that may yet be of use; talents that he could use to seat the right candidate on the Iron Throne. Varys states that Westeros is mired in chaos and on the brink of ruin; the Seven Kingdoms requires a ruler, one stronger than Tommen yet gentler than Stannis, beloved by the people, able to please the common folk and keep the nobility in line. When Tyrion retorts that such a man does not exist, Varys points out that he never said this ruler would be a man. Varys offers Tyrion the choice of either drinking himself to death in Pentos, or travelling with him to Meereen to support Daenerys Targaryen. After a moment, Tyrion agrees.\n\nI"},{"location":"In Slaver's Bay","content":"The Unsullied remove the large gold harpy from the top of the Great Pyramid in Meereen to show the Meereenese people they are under Targaryen rule now and their old traditions are gone. One of the Unsullied, White Rat, is seen walking into a brothel and pays a prostitute to lie with him and comfort him. He is subsequently murdered by a member of the Sons of the Harpy, a resistance group operating in Meereen. Upon being presented with the murderer's mask (left at the scene), Daenerys orders Grey Worm to find those responsible, and for the murdered soldier to be buried in the Temple of the Graces as a statement.\n\n    Dany attempts to visit her dragons.  \nHizdahr zo Loraq and Daario Naharis return to Meereen and declare that their mission to Yunkai has been successful, and that the Wise Masters will turn over power to a council of former slaves and former slave owners. In exchange, the Wise Masters have asked that Daenerys consent to the reopening of the fighting pits, an arena where slaves used to fight to the death. Daenerys denies the request. Later, Daario convinces her to reconsider, as his youth fighting in the pits gave him the fighting skills necessary for him to join the Second Sons, where he met Daenerys. Upon hearing that Drogon hasn't been seen in weeks, Daario muses on the irony of a dragon-queen with no dragons.\nLater, Daenerys attempts to visit Viserion and Rhaegal, whom she locked underground in the Meereenese catacombs to prevent them from killing innocents or fleeing (both of which Drogon did). When she approaches them, they attempt to attack her, forcing her to briskly escape the room.\n\nI"},{"location":"In the Vale","content":"Littlefinger, Sansa, Sweetrobin Arryn, and Lord Royce at Runestone in the Vale.  \nLittlefinger and Sansa watch over Lord Robin Arryn's struggles while sparring with another young boy. While watching Robin spar, Sansa witnesses Baelish receive a message, which he quickly hides. Lord Yohn Royce has agreed to take Robin as his ward and train him to fight, but is not optimistic of his abilities, stating \"he swings a sword like a girl with palsy.\" Though Littlefinger told Lord Royce that he and Sansa would be traveling to the Fingers, they instead head west. Sansa asks if they have anything to fear from Lord Yohn; Littlefinger explains that he doesn't trust the retainers and soldiers who saw them, and is taking Sansa somewhere the Lannisters will never find her.\nPodrick Payne attempts to plan the next move for himself and Brienne of Tarth, but Brienne tells him that she doesn't want anyone following her. He reminds her of the oath she swore to Jaime to find the Stark girls, but she states that Arya did not want her protection. Brienne also points out that Pod was not safe in King's Landing and now that they are far away from the capital, he is safe and they can go their separate ways. Littlefinger and Sansa's carriage passes them, Brienne unaware of how close her goal is.\n\nA"},{"location":"At the Wall","content":"Jon relay's Stannis' offer to Mance.  \nJon Snow's attempts at training Olly are interrupted by Melisandre, who has been sent to fetch Jon for an audience with Stannis. On the ride to the top of the Wall, Jon is discomfited by Melisandre's presence and questions. Stannis explains that he intends to retake the North from Lord Roose Bolton, but needs an army, and desires the Free Folk to fight for him. He wants Jon to convince Mance Rayder to bend the knee and have the wildlings fight for him; in exchange, he would set them free and give them their own land within Westeros. Jon relays this message to Mance, but he refuses to bend the knee; to do so would be to show unforgivable weakness in the eyes of his people. Because he will not fight for Stannis, his punishment is death by being burned alive. On the night of his execution, Mance stands before Stannis, and although he cannot bend the knee, he offers him luck in the wars to come. Mance is led to the stake. Melisandre lights the pyre, and Mance slowly begins to feel the agonizing pain of the fire. Unable to watch him suffer any longer, Jon turns and storms off. Others turn away from the scene as well, including Gilly and Shireen. Just as Mance begins to give in and start screaming, an arrow pierces his chest. It is shot by Jon, giving the man he respected an easier death. Mance dies before he feels the agony of the flames."}],"firsts":["Melara Hetherspoon","Maggy","White Rat","Vala","Bowen Marsh","Samwell Stone"],"deaths":["White Rat","King-Beyond-the-Wall Mance Rayder"],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Nikolaj Coster-Waldau","character":"Ser Jaime Lannister"},{"actor":"Lena Headey","character":"Queen Cersei Lannister"},{"actor":"Emilia Clarke","character":"Queen Daenerys Targaryen"},{"actor":"Kit Harington","character":"Jon Snow"},{"actor":"Aidan Gillen","character":"Petyr 'Littlefinger' Baelish"},{"actor":"Charles Dance","character":"Lord Tywin Lannister"},{"actor":"Natalie Dormer","character":"Lady Margaery Tyrell"},{"actor":"Stephen Dillane","character":"King Stannis Baratheon"},{"actor":"Liam Cunningham","character":"Ser Davos Seaworth"},{"actor":"Carice van Houten","character":"Lady Melisandre"},{"actor":"John Bradley","character":"Samwell Tarly"},{"actor":"Sophie Turner","character":"Princess Sansa Stark"},{"actor":"Kristofer Hivju","character":"Tormund"},{"actor":"Hannah Murray","character":"Gilly"},{"actor":"Conleth Hill","character":"Lord Varys"},{"actor":"Gwendoline Christie","character":"Brienne of Tarth"},{"actor":"Michiel Huisman","character":"Daario Naharis"},{"actor":"Nathalie Emmanuel","character":"Missandei"},{"actor":"Dean-Charles Chapman","character":"King Tommen Baratheon"},{"actor":"Ciarán Hinds","character":"King-Beyond-the-Wall Mance Rayder"},{"actor":"Owen Teale","character":"Ser Alliser Thorne"},{"actor":"Ian McElhinney","character":"Barristan Selmy"},{"actor":"Julian Glover","character":"Grand Maester Pycelle"},{"actor":"Tara Fitzgerald","character":"Selyse Baratheon"},{"actor":"Roger Ashton-Griffiths","character":"Lord Mace Tyrell"},{"actor":"Jacob Anderson","character":"Grey Worm"},{"actor":"Finn Jones","character":"Ser Loras Tyrell"},{"actor":"Daniel Portman","character":"Podrick Payne"},{"actor":"Jodhi May","character":"Maggy"},{"actor":"Dominic Carter","character":"Janos Slynt"},{"actor":"Joel Fry","character":"Hizdahr zo Loraq"},{"actor":"Ben Crompton","character":"Eddison Tollett"},{"actor":"Eugene Simon","character":"Ser Lancel Lannister"},{"actor":"Will Tudor","character":"Olyvar"},{"actor":"Rupert Vansittart","character":"Lord Yohn Royce"},{"actor":"Ian Beattie","character":"Ser Meryn Trant"},{"actor":"Ian Gelder","character":"Ser Kevan Lannister"},{"actor":"Brenock O'Connor","character":"Olly"},{"actor":"Kerry Ingram","character":"Shireen Baratheon"},{"actor":"Paul Bentley","character":"the High Septon"},{"actor":"Reece Noi","character":"Mossador"},{"actor":"Michael Condron","character":"Bowen Marsh"},{"actor":"Lino Facioli","character":"Lord Robin Arryn"},{"actor":"Nell Williams","character":"Young Cersei Lannister"},{"actor":"Isabella Steinbarth","character":"Melara Hetherspoon"},{"actor":"Marcos James","character":"White Rat"},{"actor":"Allan Gildea","character":"Sam Stone"},{"actor":"Meena Rayann","character":"Vala"},{"actor":"Stephen Brown","character":"sparring boy"},{"actor":"Joe Hewetson","character":"Helliweg"},{"actor":"James Bleakney","character":"a Baratheon Soldier"},{"actor":"Cillean Campbell","character":"a Lannister Lord"},{"actor":"Mark Quigley","character":"a Baratheon Soldier"},{"actor":"Michael Stuart","character":"a Night's Watch Officer"}]}
