{"title":"The House of Black and White","season":"5","episode":"2","date":"Sun Apr 19 2015","authors":["David Benioff","D.B. Weiss"],"directors":["Michael Slovis"],"info":"\"The House of Black and White\" is the second episode of the fifth season of Game of Thrones. It is the forty-second episode of the series overall. It premiered on April 19, 2015. It was written by David Benioff and D.B. Weiss, and directed by Michael Slovis.","plot":"Arya arrives in Braavos. Pod and Brienne run into trouble on the road. Cersei fears for her daughter's safety in Dorne as Ellaria Sand seeks revenge for Oberyn's death. Stannis tempts Jon. An adviser tempts Dany.","summary":[{"location":"In the Free Cities","content":"Arya turned away from the House of Black and White.   Ternesio Terys and Arya Stark arrive at Braavos, and Arya is at first scared by the horn blown by the man inside the Titan of Braavos. The two then arrive at the House of Black and White on a boat. Arya lingers outside waiting for admittance, but is rejected by an elder man despite showing the coin Jaqen H'ghar had given her and mentioning their prior association. Arya waits outside the House for days, endlessly reciting the names of the people she's going to kill, but eventually tosses away her coin and wanders off into the streets of Braavos. While hunting for pigeons, she encounters several thugs who threaten to take her food and Needle. As she prepares to defend herself, the boys scatter when the man from the House of Black and White appears again. After following him back to the House, Arya demands he divulge his identity, and he returns to her the coin she threw in the water before. His face morphs into that of the man Arya knew as Jaqen. Stating that \"a man is not Jaqen H'ghar,\" he responds to Arya's question as to who he really is with the answer \"No one. And that is what a girl must become\" as he indicates that Arya may now enter the House.\nFurther south, Tyrion Lannister and Varys depart Pentos in a large wheelhouse pulled by many horses. Tyrion remains despondent, and as he promised, he is continuing to drink himself into a stupor. Varys explains that they are travelling to Meereen by way of Volantis. Varys points out that Tyrion was an effective ruler when he was acting Hand of the King, and that each of them were outsiders due to their deformities (a eunuch and a dwarf). They enjoyed accumulating power, he says, but they also wall themselves off from other people, like hiding inside of a large carriage as they are now - but deep down they were never satisfied being separate from society. Tyrion is unmoved from his depression, and continues to insist that he's tired of being confined in a box of some sort. Varys again warns him that he must remain hidden and that it is unsafe to be seen publicly: Cersei has promised a lordship to any man who brings her his head. Tyrion scoffs and rhetorically asks if Cersei is going to kill every dwarf in the world in the hope of eventually catching him....\n\nI"},{"location":"In King's Landing and the Crownlands","content":"In King's Landing, Cersei Lannister is presented with the severed head of yet another dwarf. Her offer of a lordship for Tyrion's head has indeed motivated people to start killing any dwarf they can find and try to pass it off as Tyrion. Cersei is irate, but won't punish the men who brought her the head for fear this will deter other such bounty hunters. She wants the head disposed of, but Qyburn interjects and politely asks if he can keep the head, as it might be of use in some of his \"experiments.\"\n\n    Cersei shows Jaime the \"gift\" from Dorne.   Cersei summons Jaime to their late father's office and reveals a \"gift\" from Dorne: an ornately carved viper, with Princess Myrcella's unique Lannister pendant suspended from its fangs. She insists it is a threat against Myrcella, a conclusion Jaime can't refute. Cersei lashes out at Jaime for not being a father to any of his children, to which he points out that if he had been, their children would be stoned in the streets. He declares he will fix the situation with Myrcella and ignores Cersei's mocking of his one-handed status.\nThat issue dealt with, Cersei convenes the Small Council. Sitting in the Hand's seat, she announces that \"Tommen\" has declared Qyburn the new Master of Whisperers and that the position of Hand of the King will remain vacant until Tommen is old enough to decide on a candidate for himself. Tommen has apparently also decided to make Mace Tyrell the new Master of Coin in addition to his duties as Master of Ships, and extends the (just now made up) position of \"Master of War\" to Kevan Lannister. Although Mace preens at his new responsibilities, Pycelle is outraged at Qyburn's promotion (as he was thrown out of the order of Maesters for conducting human experimentation). Kevan is disgusted at Cersei's blatant power play. Refusing the new position, he denounces Cersei as nothing more than the Queen Mother, berates her for abusing her authority to fill the Small Council with her sycophants. He then walks out, saying he will await King Tommen's own instructions - at Casterly Rock.\nFurther north in the Crownlands at Castle Stokeworth, Bronn is spending time with his somewhat vapid betrothed Lollys Stokeworth. They seem to get on relatively well, but when Lollys reminds Bronn that her older sister will get the castle when their mother dies, he wryly assures her that mean people like her sister usually get what's coming to them, clearly setting his sights on the castle. Jaime finds the couple, and reveals to Bronn that Cersei has reneged on her deal and offered Lollys's hand to Ser Willas Bracken instead. Bronn is understandably furious about the change of arrangements until Jaime tells him that if he helps rescue Myrcella from Dorne, Bronn will receive a much better girl than Lollys, who has rights to a much better castle.\n\nI"},{"location":"In Dorne","content":"Ellaria and Doran discuss Oberyn's death.   In the Water Gardens of Dorne, Ellaria Sand rudely demands an audience with Doran Martell, the ruling Prince of Dorne. His bodyguard, Areo Hotah, blocks her path, yet Doran tells him to let her pass. She wants to take Princess Myrcella, who at that very moment is enjoying Trystane Martell's company, so that she can send the princess piece by piece to Cersei as revenge for Oberyn Martell's murder. Doran refuses, reminding her that Oberyn had participated in a trial by combat, and therefore his death was legal, and not murder. He states Dorne will not stoop to the level of mutilating children while he rules, even if the Sand Snakes are siding with Ellaria. Sneering, Ellaria asks how long he expects to rule for and storms out. Hotah and the Prince exchange a look as she departs, the former meaningfully indicating his axe, but Doran shakes his head and returns his attention to the Water Gardens as he contemplates his next move.\nI"},{"location":"In the Vale","content":"Brienne and Podrick arrive at an inn and dine. Podrick spots Sansa Stark with Petyr Baelish, and Brienne tells him to ready the horses and she confronts them. \n\n    Brienne swears to Sansa.  \nBrienne mentions her sworn vow to Sansa's mother Catelyn, while Littlefinger points out how she was accused of murdering Renly Baratheon and how both he and Catelyn are now dead. Sansa denies Brienne's request and Littlefinger urges that she stay at the inn as the road is not safe, and seeing this as a trap, Brienne escapes with Podrick on the horses they take. They are chased through a forest as Brienne fights the men and Podrick is thrown off his horse. Reuniting, Podrick mentions how both Stark girls denied her request for protection, but Brienne retorts by doubting Sansa is safe with Littlefinger. Brienne tells Podrick to get his horse as they attempt to further pursue Sansa and Littlefinger.\n\nI"},{"location":"In Meereen","content":"Barristan Selmy tells Daenarys the truth about her father, the Mad King.   Daario and Grey Worm find a house belonging to a Son of the Harpy allegedly responsible for White Rat's death. Daario explains that he has been using the Second Sons as spies throughout Meereen, since they are far less conspicuous than Unsullied and can indulge in the same vices as their informants; Daario indicates his men's effectiveness by stabbing his dagger through a false wall, seriously injuring the man hiding behind it.\nBack at the Great Pyramid, Daenerys and her council debate executing this Harpy's Son, but the debate devolves into a shouting match between Mossador and Hizdahr zo Loraq. After the rest leave, Ser Barristan tells her about her father, and confirms that, contrary to what Viserys told her, the Mad King was indeed quite mad, citing how his crimes against House Stark ultimately led to the rebellion that all but destroyed the Targaryen dynasty. Mollified by the revelation, particularly that her crazed father always thought his atrocities were serving justice to his enemies, Daenerys promises Ser Barristan that there will be a trial for the accused. Before the trial begins, Mossador kills the Harpy's Son. Daenerys, hoping to preserve the integrity of law, has Mossador publicly executed, causing the freed slaves to hiss at her and throw rocks at her as she leaves, along with a riot between the former slaves and masters breaking out.\nLater that night, Daenerys dismisses her council and goes outside. To her relief, Drogon, now the size of a small house, has alighted just above her balcony. Drogon sniffs her outstretched hand, and though he doesn't attack, he flies away again, leaving his mother alone.\n\nA"},{"location":"At the Wall","content":"Shireen Baratheon teaches Gilly how to read in Castle Black's library, apparently to Sam's chagrin. Gilly asks about Shireen's Greyscale scars, revealing that the wildlings don't really have a word for it and that two of her sisters contracted and were driven mad by the disease, before Craster put them out of their misery. Queen Selyse interrupts the proceedings and dismisses Sam and Gilly. She lectures Shireen on the dangers of spending time with any wildlings, since they could conceivably use Gilly to harm Stannis through Shireen. Shireen, however, doubts that that's how things will go.\n\n    \"Bear Island knows no king but the King in the North, whose name is Stark.\" - Lyanna Mormont, ten year old Lady of Bear Island.  \nStannis himself, meanwhile, discusses Jon Snow's recent defiance. Stannis shows Jon a message he received from Lady Lyanna Mormont in response to the demand that House Mormont pledge itself to Stannis' cause. The note refuses, saying that the Mormonts know only one king, the King in the North, and will only follow a Stark. Jon tells Stannis that, like the Wildlings, the Northerners will only follow one of their own. Realizing this is true, Stannis makes Jon an enticing offer: if he leaves the Night's Watch, Stannis will use his authority as king to officially legitimize him as Jon Stark, Lord of Winterfell, so he can rally the North to Stannis's side and resume the fight against the Boltons, Freys, and Lannisters. Jon is visibly moved at the prospect of having his lifelong dream finally come true, but he later admits to Sam that he plans to turn Stannis down: he is a man of the Night's Watch.\nThe election for the new Lord Commander of the Night's Watch commences, overseen by Maester Aemon. Janos Slynt nominates Alliser Thorne. Another brother names Denys Mallister, Commander of the Shadow Tower. The vote almost begins before Sam interrupts to put forward a third nomination: Jon Snow. When the votes are cast, a tie is called: Snow and Thorne have garnered an equal number of votes. With a wry smile, Maester Aemon casts his own vote for Jon Snow. The black brothers hail Jon as the 998th Lord Commander of the Night's Watch."}],"firsts":["Captain Areo Hotah","Ser Denys Mallister","Prince Doran Martell","Prince Trystane Martell","Lollys Stokeworth"],"deaths":["Mossador","Dwarf 1","Son of the Harpy"],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Nikolaj Coster-Waldau","character":"Ser Jaime Lannister"},{"actor":"Lena Headey","character":"Queen Cersei Lannister"},{"actor":"Emilia Clarke","character":"Queen Daenerys Targaryen"},{"actor":"Kit Harington","character":"Jon Snow"},{"actor":"Aidan Gillen","character":"Petyr 'Littlefinger' Baelish"},{"actor":"Stephen Dillane","character":"King Stannis Baratheon"},{"actor":"Liam Cunningham","character":"Ser Davos Seaworth"},{"actor":"Indira Varma","character":"Ellaria Sand"},{"actor":"Maisie Williams","character":"Arya Stark"},{"actor":"Sophie Turner","character":"Sansa Stark"},{"actor":"Conleth Hill","character":"Lord Varys"},{"actor":"Jerome Flynn","character":"Ser Bronn"},{"actor":"John Bradley","character":"Samwell Tarly"},{"actor":"Hannah Murray","character":"Gilly"},{"actor":"Gwendoline Christie","character":"Brienne of Tarth"},{"actor":"Nathalie Emmanuel","character":"Missandei"},{"actor":"Michiel Huisman","character":"Daario Naharis"},{"actor":"Tom Wlaschiha","character":"Jaqen H'ghar"},{"actor":"Peter Vaughan","character":"Maester Aemon"},{"actor":"Ian McElhinney","character":"Barristan Selmy"},{"actor":"Julian Glover","character":"Grand Maester Pycelle"},{"actor":"Anton Lesser","character":"Qyburn"},{"actor":"Tara Fitzgerald","character":"Selyse Baratheon"},{"actor":"Owen Teale","character":"Ser Alliser Thorne"},{"actor":"Alexer Siddig","character":"Doran Martell"},{"actor":"Jacob Anderson","character":"Grey Worm"},{"actor":"Ben Crompton","character":"Eddison Tollett"},{"actor":"Dominic Carter","character":"Janos Slynt"},{"actor":"Daniel Portman","character":"Podrick Payne"},{"actor":"Roger Ashton-Griffiths","character":"Lord Mace Tyrell"},{"actor":"Joel Fry","character":"Hizdahr zo Loraq"},{"actor":"DeObia Oparei","character":"Areo Hotah"},{"actor":"Ian Gelder","character":"Ser Kevan Lannister"},{"actor":"Ian Beattie","character":"Ser Meryn Trant"},{"actor":"Reece Noi","character":"Mossador"},{"actor":"Kerry Ingram","character":"Shireen Baratheon"},{"actor":"Brenock O'Connor","character":"Olly"},{"actor":"Nell Tiger Free","character":"Myrcella Baratheon"},{"actor":"Toby Sebastian","character":"Trystane Martell"},{"actor":"Elizabeth Cadwallader","character":"Lollys Stokeworth"},{"actor":"Cedric Henderson","character":"a Faceless man"},{"actor":"Brian Fortune","character":"Othell Yarwyck"},{"actor":"Gary Oliver","character":"Ternesio Terys"},{"actor":"J.J. Murphy","character":"Denys Mallister"},{"actor":"Michael Condron","character":"Bowen Marsh"},{"actor":"Tom Fava","character":"Street tough"},{"actor":"Derek Lord","character":"Mallister supporter"},{"actor":"Paul Kennedy","character":"Eyrie Guard"},{"actor":"Winston Davis","character":"Street tough 2"},{"actor":"Irene Kelleher","character":"Inn waitress"},{"actor":"Curtis-Lee Ashqar","character":"Son of the Harpy"},{"actor":"Jonathan Gunning","character":"Dwarf hunter 1"},{"actor":"Alan McKee","character":"Dwarf hunter 2"},{"actor":"Michael Stuart","character":"a Night's Watch Officer"}]}
