{"title":"Unbowed, Unbent, Unbroken","season":"5","episode":"6","date":"Sun May 17 2015","authors":["Bryan Cogman"],"directors":["Jeremy Podeswa"],"info":"\"Unbowed, Unbent, Unbroken\" is the sixth episode of the fifth season of Game of Thrones. It is the forty-sixth episode of the series overall. It premiered on May 17, 2015. It was written by Bryan Cogman and directed by Jeremy Podeswa.","plot":"Arya trains. Jorah and Tyrion run into slavers. Trystane and Myrcella make plans. Jaime and Bronn reach their destination. The Sand Snakes attack.","summary":[{"location":"In Braavos","content":"Arya continues her training with the Faceless Men. She cleans a corpse methodically, which is then taken away by two men. Arya is obviously curious about what is on the other side of the door through which the corpse was taken. Arya is about to walk through the door when the Waif obstructs her path and latches the door. Arya wants to know what happens to the bodies she scrubs clean, but the Waif tells her that she will know when the time is right. Frustrated at the lack of answers, Arya demands to play the game of faces. The Waif tells her that Arya has already tried playing the game but failed. She again asks Arya who she is, to which Arya replies that she is no one. The Waif simply tells Arya to get back to work and is about to walk away when Arya asks her who she is. The Waif tells Arya a story about how she was the only daughter of a widowed Lord, who remarried, producing another daughter. Her stepmother, in order to secure her own daughter’s future, tried to poison her. The Waif found out about this and sought out the help of the Faceless Men to exact her revenge. The Waif then asks Arya whether she believed the story, surprising Arya. When Arya doesn’t respond, embarrassed that she bought the Waif’s story, the Waif tells her to get back to work, hinting to Arya that to pass the game of faces, Arya must be able to lie convincingly. Later, when Arya is asleep, Jaqen H'ghar comes to test Arya again. This time, when he asks Arya who she is, Arya tells him how she came to join the Faceless Men, trying to slip in a few lies into the story. However, Jaqen is able to tell when Arya is lying and hits her with a switch whenever she does. He strikes her repeatedly when she insists she hated the Hound. Before he leaves, he tells her that she is lying not only to him, but to herself as well.\n\n    Arya in the Hall of Faces.  \nA grieving father brings his sickly daughter to the House of Black and White. He explains to Arya that he has been to every healer in Braavos and spent every penny he had. He tells her that his daughter is suffering and needs to find peace. Arya sits besides the girl and tells her a short false story, about how she was sick too, but her father brought her here and when she drank from the temple's well, she was healed. This persuades the sickly girl to drink the poisoned water from the well. The water gives the peace of death to the sickly girl, and Arya, having successfully proven that she can lie, is brought to the Hall of Faces with Jaqen H'ghar, a great underground chamber that houses thousands of faces. All the faces had been taken from the corpses that the acolytes wash in the temple. The Faceless Man then asks Arya if she is ready to give up who she is to become \"no one\". After a moment of silence, he then states that she is not ready to become \"no one\" (she is too attached to her past as a Stark), but that she is ready to become \"someone else\".\n\nI"},{"location":"In Slaver's Bay","content":"Jorah and Tyrion in Slaver's Bay  \nOn the western side of Slaver's Bay, Tyrion Lannister and Jorah Mormont are still making their way to Meereen (on the far opposite eastern side of the region) on foot, after losing their boat passing through the Smoking Sea and the ruins of Old Valyria. Tyrion is annoyed that they didn't find any villages to steal a boat or supplies from as Jorah had hoped, so they're slowly walking and only have berries and roots to eat. The topic of just why Tyrion was even in Volantis comes up, and Tyrion is surprised that Jorah did not ask earlier: he explains that he actually fled from Westeros because he killed his own father Tywin. He says he did it because his father tried to have him executed for a crime he didn't commit, and then he found his father screwing the woman he loved - Jorah nods, as this seems as likely a motivation for Kinslaying as any. Tyrion then says that despite how miserable Jorah is now, at least he can say that he had a good father. Jorah asks how he could have known his father Jeor Mormont, but Tyrion explains he visited the Wall once and met him: he was a great leader who seemed to genuinely care about all of his men, a rare thing in the world, but now as the eulogy for Night's Watch members goes, \"the world will not see his like again.\" Jorah is shocked to realize he means that his father is dead. Tyrion becomes apologetic and says he thought that Jorah knew already. Jorah asks how he died: Tyrion says he only knows the report he heard, which said that his father led an expedition beyond the Wall, but there was a mutiny, and Jeor was murdered by his own men. Jorah processes this in silent grief, then changes the subject by saying that they have to keep moving.\nAs they walk, Tyrion asks why Jorah would support Daenerys Targaryen and how she would be better than any other rulers , or why Westeros would even support her, given that her father was the Mad King. Jorah explains that he never used to believe in things like destiny and was very cynical, but after seeing Daenerys emerge from the flames unharmed with baby dragons, he believes in her now, and the Iron Throne is hers by right. Tyrion remains skeptical that this doesn't automatically mean she will be a good queen, given that the Targaryens were famous for going insane, just like Daenerys's own father.\nSpotting a slaver ship in the distance, Jorah pulls Tyrion to the ground. However, the pair has already been spotted before they start hiding, and the slavers emerge from the trees behind them and take them captive. The lead slaver, Malko, intends to return them back to their destination in Volantis. Tyrion, however, manages to successfully persuade him that Jorah is one of the most skilled knights in Westeros, and would fetch a better price being sold to the fighting pits in Meereen, which have just reopened. Though not in the circumstances they hoped, Tyrion and Jorah are once again quickly heading towards Meereen and Queen Daenerys.\n\nI"},{"location":"In Dorne","content":"Bronn and Jaime approach the Water Gardens, wearing Martell disguises from the soldiers they killed. Bronn wonders what Jaime will do once they get inside and find Myrcella, to which Jaime replies that he likes to improvise; Bronn sarcastically remarks \"That explains the golden hand.\" Meanwhile, Ellaria Sand and the Sand Snakes are already inside the Gardens. Ellaria sends them out to abduct Myrcella, telling them to do it \"for Oberyn.\"\nMyrcella herself is enjoying another stroll with her betrothed, Trystane Martell, Trystane's father Prince Doran Martell and his bodyguard Areo Hotah watch from above. Doran comments that they look lovely together, but that they don't realize how dangerous their betrothal is, and that he and Areo must protect them. Doran asks if Areo remembers how to uses his longaxe, and Areo assures him that he does.\n\n    Myrcella and her intended Trystane Martell  Jaime and Bronn infiltrate the Water Gardens and soon come upon Myrcella kissing Trystane. Jaime tries to convince Myrcella to come with him, but Trystane interferes, suspicious of the bloodstains on Bronn and Jaime's Dornish robes. When Trystane tries to draw his sword, Bronn quickly knocks him down, to Myrcella's horror. Jaime tries to lead her away, but they are suddenly attacked by the Sand Snakes. Bronn fights against Tyene and Nymeria, while Obara attacks Jaime with her spear, driving him away from Myrcella. Obara orders Nym to break away from Bronn and take Myrcella prisoner, but as Nym tries to pull her away, they are cut off by Areo and Prince Doran's guards, who surround them and force them all to drop their weapons. Jaime, Bronn, Ellaria and the Sand Snakes are all taken into custody.\nI"},{"location":"In King's Landing","content":"Petyr Baelish arrives in King’s Landing and is on his way to meet Cersei when he is confronted by Brother Lancel and some other Sparrows. Lancel warns Baelish that they have purged King's Landing of its corrupt ways, and the new King’s Landing will not tolerate his prostitution business. Baelish dismisses these threats.\nCersei, meeting with Baelish, continues to deny her involvement in Loras Tyrell’s arrest by the Faith Militant. Baelish is not fooled and warns that House Tyrell will not tolerate this insult. Cersei claims that she is the insulted one since Ser Loras, who was promised to her, prefers the company of men. Cersei then explains why she summoned Baelish; she is suspicious where his loyalties truly lie and asks him whether she can rely on the the Vale to fight for the Throne if the time comes. Baelish assures her that young Robin heeds his advice and he will always counsel loyalty to the Throne. Baelish then reveals that Sansa is back in Winterfell, where Roose Bolton has arranged for her to marry Ramsay. Cersei is infuriated by the Boltons’ betrayal. To add fuel to the fire, Baelish adds that marrying the last remaining Stark gives the Boltons a stronger hold over the North than an alliance with a hated southern house. Baelish counsels patience and suggests letting the Boltons and Stannis fight each other, and when the victor is still recovering from the battle, step in and defeat him. He suggests that Cersei’s uncle Kevan Lannister muster a force or have Jaime Lannister lead an army to the North. Cersei contemptuously claims that her uncle doesn’t have the courage to lead an army, while Jaime is away on a “sensitive diplomatic mission.” Baelish proposes that the soldiers of the Vale could fight instead but Cersei is unsure of Baelish’s ability to lead an army. Baelish convinces her, stating that he \"lives to serve\". All Baelish wants in return is to be named Warden of the North. Cersei agrees to talk to the King about this.\nOlenna Tyrell returns to King’s Landing after learning of her grandson’s arrest. Olenna tries to talks Cersei into releasing Loras. Cersei sticks to her claim that it was the Faith Militant who arrested Loras and she had nothing to do with it. Olenna warns Cersei that her actions have endangered the Lannister-Tyrell alliance – the very alliance that is supplying the capital with food. Cersei informs Olenna that the High Septon has called for a preliminary hearing to determine whether the charges against Loras have merit and expresses confidence that Loras will be acquitted.\n\n    Margaery is arrested.  \nThe High Sparrow interrogates Loras first, who refutes the accusations against him. He then questions Margaery, who also denies any knowledge of it. The High Sparrow then calls in Olyvar, in character as Loras’s \"squire\", who claims that the accusations against Loras are in fact true. Olyvar also admits that Margaery walked in on them once, but didn’t seem surprised. To support his testimony, Olyvar tells the High Sparrow of a birthmark Loras has that is shaped like Dorne, much to Loras' shock and fury. Deciding that this is more than enough evidence for a trial, the High Sparrow has Loras arrested. Since Margaery bore false witness before the Gods, she is arrested too. As Margaery is forcefully dragged away, she calls out for Tommen, paralyzed with indecision, while Olenna sadly regards Cersei's barely contained smug expression.\n\nI"},{"location":"In the North","content":"At Winterfell, Sansa is joined by Myranda in her room. She offers to help Sansa take a bath, so she is presentable to Ramsay during the wedding. While she is washing Sansa's back, Myranda mentions three other girls whom Ramsay had been with, and how he ultimately victimized them after a while because they bored him. Knowing that Myranda is trying to frighten her, Sansa startles Myranda by revealing that she knows about her relationship with Ramsay. She coolly tells Myranda that she is a Stark of Winterfell and will not be intimidated by the likes of her, and dismisses her to finish her bath herself, though she is visibly shaken by Myranda's story.\n\n    Sansa is wed.  Later, when Reek comes to fetch Sansa for the wedding, she refuses to hold Reek’s arm, even after he pleads with her to do so, saying that Ramsay will punish him if she doesn’t. Sansa coldly asks if he thinks she cares what Ramsay does to him, and strides past him. Then, in front of the Godswood, Reek gives Sansa away to Ramsay (who actually allows Reek to call himself Theon Greyjoy) during the wedding ceremony, which is officiated by Roose Bolton and attended by many Northern Lords. After retreating to the bedroom, Ramsay orders Sansa to take her clothes off. Reek is about to leave but Ramsay tells him he must stay. Ramsay quips to Reek, \"You grew up with her as a girl, now watch her become a woman.\" Annoyed by Sansa's hesitance, he angrily rips open the back of her dress and pushes her face-down over the side of the bed. As he unbuckles his clothes, Sansa obediently remains still but begins crying softly. Reek is visibly distraught and begins silently crying himself, as Ramsay proceeds to rape her, and forcefully consummate their marriage."}],"firsts":["Joss","Ghita","Malko"],"deaths":["Ghita"],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Nikolaj Coster-Waldau","character":"Ser Jaime Lannister"},{"actor":"Lena Headey","character":"Queen Mother Cersei Lannister"},{"actor":"Aidan Gillen","character":"Lord Petyr Baelish"},{"actor":"Natalie Dormer","character":"Queen Margaery Tyrell"},{"actor":"Indira Varma","character":"Ellaria Sand"},{"actor":"Sophie Turner","character":"Princess Sansa Stark"},{"actor":"Maisie Williams","character":"Princess Arya Stark"},{"actor":"Jerome Flynn","character":"Ser Bronn"},{"actor":"Alfie Allen","character":"Reek"},{"actor":"Michael McElhatton","character":"Lord Roose Bolton"},{"actor":"Iwan Rheon","character":"Ramsay Bolton"},{"actor":"Tom Wlaschiha","character":"Jaqen H'ghar"},{"actor":"Dean-Charles Chapman","character":"King Tommen Baratheon"},{"actor":"with Iain Glen","character":"Ser Jorah Mormont"},{"actor":"Diana Rigg","character":"Lady Olenna Tyrell"},{"actor":"Jonathan Pryce","character":"the High Sparrow"},{"actor":"Alexer Siddig","character":"Prince Doran Martell"},{"actor":"DeObia Oparei","character":"Captain Areo Hotah"},{"actor":"Keisha Castle-Hughes","character":"Obara Sand"},{"actor":"Rosabell Laurenti Sellers","character":"Tyene Sand"},{"actor":"Jessica Henwick","character":"Nymeria Sand"},{"actor":"Finn Jones","character":"Ser Loras Tyrell"},{"actor":"Will Tudor","character":"Olyvar"},{"actor":"Eugene Simon","character":"Lancel"},{"actor":"Faye Marsay","character":"The Waif"},{"actor":"Adewale Akinnuoye-Agbaje","character":"Malko"},{"actor":"Toby Sebastian","character":"Prince Trystane Martell"},{"actor":"Nell Tiger Free","character":"Princess Myrcella Baratheon"},{"actor":"Charlotte Hope","character":"Myranda"},{"actor":"Elizabeth Webster","character":"Walda Bolton"},{"actor":"Michael Yare","character":"a slaver"},{"actor":"James McKenzie Robinson","character":"Joss"},{"actor":"Hattie Gotobed","character":"Ghita"},{"actor":"Richard Buick","character":"a Faith Militant"}]}
