{"title":"Sons of the Harpy","season":"5","episode":"4","date":"Sun May 03 2015","authors":["Dave Hill"],"directors":["Mark Mylod"],"info":"\"Sons of the Harpy\" is the fourth episode of the fifth season of Game of Thrones. It is the forty-fourth episode of the series overall. It premiered on May 3, 2015. It was written by Dave Hill, and directed by Mark Mylod.","plot":"The Faith Militant grow increasingly aggressive; Jaime and Bronn head south; Ellaria and the Sand Snakes vow vengeance.","summary":[{"location":"In King's Landing","content":"At a Small Council meeting, Master of Coin Mace Tyrell brings bad news that the Iron Bank of Braavos is starting to call in its debts from Westeros. They have started by calling in a tenth of the Iron Throne's current debts to the bank, which it can only afford half of as rebuilding the Royal Fleet was also a massive expense. Mace offers that House Tyrell could front the money for the time being, but Cersei clearly does not want to give the Tyrells more power over the crown. Instead, she says that they will send Mace himself to Braavos to negotiate for more time, because sending such a high-ranking official will show the bank how seriously they take their large debts. Mace is oblivious that this is also Cersei's way of removing him from the capital, and takes it as a high honor - as well as that Cersei will send Ser Meryn Trant of the Kingsguard along to \"guard\" him. After he leaves, Pycelle bitterly points out that the Small Council is growing even smaller (the only three members left in the capital are Pycelle, Cersei, and her lackey Qyburn), but she says it hasn't quite grown small enough yet.\n\n    Cersei meets with the High Sparrow.  \nCersei then meets with the High Sparrow, who by her influence, has been elected as the new High Septon of the Faith of the Seven. Cersei is trying to build up a new alliance between the Crown and the Faith, as a counterweight against the large political influence the Tyrells now possess. Cersei points out to the High Sparrow that the War of the Five Kings has devastated much of the countryside, resulting in septs being burned, clergymen attacked, and even Silent Sisters raped. Bodies of holy men are piling up in the streets. The High Sparrow admits that wars make men obey the sword more than the gods. Cersei points out that before the Targaryens, the military order known as the Faith Militant dispensed the justice of the Seven. The High Septon is confused, as the Targaryens disbanded the Faith Militant over two centuries ago. Cersei explains that, as part of the new alliance she hopes to build between the Crown and the Faith, she will tell her son to repeal the law and allow the Faith Militant to be reestablished and re-armed: an army whose purpose is to defend the Faith, holy men, and the smallfolk - and which will incidentally be turned against the Crown's enemies. She then advises him that there is a great sinner in their midst who has been shielded by gold and power. The High Sparrow replies with a wish for The Father to judge him justly.\nThe new Faith Militant storm the streets of King's Landing, attacking taverns, brothels, and street vendors selling idols from other religions. The City Watch look on, helpless, and do not intervene. They ransack Littlefinger's brothel, dragging prostitutes like Marei out into the street by their hair. Olyvar is struck and ignored as they barge in; he then sees that in another room they have singled out a man having sex with one of the male prostitutes, and approach him with a knife. Olyvar flees.\n\n    Tommen attempts to have his brother-in-law Loras released, but fails.  \nAs a sign of their zealotry, the Faith Militant have the Seven-Pointed Star symbol of the Faith carved into their foreheads - including Lancel, who leads a squad of the Faith Militant to apprehend Loras Tyrell while he is sparring in the practice yard. Lancel proclaims that Loras' sexual perversions are sins against the laws of gods and men, and Loras is dragged off. Margaery Tyrell is furious at Tommen for her brother's arrest, then tries to manipulate him by weeping at how hurt she is that he let this happen to Loras. Tommen then goes to his mother and, briefly standing up to her, demands that Loras be released at once. Cersei calmly points out that she didn't arrest Loras, the Faith Militant simply dragged him off and imprisoned him, so he should ask the High Sparrow to release him. Tommen naively thinks the High Sparrow will simply do as he requests, so he heads to the Great Sept of Baelor with five Kingsguard and several Lannister guards. The path to the Great Sept is blocked by the Faith Militant, who say that the High Sparrow is praying and does not wish to be disturbed. The Kingsguard request that Tommen let them kill the Faith Militant to pass. Tommen is surprised at this and does not want to risk bloodshed escalating matters - particularly, shedding blood on holy ground. Unsure of what to do, the mob of commoners behind him starts shouting that he is really a bastard and an abomination of incest. Realizing this is not going to end well, Tommen meekly withdraws back to the Red Keep. Margaery is even more upset at how ineffectual young Tommen was, so she leaves saying that she is going to bring her grandmother Olenna back to the capital to deal with this.\n\nI"},{"location":"In Dorne","content":"Jaime Lannister and Ser Bronn are on a Pentoshi merchant ship, which is headed to Oldtown in the Reach. They sail past Tarth, off the coast of the Stormlands, which Jaime mistakenly identifies as Estermont. The captain corrects him, stating that they are sailing through the Sapphire Isle, which reminds him of Brienne. Jaime explains to Bronn that he bribed the captain to let them take a small boat to shore as they pass Dorne, and they will land just outside of Sunspear and the adjacent Water Gardens. Below decks, Bronn remarks on why Jaime must want to go and protect Princess Myrcella for himself: he's the one who let Tyrion escape, and he hopes this will make up for that. Jaime curtly says that Varys did (when in fact, Jaime forced Varys to help him free Tyrion). Bronn says that if Jaime ever sees Tyrion again Jaime should give him his regards; Jaime angrily says that if he sees his brother again, he's going to split him in two for murdering their father Tywin.\n\n    Jaime uses his metal hand to stop a blade.  \nBronn rows the pair ashore at dusk, though Jaime can't help row with his one hand. When they awake the next morning Bronn kills a snake that was near Jaime's head and roasts it up for breakfast. Bronn is worried that the ship's captain will subsequently spread word that a Lannister is in Dorne; Jaime says he bribed him with a large bag of gold, but Bronn still worries. A mounted patrol soon comes by, however, and sees their tracks in the sand. Jaime and Bronn present themselves and try to pass off that they are simple travelers and their boat capsized in the night, but the ruse doesn't work, and the sentries demand that they drop their weapons so they can be taken prisoner and their identities confirmed. Bronn plants his sword in the sand - then quickly throws his dagger in the lead sentry's throat. Jaime and Bronn draw their swords and fight the rest. Jaime can't fight very well left-handed so Bronn kills one sentry's horse in order for Jaime to fight him on foot. Jaime is being overpowered but catches the sentry's sword with his metal hand at the last moment. He then uses the distraction to land a killing blow to the sentry with his left hand. Bronn, having finished off the other sentries, notes that they now have their horses: fine Dornish sand steeds, capable of running a day and a night without tiring. Jaime says the bodies need to be buried so they won't raise more questions. Bronn says it will take a lot of time to dig holes for them all, though Jaime again points out that he can't really do much digging with one hand. Annoyed, Bronn then drags off the bodies to bury.\n\n    The Sand Snakes torture a merchant ship captain.  \nMeanwhile, elsewhere outside of Sunspear, Ellaria Sand meets with three of the eight Sand Snakes, her lover Oberyn Martell's bastard daughters. Obara Sand, the eldest, is the daughter of a peasant; Nymeria Sand (commonly called \"Nym\") is the daughter of an eastern noblewoman; the youngest of the three, Tyene Sand, is Ellaria's own daughter. She informs them that Prince Doran Martell will not raise Dorne's armies to avenge his brother's death. They worry that they have no army to march against the Lannisters, but Ellaria tells them that they don't need one: to start a war, all they need to do is kill Cersei's daughter Myrcella, currently in Doran's possession.\nObara then points out that they may have a problem. The Pentoshi ship captain found her in Planky Town, and as Bronn feared, he indeed tried to sell her information about Jaime Lannister's arrival in Dorne. The Sand Snakes, however, were insulted that he wanted to be paid for such vital information instead of offering it freely, so they took him prisoner and tortured it out of him. Nymeria uses her whip to knock a bucket over, and reveals underneath that they buried the ship's captain neck-deep in the sand, with his head under a bucket full of poisonous scorpions. They realize that they are now in a race against time to see who can take Myrcella from Doran first: Jaime Lannister or themselves. Ellaria asks if the three girls are with her, knowing this will bring Dorne into war. Nymeria and Tyene say yes. Obara notes that when she first met Oberyn, he was a man whom she had never met who one day appeared, said he was her father, and that he was taking her away from her mother. Her mother wept, but Oberyn said that, \"we all must choose our battles and the gods let us choose our weapons.\" He threw his spear at her feet, pointed to her mother's tears, then to his spear, and told her to choose. She chose the spear - and answers Ellaria that she is with her, as she chose the path of the spear and war long ago. She then throws her spear to impale the ship captain's head.\n\nI"},{"location":"In the Free Cities","content":"Tyrion is held captive by Jorah.  \nAt Volantis, during the night, Jorah Mormont knocks out a fisherman and steals his boat, leaving with his captive Tyrion Lannister. Later when they are at sea, Tyrion urges for Jorah to remove his gag. Jorah will not volunteer any information about himself, but from a few observations (such as the bear sigil on his armor), Tyrion quickly surmises that he must be Jorah Mormont. He admits to Tyrion that the \"Queen\" he is taking him to is not Cersei but Daenerys. Tyrion recalls from Small Council meetings that Jorah was spying on Daenerys for Varys. Given that he is half the world away from Daenerys, he also accurately deduces that she must have found out he was spying on her and had him exiled - and therefore, he kidnapped Tyrion in the hope that presenting him as a gift to Daenerys will get him back in her favor. Tyrion laughs aloud at his situation, informing Jorah that he was already heading to meet Daenerys, so this is a waste of a kidnapping. Tyrion also points out that there is no guarantee this will assuage Daenerys, and it is just as likely she will remain angry at Jorah, and welcome himself as an ally. Jorah smacks Tyrion across the face, quieting him down.\n\nA"},{"location":"At the Wall","content":"Melisandre seduces Jon.  \nJon Snow trains recruits in the practice yard of Castle Black, as Stannis Baratheon and his wife Selyse watch, along with their daughter Shireen. Selyse is worried that Stannis wishes Jon was his son, because she gave him only stillbirths and weakness, but he says that wasn't her fault. Melisandre joins them and appears to quite firmly take Stannis's side, declaring that the Lord of Light doesn't care about Shireen's Greyscale disfigurement, and this doesn't change the fact that she has her father's blood. When Selyse departs, Melisandre discusses the coming battle to take Winterfell from the Boltons. She asks if Stannis intends to leave her behind as he did at the Blackwater, but Stannis assures her he won't this time.\nAs the new Lord Commander, Jon goes over paperwork with Samwell Tarly, letters they have received from minor Houses offering up a handful of new recruits. Jon balks when Samwell hands him a request letter for Roose Bolton, saying he killed his brother Robb. Sam points out that Roose Bolton is now the Warden of the North, and he has the most recruits to send them - much more than the pittances offered by the other minor Houses Jon has never even heard of. He reminds Jon that the Night's Watch has sworn an oath of political neutrality. With disgust, Jon reluctantly signs the letter to the Boltons.\nAs Sam departs, Melisandre enters. She entreats him to assist Stannis in retaking Winterfell, pointing out that even if he doesn't become a Stark, his familiarity with the castle could win them the battle. She also acknowledges that there is a greater war at stake, and asks Jon if he is on the side of life or death, undoing her dress and straddling him as she does so. She encourages Snow to take her, as the Lord of Light made humans male and female for a reason; although clearly tempted, Jon refuses, citing his vows, and the fact that Stannis wouldn't approve (to which Melisandre suggests they not tell him). When Melisandre points out that he broke his vows once before, Snow acknowledges that he still feels for his deceased love. Melisandre adjusts her dress and leaves, but not before uttering the words the new Lord Commander thought he'd never hear again: \"You know nothing, Jon Snow.\"\nLater, Stannis is in his chambers at Castle Black working on other letters, and Shireen enters. Stannis begins to apologise for dragging her along on campaign with him, as Castle Black is hardly a place for a child, but Shireen cuts him off; she is happy to have come, having expected to be left at Dragonstone, as Selyse had made it clear she wanted. Shireen asks her father if he is ashamed of her because of her deformity; Stannis gets up from his table and explains that not long after Shireen was born, a Dornish trader arrived on Dragonstone and, having heard of Shireen's birth, gave a wooden doll as a gift for the newborn girl. Unfortunately, the doll was contaminated with greyscale, and by the time that was discovered, Shireen had already contracted the disease. Everyone claimed Shireen would die of it sooner or later, and urged Stannis to send her to the ruins of Valyria to live out her days with the \"Stone Men\" before the disease infected the rest of the castle; Stannis says he told them all to go to hell and summoned every healer, apothecary and Maester he could to save Shireen. Stannis insists that Shireen is his daughter and he would not send her away because she belonged with her family. Shireen, overjoyed at her father's declaration, runs over and gives him a hug which, after an awkward pause, Stannis returns.\n\nI"},{"location":"In the North","content":"Sansa visits the tombs of her family.  \nAt Winterfell, Sansa Stark takes the opportunity to visit her family's underground crypts. She comes to the tomb and statue of her aunt Lyanna Stark (and finds the feather token that Robert Baratheon left there years ago when he visited the castle). Petyr Baelish arrives and says he thought he'd find her there. Sansa remarks that her father, Eddard Stark, never talked about Lyanna, but she would at times find him down in the crypts lighting candles at her tomb. Sansa never knew Lyanna because she died before she was born, but she notes that people say she was beautiful.\nLittlefinger says that he actually saw Lyanna once years ago, and she was as beautiful as everyone says. Back when he was a boy living with Sansa's mother's family, the old Lord Whent of Harrenhal held a massive tournament: every notable figure of the time came from across Westeros: the Mad King, Crown Prince Rhaegar Targaryen, Robert Baratheon, Lyanna Stark, everyone. Lyanna had already been publicly betrothed to Robert at the time. Baelish remembers how awed he was, a boy from nowhere and with no significant holdings, to see all of these living legends gathered in one place. In the final tilt, Prince Rhaegar rode against Ser Barristan Selmy. Rhaegar won and the entire crowd erupted in cheers - only to suddenly drop dead silent when Rhaegar rode right past his wife, Elia Martell, to lay the victor's crown (made of blue winter roses) in Lyanna's lap. Not long afterwards, Rhaegar made off with Lyanna, sparking off Robert's Rebellion which overthrew the Targaryen dynasty. Littlefinger wonders how many thousands died because Rhaegar chose Lyanna - to which Sansa says that he chose her, then kidnapped and raped her. Baelish gives her a wry look and moves on to another part of the crypts.\nSansa notices that Littlefinger is wearing riding clothes, and he explains that he is heading back to King's Landing, because Cersei sent a letter requesting his presence and it would be best not to make her suspicious by refusing to come. Sansa will be alone with the Boltons but he explains his plan to her: Stannis will have to attack the Boltons soon if he is to beat the winter snows, and he bets that Stannis will probably win, because he is one of the best military commanders in all of Westeros, and the Boltons will be outnumbered by Stannis, as the other northern houses would be quick to betray their liege lord. Stannis will then make Sansa the new ruler of the North, as the last (known) surviving Stark heir and in memory of her father Eddard's support for Stannis. Sansa asks what will happen on the off chance that Stannis gets killed, and Littlefinger explains that marrying Ramsay Bolton now will at least leave Sansa in a position to insinuate herself among the Boltons and help destroy them from within in future plans. Either way, Sansa will be Littlefinger's powerful \"ally\" in the North. Littlefinger kisses Sansa on the lips, and departs.\n\nI"},{"location":"In Meereen","content":"Dany speaks with Ser Barristan.  \nIn Meereen, Daenerys Targaryen is looking down on the streets below from her royal apartments in the Great Pyramid, and Ser Barristan Selmy also brings up Rhaegar Targaryen. He says that the city's inhabitants always seem happy from such a distance, but Rhaegar actually liked to leave the Red Keep and mingle with the common people on the streets. Barristan accompanied him often to guard him, and says that Rhaegar liked to sing to people. He was a great singer, so he would find a place on one of the streets just like any public minstrel and sing. He liked to see how much money he could make, and everyone enjoyed his singing, so he often made quite a lot. Daenerys is surprised, because her brother Viserys only told her that Rhaegar was a great killer. \n\n    An injured Grey Worm continues to fight the Sons of the Harpy.  \nBarristan scoffs that Rhaegar was a great warrior but never enjoyed killing, he was a gentle man who enjoyed singing. She asks what they did with all the money, and Barristan says that they did all sorts of things: sometimes they just gave it to the next minstrel on the road, once Rhaegar gave it all to an orphanage in the slums of Flea Bottom, and one time they spent it to get horribly drunk. Daario Naharis then comes to say that the day's supplicants are waiting in the throne room, chief among them Hizdahr zo Loraq. Aware of his dislike of politics, Daenerys asks if Barristan wants to attend her in the throne room; after being assured that Daario has her back, she gives him the day off, cheerfully telling him to make some music in the city below.\nHizdahr again beseeches Daenerys to reopen the fighting pits of Meereen, because today is the traditional beginning of the fighting season. Daenerys again refuses, but Hizdahr rationally argues that the fighting pits provide a great spectacle that has always been enjoyed by both the slave-masters and slaves, and is one of the few things that can bring the city together. Bringing back this major tradition will not instantly solve all of her problems, he concedes, but it would be a start at mending together her subjects.\n\n    Barristan runs towards danger.  \nAs he speaks, the Sons of the Harpy are already mounting a series of large-scale attacks in the streets. A Meereenese prostitute helps them distract and kill some of the Second Sons, and when a patrol of Unsullied arrives, she feigns fear and directs them into a trap by pointing that the Sons of the Harpy ran into a narrow alleyway. The Unsullied give chase, only to be surrounded by a much larger number of the Sons of the Harpy. Brutal fighting rages throughout the streets of Meereen. Grey Worm is among the ambushed Unsullied; he kills many attackers, though he loses his helmet, is slashed in the leg, and is stabbed in his side. Grey Worm pulls the dagger out of himself, stabs a foe in the throat with it, and keeps fighting, though his wounds slow him considerably. Most of the Sons of the Harpy are dead but they outnumber the Unsullied so much to begin with that only Grey Worm is left. Just then, Ser Barristan arrives and saves Grey Worm by drawing the attention of the remaining rebels. He takes on eight Sons of the Harpy and defeats them all, save for the last one, who stabs him in the belly. He falls to his knees and just as his attacker is about to slit his throat, Grey Worm takes him out by shoving his spear into his back. Grey Worm staggers over Barristan, but he has lost consciousness. Severely wounded, Grey Worm then slumps down to the floor next to him."}],"firsts":["Brother Boake","Merchant captain","Lead Dornish Guard","Obara Sand","Nymeria Sand","Tyene Sand"],"deaths":["Merchant captain","Lead Dornish Guard","Ser Barristan Selmy"],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Nikolaj Coster-Waldau","character":"Ser Jaime Lannister"},{"actor":"Lena Headey","character":"Queen Cersei Lannister"},{"actor":"Emilia Clarke","character":"Queen Daenerys Targaryen"},{"actor":"Kit Harington","character":"Lord Commander Jon Snow"},{"actor":"Aidan Gillen","character":"Lord Petyr Baelish"},{"actor":"Natalie Dormer","character":"Queen Margaery Tyrell"},{"actor":"Stephen Dillane","character":"King Stannis Baratheon"},{"actor":"Carice van Houten","character":"Lady Melisandre"},{"actor":"Indira Varma","character":"Ellaria Sand"},{"actor":"John Bradley","character":"Samwell Tarly"},{"actor":"Sophie Turner","character":"Lady Sansa Stark"},{"actor":"Jerome Flynn","character":"Ser Bronn"},{"actor":"Michiel Huisman","character":"Daario Naharis"},{"actor":"Nathalie Emmanuel","character":"Missandei"},{"actor":"Dean-Charles Chapman","character":"King Tommen Baratheon"},{"actor":"with Iain Glen","character":"Ser Jorah Mormont"},{"actor":"Jonathan Pryce","character":"the High Sparrow"},{"actor":"Ian McElhinney","character":"Ser Barristan Selmy"},{"actor":"Julian Glover","character":"Grand Maester Pycelle"},{"actor":"Anton Lesser","character":"Qyburn"},{"actor":"Tara Fitzgerald","character":"Queen Selyse Baratheon"},{"actor":"Roger Ashton-Griffiths","character":"Lord Mace Tyrell"},{"actor":"Jacob Anderson","character":"Grey Worm"},{"actor":"Ian Beattie","character":"Ser Meryn Trant"},{"actor":"Joel Fry","character":"Hizdahr zo Loraq"},{"actor":"Eugene Simon","character":"Lancel Lannister"},{"actor":"Ben Crompton","character":"Eddison Tollett"},{"actor":"Keisha Castle-Hughes","character":"Obara Sand"},{"actor":"Rosabell Laurenti Sellers","character":"Tyene Sand"},{"actor":"Jessica Henwick","character":"Nymeria Sand"},{"actor":"Kerry Ingram","character":"Shireen Baratheon"},{"actor":"Brenock O'Connor","character":"Olly"},{"actor":"Finn Jones","character":"Ser Loras Tyrell"},{"actor":"Will Tudor","character":"Olyvar"},{"actor":"Gary Pillai","character":"a merchant captain"},{"actor":"Christian Vit","character":"the lead Dornish guard"},{"actor":"Josephine Gillan","character":"Marei"},{"actor":"Meena Rayann","character":"Vala"},{"actor":"Simon Norbury","character":"a Faith Militant"},{"actor":"Jack Olohan","character":"a Faith Militant"},{"actor":"Slavko Sobin","character":"a Second Son"},{"actor":"Paddy Wallace","character":"the lead Kingsguard"},{"actor":"Allon Sylvain","character":"a foreign merchant"},{"actor":"Ben Yates","character":"a Brothel customer"},{"actor":"Samantha Bentley","character":"a whore"},{"actor":"Xena Avramidis","character":"a whore"},{"actor":"Portia Victoria","character":"a whore"},{"actor":"Em Scribbler","character":"a whore"},{"actor":"Rebecca Scott","character":"a whore"},{"actor":"Rosie Ruthless","character":"a whore"},{"actor":"Bobby Marno","character":"Night's Watch Man"},{"actor":"Unknown","character":"Boake"}]}
