{"title":"The Gift","season":"5","episode":"7","date":"Sun May 24 2015","authors":["David Benioff","D.B. Weiss"],"directors":["Miguel Sapochnik"],"info":"\"The Gift\" is the seventh episode of the fifth season of Game of Thrones. It is the forty-seventh episode of the series overall. It premiered on May 24, 2015. It was written by David Benioff and D.B. Weiss, and directed by Miguel Sapochnik.","plot":"Jon prepares for conflict. Sansa tries to talk to Theon. Brienne waits for a sign. Stannis remains stubborn. Jaime attempts to reconnect with family.","summary":[{"location":"At the Wall","content":"Jon departs for Hardhome with Tormund and a group of rangers, after speaking with Ser Alliser Thorne and Sam. Before they leave, Sam gives Jon some of his dragonglass weapons, reminding him of their use against the White Walkers. Afterward, Sam and Gilly visit Maester Aemon, who is bedridden and dying from old age. Gilly brings her baby Little Sam for him to hold and cheer him up a little. Aemon happily notes that her son has a laugh just like his little brother Egg (King Aegon V) had when he was a baby. In a moment of clarity, Aemon gravely warns Gilly that she and her son must leave the Wall while they still can, before winter comes (and the White Walkers with it). Aemon's condition steadily deteriorates during the night, and he fades in and out of consciousness. Near the end he wakes up delirious from a dream, still lost in memory from his youth: he calls out to his brother Egg, and says that he had a strange dream that he was an old man. Aemon passes away soon afterwards.\n\n    Samwell loses his virginity with Gilly.  \nIn the courtyard of Castle Black, Sam eulogizes Aemon before lighting his funeral pyre, declaring for all to hear that he was the blood of the dragon - \"but now his watch is ended.\" Ser Alliser whispers that Sam's friends are abandoning him one by one. Afterward, Gilly is attacked in the dining hall by two brothers, but Sam and Jon's direwolf, Ghost, come to her rescue. Sam is badly beaten, and Gilly tends to his injuries. Still in grief at Aemon's death and impressed by Sam defending her, Gilly climbs on top of him and they have sex.\n\nI"},{"location":"In the North","content":"At Winterfell, Reek brings food to Sansa. She begs him for help, telling him how she has been locked in her bedchamber since her wedding and is visited by Ramsay every night and he forces himself on her. Reek simply tells her to obey Ramsay or else he would do worse things to her. Sansa asks what Ramsay did to Reek to break him to such an extent, but he can't bring himself to tell her. He tries to leave but Sansa grabs and reminds him that he betrayed her family, making Reek apologize profusely. Sansa informs him that her family still has allies in the North and tells him to light a candle at the top of the Broken Tower which will signal them that she is in danger. When Reek refuses to do it, Sansa reminds him of his true name, Theon Greyjoy, and makes him promise that he'll help her. Reek hesitantly agrees. He trudges through the snow with the candle, up a flight of stairs and into Ramsay’s room.\nLater, Sansa is taken to see Ramsay on the ramparts, which are still under construction. While he is distracted, Sansa grabs a workman's tool lying on a nearby barrel and pockets it. Ramsay speaks of his thoughts on how they will easily defeat Stannis's army since their soldiers, unlike Stannis's, are trained to fight in the snow, and how he'll one day be the Lord of Winterfell and the Warden of the North.\nSansa reminds him of the unborn baby, who, if a boy, will have a stronger claim on the North since he'll be a true-born. Ramsay tells her that he is Roose Bolton's eldest son, legitimized by the king, who Sansa reminds him is another bastard. Ramsay is obviously angered by Sansa's remarks, but doesn't act on it, simply stating that bastards can rise in the world too, informing her of Jon's appointment as Lord Commander of the Night's Watch. Ramsay then brings up the reason why he summoned her, and shows her the crucified and partly flayed corpse of the old woman who promised to help Sansa if she lit a candle in the Broken Tower. Ramsay then reveals to Sansa that Reek, who seems miserable to have squashed Sansa's only hope of an escape, came to him and told him everything. Sansa chokes back tears as a gleeful Ramsay orders his men to take her back to her chamber. Meanwhile, Brienne stares intently at Winterfell castle from her room in the inn, waiting for the sign to rescue Sansa.\nStannis's troops make camp during a violent snowstorm. Davos Seaworth meets with Stannis and informs him that forty horses died the previous night and more will die come sunset. The Stormcrows, a sellsword company, have fled in the night. Davos thinks that they should go back to Castle Black and wait out the weather since they do not have enough food, but Stannis stubbornly tells him that they will not retreat to Castle Black because he will not risk being known as \"the King who Ran\". As winter will soon arrive, they also run the risk of being stuck at Castle Black for years, during which the Boltons will regain their strength. Seeing no other way to convince Stannis otherwise, Davos leaves.\nStannis asks Melisandre if she is sure of their victory at Winterfell. Melisandre assures him, reminding him that he also saw the vision of his victory in the flames, but Stannis is not so sure what he saw anymore. Melisandre reassures him that her visions will come true, but also states that a sacrifice, one with King's blood, must be made in order to ensure their victory, implying that they sacrifice Shireen. Stannis is infuriated by the suggestion and orders her to leave.\n\nI"},{"location":"In Dorne","content":"Prince Doran has Areo Hotah bring Myrcella to Jaime in the quarters where he is confined, as Jaime is concerned for her safety. Displaying a somewhat more critical mind than her brothers, Myrcella is suspicious about Jaime's \"diplomatic mission\" to bring her back to King's Landing, to which Jaime only replies that there are \"complicated matters\" involved. Myrcella flatly refuses to return with him, stating her intent to marry Trystane.\nBronn is singing The Dornishman's Wife in his jail cell, while in the adjoining cell, the Sand Snakes listen with a mix of annoyance from Obara and Nymeria and amusement from Tyene. After he finishes, the two parties trade barbs, and Tyene inquires about Bronn's arm, which she cut with her daggers during their earlier fight, with Bronn brushing it off as \"a new scar\". The two begin to talk about Tyene's beauty, which Bronn dismisses until she begins to disrobe. Bronn stares intently, and begins to change his mind about her. Tyene once again inquires about his arm, and then his head, at which point Bronn's nose starts bleeding and his vision blurs.\nBronn collapses and tries to play off his sudden illness, but Tyene reveals that her daggers were coated with a slow-acting poison called The Long Farewell, and her attempts to seduce Bronn were to get his heart pumping faster, thereby allowing the poison to act quicker. She points to an ampoule on her necklace, which contains the antidote, but only offers to give it to Bronn on the condition that he agrees that she is the most beautiful woman in the world. Growing weaker, Bronn barely manages to reply affirmatively, and she tosses the ampoule to a relieved Bronn. Tyene smiles smugly at him and remarks that she finds him handsome as well, before re-robing and sitting down next to her mildly amused half-sisters.\n\nI"},{"location":"In King's Landing","content":"In the Great Sept of Baelor, Lady Olenna meets with the High Sparrow to discuss the imprisonment of her grandchildren, Ser Loras and Queen Margaery. Although they briefly bond over the infirmities of age, she demands that he release them and he declines, stating they will be punished for their crimes. The High Sparrow tells her that the Gods' Laws must be applied to everyone equally. Olenna first tries to bribe him, but learning that he cannot be bought, threatens to end the Tyrell support for the capital by ending shipments of food. Again the High Sparrow is unfazed, remarking that the nobility of Westeros have forgotten they are outnumbered by the common folk and tells Olenna to ponder what happens when the many stop fearing the few. Returning to her palanquin, Olenna receives a letter bearing Petyr Baelish's seal.\nMeanwhile, in the Red Keep, King Tommen rails over his inability to help Margaery. He wants to start a war for Margaery, declaring his love for her to a dumbstruck Cersei. To maintain control of the situation, she offers to speak with the High Sparrow for him and advocate for Margaery and Loras's release. Although clearly suspicious, the still-overwhelmed Tommen agrees.\nLittlefinger meets with Olenna in his ransacked brothel, where they share a tense conversation. Olenna reminds him of the role they both played in Joffrey's murder, and that, should her House fall, she will have no reason to keep his involvement a secret. Littlefinger explains why he returned to King's Landing - he dared not refuse Cersei's summons, and was obliged to give her information. He tells Olenna that he will give her the same thing he gave Cersei: a handsome young man — implied, in this instance, to be Lancel.\nIn the Sept's cells, Cersei meets with Margaery and brings her food but Margaery refuses, revealing that she knows her mother-in-law is responsible for having her and Loras imprisoned. Cersei, fearful of being overheard, denies this. Margaery mocks Cersei for her unconvincing lies of trying to save her, going as far as to say that while she knows how to lie and scheme, she doesn't understand innocence and decency, which Margaery suspects is why Tommen loves her, Margaery, and was willing to send Cersei back to Casterly Rock. Cersei, concealing her fury, tells Margaery her trial will soon begin and that her son needs his mother more than ever. Margaery throws the stew at Cersei, and yells at her to get out. Cersei leaves the cell, smiling smugly at Margaery.\nOn her way out, a still gleeful Cersei meets with the High Sparrow in a chapel that predates the Great Sept. The pair briefly discuss the legal process that Margaery and Loras will face. As the conversation goes on, however, it's clear that the High Sparrow is about to turn the tables on Cersei. When Brother Lancel appears, Cersei realizes what is about to happen, and her triumphant smile begins to crack. The High Sparrow has an irate Cersei taken into custody by a group of Septas who ignore Cersei's threats and lock her in a cell.\n\nI"},{"location":"In Meereen","content":"Jorah is sold by Malko to Yezzan zo Qaggaz. Before Yezzan leaves, Tyrion convinces him that Jorah and he are a team, and is also bought. In Meereen, Daenerys and Daario discuss her impending marriage to Hizdahr zo Loraq. After rejecting his suggestion that she marry him instead, Daario advises her that, on the day the fighting pits are reopened, she should gather all the Great, Wise and Good Masters and kill them. Dany is reluctant to do so, as she believes it will give her the reputation of a butcher, to which Daario replies that \"all rulers are either butchers or meat\".\nYezzan takes his fighters to Meereen, to test them in the lower pits and seek out those who are worthy to fight in the Great Pit of Daznak. They fight in front of a reluctant Daenerys, as Hizdahr has convinced her that Meereen's ruler occasionally makes the rounds to the lower pits ahead of the main tournament. Jorah enters the Pits early, upon realizing that she is watching and will be repulsed by what she's seeing, and elbows down Yezzan who tried to berate him. Jorah easily defeats the other fighters without killing them, impressing Dany enough to prevent her from leaving. When he reveals his identity, however, her face swiftly twists into a scowl and she orders him taken away. Before the Unsullied can comply, Jorah declares that he brought her a gift, and Tyrion enters the arena and reveals his identity to the astonished Queen."}],"firsts":["Brant","Derek","Arryk","Erryk","Yezzan zo Qaggaz","Boake","Septa Unella","Moelle","Scolera"],"deaths":["Maester Aemon","Old woman"],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Nikolaj Coster-Waldau","character":"Ser Jaime Lannister"},{"actor":"Lena Headey","character":"Queen Mother Cersei Lannister"},{"actor":"Emilia Clarke","character":"Queen Daenerys Targaryen"},{"actor":"Kit Harington","character":"Lord Commander Jon Snow"},{"actor":"Aidan Gillen","character":"Petyr \"Littlefinger\" Baelish"},{"actor":"Natalie Dormer","character":"Queen Margaery Tyrell"},{"actor":"Stephen Dillane","character":"King Stannis Baratheon"},{"actor":"Liam Cunningham","character":"Ser Davos Seaworth"},{"actor":"Carice van Houten","character":"Melisandre"},{"actor":"John Bradley","character":"Samwell Tarly"},{"actor":"Kristofer Hivju","character":"Tormund Giantsbane"},{"actor":"Hannah Murray","character":"Gilly"},{"actor":"Dean-Charles Chapman","character":"King Tommen Baratheon"},{"actor":"Alfie Allen","character":"Reek"},{"actor":"Sophie Turner","character":"Lady Sansa Stark"},{"actor":"Iwan Rheon","character":"Ramsay Bolton"},{"actor":"Gwendoline Christie","character":"Brienne of Tarth"},{"actor":"Jerome Flynn","character":"Ser Bronn"},{"actor":"Michiel Huisman","character":"Daario Naharis"},{"actor":"with Iain Glen","character":"Ser Jorah Mormont"},{"actor":"Diana Rigg","character":"Lady Olenna Tyrell"},{"actor":"Jonathan Pryce","character":"the High Sparrow"},{"actor":"Peter Vaughan","character":"Maester Aemon"},{"actor":"Owen Teale","character":"Ser Alliser Thorne"},{"actor":"Ben Crompton","character":"Eddison Tollett"},{"actor":"DeObia Oparei","character":"Captain Areo Hotah"},{"actor":"Enzo Cilenti","character":"Yezzan zo Qaggaz"},{"actor":"Keisha Castle-Hughes","character":"Obara Sand"},{"actor":"Rosabell Laurenti Sellers","character":"Tyene Sand"},{"actor":"Jessica Henwick","character":"Nymeria Sand"},{"actor":"Daniel Portman","character":"Podrick Payne"},{"actor":"Joel Fry","character":"Hizdahr zo Loraq"},{"actor":"Nell Tiger Free","character":"Princess Myrcella Baratheon"},{"actor":"Brenock O'Connor","character":"Olly"},{"actor":"Eugene Simon","character":"Lancel"},{"actor":"Adewale Akinnuoye-Agbaje","character":"Malko"},{"actor":"Hannah Waddingham","character":"Septa Unella"},{"actor":"Brian Fortune","character":"Othell Yarwyck"},{"actor":"Michael Condron","character":"Bowen Marsh"},{"actor":"Ian Lloyd Anderson","character":"Derek"},{"actor":"Jonathan Byrne","character":"Brant"},{"actor":"Nikola Bace","character":"a Tyrell guard"},{"actor":"Roman Beguns","character":"a Fighter"},{"actor":"James Bleakney","character":"a Baratheon Soldier"},{"actor":"Rob de Groot","character":"a Fighter"},{"actor":"Graeme Peacock","character":"a Volantis Fighter"},{"actor":"Mark Quigley","character":"a Baratheon Fighter"},{"actor":"Michael Stuart","character":"a Night's Watch Officer"},{"actor":"Unknown","character":"Boake"}]}
