{"title":"Breaker of Chains","season":"4","episode":"3","date":"Sun Apr 20 2014","authors":["David Benioff","D.B. Weiss"],"directors":["Alex Graves"],"info":"\"Breaker of Chains\" is the third episode of the fourth season of Game of Thrones. It is the thirty-third episode of the series overall. It premiered on April 20, 2014. It was written by executive producers David Benioff and D.B. Weiss and directed by Alex Graves.","plot":"In the frenzied aftermath of the royal wedding, Tyrion gets a visit from a loyal subject. Meanwhile, Tywin offers to work for the common good with a presumed enemy; Sam takes stock of the personnel at Castle Black; the Hound gives another life lesson to Arya; and Daenerys makes a decision outside the walls of Meereen.","summary":[{"location":"At King's Landing","content":"With King Joffrey dead, Cersei mourns the death of her elder son with the heir apparent and, still holding Joffrey in her arms, demands that Sansa Stark be found. Her father seals the capital, so no one can leave. Prince Tommen Baratheon, in the Great Sept of Baelor. Tywin Lannister, also present, immediately begins instructing the young prince on the qualities of a good king. As Tywin and Tommen leave, Jaime enters to see Cersei calling for the death of the accused Tyrion and his wife, Sansa Stark. Jaime sends the septon and septas away so he can be alone with Cersei. He tries to comfort her through his affections. She refuses initially, but Jaime is aggressive. Cersei insists that the sept during a private viewing of their son's corpse is a highly inappropriate place for sex, and asks Jaime to stop, saying \"It isn't right, it isn't right...\" and Jaime refuses to stop, saying, \"I don't care, I don't care...\". They then have sex next to their dead son's corpse.\nA flashback to the wedding reveals Sansa escaping with Ser Dontos Hollard from King's Landing to a ship off the coast. As Sansa is taken aboard, she is greeted by Lord Petyr \"Littlefinger\" Baelish. He remembers that he still owes Dontos his fee, but Baelish has two men kill him with crossbows. He explains to Sansa that Ser Dontos was a drunken fool and an unreliable ally who only helped Sansa for money and would turn her in for money. To prove his point, he shows that the priceless necklace Dontos gave her was actually made a few weeks ago on Baelish's orders. Sansa is confused and horrified, but Baelish promises to keep her safe.\nTywin interrupts Oberyn Martell and his group sex act with Ellaria Sand and Olyvar to discuss Tyrion's up-coming trial for the murder of Joffrey. Tywin brings up Oberyn's knowledge of poisons and the link between that and Joffrey's death – as some say the King was poisoned – and wonders whether Oberyn had helped Tyrion. The topic changes to the murder of Oberyn's sister Elia by Tywin's \"pet,\" the Mountain, during the Sack of King's Landing. Tywin denies ordering her death, but promises to arrange a meeting between Oberyn and the Mountain so he can have his justice. He also offers Oberyn a position on the Small Council, if Oberyn agrees to be the third judge at Tyrion's trial. He explains that he is eager to bring Dorne back into the fold, wanting to unite the Seven Kingdoms against more obvious threats; the Greyjoys are in rebellion, a Wildling army is advancing on the Wall, and there is a Targaryen girl in the East with a powerful army and three dragons, who will eventually threaten Westeros. Tywin observes that only the Dornish successfully resisted Aegon Targaryen's dragons during his invasion of Westeros three centuries ago; Oberyn dryly notes it must be hard for Tywin to admit he needs the Dornish for help.\nTyrion is in a cell in King's Landing. He is visited by his squire, Podrick Payne, who has smuggled in some food and other items for him. Pod has been asked to compile a list of Tyrion's witnesses. He names his wife, Sansa, but Pod informs him that she disappeared moments after Joffrey's death. He cannot speak to Bronn either because, as a close associate of Tyrion, he is also under investigation. Pod confirms that there has been no word of Shae, which Tyrion takes as good news. Tyrion then asks to speak with Jaime. He also warns Pod to be aware of his surroundings and watch out for \"They,\" \"They\" being the spies of Tywin, Cersei, Varys or more or less anyone else. He opines that many people had a motive for killing Joffrey. Cersei is the only person he rules out. He urges Pod to get out of King's Landing as he would be in much danger due to his close relations with Tyrion, especially after refusing to testify against Tyrion, despite the offer of a knighthood. As Pod is about to leave, Tyrion calls him back and tells him that \"there has never lived a more loyal squire.\"\n\nI"},{"location":"In the Riverlands","content":"Meanwhile, Arya Stark and the Hound, crossing the Riverlands, are spotted by a farmer and his young daughter while making their way to the Vale where Arya can be ransomed to her \"rich\" aunt, Lysa Tully. Arya quickly fabricates a story that the Hound and she are father and daughter, with Clegane as a knight in service of House Tully. The farmer believes it and allows the pair to stay the night in his home and share a meal. Famished, Arya and the Hound scarf the food down hastily. Arya wakes the following morning to hear the farmer's daughter screaming. Clegane has assaulted the farmer and taken his silver. Confused and horrified, Arya demands to know why Clegane did that. He simply states, \"a dead man doesn't need his silver,\" claiming the farmer is weak and he and his daughter will not survive the upcoming winter.\n\nA"},{"location":"At Dragonstone","content":"On Dragonstone Isle, Stannis Baratheon learns of Joffrey's death and warns Ser Davos that their time to lay claim to the Iron throne dwindles if no army can be secured to wage war again. Shortly after, when Ser Davos begins his reading lessons with princess Shireen Baratheon, he realizes a possible ally across the Narrow Sea, the Iron Bank of Braavos. \n\nA"},{"location":"At the Wall and the North","content":"At Castle Black, Samwell Tarly fears for the safety of Gilly and moves her to a vassal town that frequently services the Nights Watch brothers in bodily vices. Sam is resolute in keeping Gilly safe from all harm however and pledges to visit Gilly as much as possible, instructing the inn at which he leaves her, that she will not be touched. Meanwhile, a village south of the wall is attacked by raiding wildlings under Tormund and the cannibalistic Thenns. While the village is massacred, a lone boy is sent by the Styr as a messenger to Castle Black to relay an account of the massacre and also a warning that more would follow. The Lord Commander states that they do not have the manpower to afford venturing away from the Wall. They are interrupted when two rangers, Edd and Grenn, arrive back at Castle Black after escaping Craster's Keep. Jon reveals he told Mance Rayder that a thousand men armed Castle Black and therefore points out that when Mance reaches Craster's Keep, Rast and Karl will not hesitate in revealing the truth. Jon then insists the Night's Watch send a party to Craster's Keep to kill their traitor brothers before Mance gets to them first.\n\n​"},{"location":"​Across the Narrow Sea","content":"In Slaver's Bay, Daenerys Targaryen marches on the city of Meereen as she begins her siege of the slave city. She is faced with a champion's duel where a riding knight of Meereen challenges her to choose a champion that will fight for her. Grey Worm, Jorah and Barristan all volunteer to stand as her champion; she refuses all three as too valuable to her. Daario Naharis, commander of the Second Sons, then volunteers to be Dany's champion, and she accepts. As Naharis quickly dispatches the Meereen champion, Dany begins her siege of the city by speaking of freedom to the gathered slaves and then catapulting the broken chains of those she has freed across the city walls, demonstrating her previous successes. As the slaves examine the broken chains, the Great Masters look on, perhaps in fear."}],"firsts":["Farmer","Sally","Mole's Town whore","Mole's Town madam","Whore","Olly","Guymon","Olly's mother","Oznak zo Pahl","Hizdahr zo Loraq","Hizdahr zo Loraq's manservant","Slave master","Slave master","Slave","Slave master"],"deaths":["Ser Dontos Hollard, shot by crossbow on the orders of Petyr Baelish","Guymon, killed by Ygritte","Olly's mother, killed by Styr, Magnar of Thenn","Oznak zo Pahl, decapitated by Daario Naharis"],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Nikolaj Coster-Waldau","character":"Ser Jaime Lannister"},{"actor":"Lena Headey","character":"Queen Cersei Lannister"},{"actor":"Emilia Clarke","character":"Queen Daenerys Targaryen"},{"actor":"Kit Harington","character":"Jon Snow"},{"actor":"Aidan Gillen","character":"Lord Petyr Baelish"},{"actor":"Charles Dance","character":"Lord Tywin Lannister"},{"actor":"Natalie Dormer","character":"Lady Margaery Tyrell"},{"actor":"Liam Cunningham","character":"Ser Davos Seaworth"},{"actor":"Stephen Dillane","character":"King Stannis Baratheon"},{"actor":"Jack Gleeson","character":"King Joffrey Baratheon"},{"actor":"Sophie Turner","character":"Princess Sansa Stark"},{"actor":"Maisie Williams","character":"Princess Arya Stark"},{"actor":"Rory McCann","character":"Sandor Clegane"},{"actor":"John Bradley","character":"Samwell Tarly"},{"actor":"Rose Leslie","character":"Ygritte"},{"actor":"Kristofer Hivju","character":"Tormund Giantsbane"},{"actor":"Hannah Murray","character":"Gilly"},{"actor":"Gwendoline Christie","character":"Brienne of Tarth"},{"actor":"Conleth Hill","character":"Lord Varys"},{"actor":"with Iain Glen","character":"Ser Jorah Mormont"},{"actor":"Diana Rigg","character":"Lady Olenna Tyrell"},{"actor":"Pedro Pascal","character":"Prince Oberyn Martell"},{"actor":"Indira Varma","character":"Ellaria Sand"},{"actor":"Michiel Huisman","character":"Daario Naharis"},{"actor":"Peter Vaughan","character":"Maester Aemon"},{"actor":"Ian McElhinney","character":"Ser Barristan Selmy"},{"actor":"Julian Glover","character":"Grand Maester Pycelle"},{"actor":"Owen Teale","character":"Ser Alliser Thorne"},{"actor":"Yuri Kolokolnikov","character":"Styr, the Magnar of Thenn"},{"actor":"Dominic Carter","character":"Lord Janos Slynt"},{"actor":"Jacob Anderson","character":"Grey Worm"},{"actor":"Nathalie Emmanuel","character":"Missandei"},{"actor":"Mark Stanley","character":"Grenn"},{"actor":"Ben Crompton","character":"Eddison Tollett"},{"actor":"Daniel Portman","character":"Podrick Payne"},{"actor":"Tony Way","character":"Dontos Hollard"},{"actor":"Will Tudor","character":"Olyvar"},{"actor":"Dean-Charles Chapman","character":"Prince Tommen Baratheon"},{"actor":"Josef Altin","character":"Pypar"},{"actor":"Ian Beattie","character":"Ser Meryn Trant"},{"actor":"Joel Fry","character":"Hizdahr zo Loraq"},{"actor":"Finbar Lynch","character":"Farmer"},{"actor":"Kerry Ingram","character":"Princess Shireen Baratheon"},{"actor":"Brenock O'Connor","character":"Olly"},{"actor":"Jem Wall","character":"Guymon"},{"actor":"Raewyn Lippert","character":"Olly's mother"},{"actor":"Lois Winstone","character":"a Mole's Town whore"},{"actor":"Lu Corfield","character":"a Mole's Town madam"},{"actor":"Joseph Gatt","character":"a Thenn warg"},{"actor":"Brian Fortune","character":"Othell Yarwyck"},{"actor":"Paul Bentley","character":"the High Septon"},{"actor":"Patrick Molloy","character":"a Night's Watch man"},{"actor":"Emilio Doorgasingh","character":"a slave master"},{"actor":"Trixiebelle Harrowell","character":"Sally"},{"actor":"Josephine Gillan","character":"Marei"},{"actor":"Xena Avramidis","character":"a whore"},{"actor":"Derek Horsham","character":"a slave master"},{"actor":"Joshua Sher","character":"a slave"},{"actor":"Conor Watters","character":"a Hizdahr zo Loraq's manservant"},{"actor":"Daniel Naprous","character":"Oznak zo Pahl (credited"},{"actor":"James Bleakney","character":"Mole's Town Brothel Patron"},{"actor":"Michael Stuart","character":"Night's Watch Officer"},{"actor":"Laurence Doherty","character":"slave master"}]}
