{"title":"First of His Name","season":"4","episode":"5","date":"Sun May 04 2014","authors":["David Benioff and D.B. Weiss"],"directors":["Michelle MacLaren"],"info":"\"First of His Name\" is the fifth episode of the fourth season of Game of Thrones.[1] It is the thirty-fifth episode of the series overall. It premiered on May 4, 2014. It was written by producers David Benioff and D.B. Weiss and directed by Michelle MacLaren.","plot":"Cersei and Tywin plot the Crown’s next move. Dany discusses future plans. Jon embarks on a new mission.","summary":[{"location":"Across the Narrow Sea","content":"In her new headquarters atop the Great Pyramid, Daenerys learns that Joffrey is dead and Tommen has been crwoned. She is irritated to learn that Daario Naharis has captured Meereen's navy without her explicit orders to do so, but mulls over the possibility of setting sail for Westeros and taking King's Landing with her 8,000 Unsullied and 2,000 Second Sons. Barristan Selmy is optimistic about their chances, believing that old Westerosi families will flock to their cause once Daenerys crosses the Narrow Sea, swelling their numbers. Jorah Mormont is less enthusiastic: while 10,000 troops should be enough to take King's Landing from its exhausted defenders, there's still the rest of the continent to worry about. Her advisors then reveal more troubling news: the Wise Masters have bounced back and re-enslaved every freed man in Yunkai, and although Astapor remains free, the council Daenerys installed has been deposed by a butcher named Cleon. Daenerys dismisses everyone but Jorah and muses that her plans are in shambles. He reminds her that she is the last Targaryen and the Mother of Dragons, but Dany says she needs to be more than that. She laments that if she cannot keep order in three cities, she has no hope of controlling seven kingdoms. She is therefore resolved to remain in Meereen and \"do what queens do\": rule.\n\nA"},{"location":"At King's Landing","content":"Tommen is crowned king of the Seven Kingdoms, while Cersei makes what appears to be a peaceful gesture towards Margaery, who remains wary. Cersei talks to Prince Oberyn and asks him a favor. She hasn't seen her daughter, Myrcella, in over a year. Cersei asks Oberyn to take her a gift, a ship, since she missed her last nameday. \n​Tywin reveals to Cersei their problem with the Iron Bank of Braavos; they owe 'a tremendous sum,' and the gold mines of the Westerlands actually ran dry three years ago. Therefore, even though Tywin admits the Lannisters can trust nobody except themselves, they need the Tyrells' wealth and resources on their side. Cersei suggests coming to some arrangement with one of their representatives, but Tywin dismisses the idea, since the Bank is a monolithic structure that cannot be avoided, lied to or swayed.\n\nI"},{"location":"In the Riverlands","content":"While on the road, Podrick proves to be a hindrance to Brienne. He has problems with his horse and accidentally sets fire to a rabbit they were cooking. Brienne tries to get rid of Podrick by releasing him from the vow he swore as her squire, but to no avail. They are bound for Castle Black, where Brienne believes Sansa may have taken refuge with her half-brother, Jon Snow. Brienne questions Podrick about his duties as squire to Tyrion. He tells her his job was mostly pouring wine, alongside other menial tasks. Brienne then asks if Podrick did anything related to combat. Podrick reveals how he killed Ser Mandon Moore of the Kingsguard by shoving a spear through his head when he tried to kill Tyrion during the Battle of the Blackwater. Brienne then grants Podrick a bit of respect and allows him to help her remove her armor.\n\nI"},{"location":"In the Vale of Arryn","content":"Lord Petyr Baelish and Sansa Stark arrive safely at the Bloody Gate, though Petyr has Sansa cover her hair, as auburn is widely known as a Tully trait, and introduces her as his niece, Alayne. Upon arriving at the Eyrie itself, Sansa tries to slip into her alias, but Lysa Arryn tells her not to bother around her own flesh and blood. Lysa laments Sansa's treatment in King's Landing, ignoring her attempts to defend Tyrion's character. Robin Arryn is delighted to see Petyr and to show Sansa the Moon Door. Lysa, apparently having finally given Robin some independence, reminds him never to reveal Sansa's identity and tells him to show her to her chambers. The instant they leave, Lysa, for unclear reasons, insists on marrying Petyr immediately, claiming that they already had a wedding night many years ago. She references poisoning her former husband's wine and framing the Lannisters by writing to her sister Catelyn, using these actions as proof of her love for Petyr. Petyr is unable to deter her, particularly when Lysa reveals that a Septon and witnesses have been waiting outside the main door. A delighted Lysa declares that she will scream so loudly that night that they will be able to hear her across the Narrow Sea. Later that night, an exasperated Sansa attempts to sleep as Lysa tries to fulfil that promise.\nLater on, Lysa has a meal with Sansa, giving her some lemon cakes. Sansa, relieved to be safe at last, indulges herself, though she becomes a little self-conscious when Lysa begins telling stories of Catelyn's overeating in her youth. Lysa encourages Sansa to keep eating, as she was only telling a story, and anyway, Petyr had three crates of lemons brought from the Crownlands just for Sansa's cakes. Lysa suddenly degenerates from a kindly aunt into a psychotic newlywed half-mad with jealousy and demands to know why Petyr cares so much about Sansa, and if he has slept with her as he has his whores. She also rants about Catelyn's love for Sansa's uncle Brandon and how he nearly killed Petyr. Horrified, Sansa weeps and insists that she is still a virgin and that Petyr thinks she's just a stupid girl who doesn't know anything, and who cannot lie at all so always tells the truth. Lysa immediately calms down and comforts Sansa, assuring her that she believes her, and that since neither Tyrion nor Petyr had slept with her, Sansa can proceed to marry Robin. Sansa seems unsure of what to make of this information, but one thing is clear: King's Landing has made her a consummate actress.\nOn the road to the Eyrie, Sandor Clegane and Arya Stark continue to spar verbally and physically, particularly when Clegane disparages Arya's water dancing and insults Syrio Forel for being overcome by a glorified thug like Meryn Trant.\n\nB"},{"location":"Beyond the Wall","content":"At Craster's Keep, Locke scouts the keep for the party of the Night's Watch sent to eliminate the traitors holed up there; in his reconnaissance, Locke finds the hut where Bran Stark, Jojen, Meera and Hodor are being held captive. Reporting back to Jon Snow and the others, Locke tells them that only 11 traitors are present and most of them are drunk and won't prove much of a threat. He also lies about the hut where the prisoners are being kept, claiming there are hounds kept inside and that they should keep away from it to prevent the dogs alerting their enemy. Jon agrees and tells the party they attack at nightfall.\nThat night, Karl enters the prisoners' hut and attempts to rape Meera, but Jojen distracts Karl when he reveals his possession of greensight and claims to have seen Karl dead before the night is out. At that moment, Rast rushes in to warn Karl the keep is under attack; Jon's party rushes through the defenses and starts killing their traitorous former brethren. In the confusion, Locke slips into the tent and attempts to abduct Bran, but Bran wargs into Hodor and uses him to kill Locke. Bran spots Jon in the fighting, but Jojen prevents him from going to his older brother, reminding Bran that they must continue onward to reach the three-eyed raven and that Jon would stop them. Bran reluctantly leaves despite being so close to Jon.​\nThe Night's Watch swiftly overcome their enemy and Jon confronts Karl in single combat. Karl's use of dirty tactics learned in his criminal past give him the upper hand. Before he can finish Jon, one of Craster's wives, Sissy, stabs him from behind. When Karl rounds on her, Jon gets back to his feet and drives Longclaw through the back of Karl's skull, killing him.\nIn the aftermath of the battle, four brothers of the Night's Watch, including Locke, are found to have died, while all the traitors but one are accounted for. The sole survivor, Rast, runs in terror through the forest until he reaches the cage where Ghost was held. He notices someone has opened the cage but before he can do more than absorb this fact, the direwolf lunges out of nowhere and kills him. Ghost then finds his way back to Jon, who is overjoyed to see his companion again. Speaking to Craster's wives, Jon warns them that Mance Rayder's army and worse besides will soon reach their location and offers to take them to safety south of the Wall, but the women refuse, preferring to set out on their own. Before departing back for Castle Black, Jon has Craster's Keep burned to the ground, along with the bodies of all those who died there."}],"firsts":["Ser Donnel Waynwood"],"deaths":["All eleven Mutineers, including;","Karl, impaled through the head by Jon Snow","Rast, killed by Ghost","Five Black Brothers, including;","Locke, neck snapped by Hodor/Bran"],"cast":[{"actor":"Nikolaj Coster-Waldau","character":"Ser Jaime Lannister"},{"actor":"Lena Headey","character":"Queen Cersei Lannister"},{"actor":"Emilia Clarke","character":"Queen Daenerys Targaryen"},{"actor":"Kit Harington","character":"Jon Snow"},{"actor":"Aidan Gillen","character":"Lord Petyr Baelish"},{"actor":"Charles Dance","character":"Lord Tywin Lannister"},{"actor":"Natalie Dormer","character":"Lady Margaery Tyrell"},{"actor":"Isaac Hempstead-Wright","character":"Prince Bran Stark"},{"actor":"Sophie Turner","character":"Princess Sansa Stark"},{"actor":"Maisie Williams","character":"Princess Arya Stark"},{"actor":"Rory McCann","character":"Sandor Clegane"},{"actor":"Gwendoline Christie","character":"Brienne of Tarth"},{"actor":"Conleth Hill","character":"Varys"},{"actor":"with Iain Glen","character":"Ser Jorah Mormont"},{"actor":"Pedro Pascal","character":"Prince Oberyn Martell"},{"actor":"Michiel Huisman","character":"Daario Naharis"},{"actor":"Burn Gorman","character":"Karl Tanner"},{"actor":"Kate Dickie","character":"Lady Lysa Arryn"},{"actor":"Ian McElhinney","character":"Ser Barristan Selmy"},{"actor":"Julian Glover","character":"Grand Maester Pycelle"},{"actor":"Noah Taylor","character":"Locke"},{"actor":"Roger Ashton-Griffiths","character":"Lord Mace Tyrell"},{"actor":"Thomas Brodie-Sangster","character":"Jojen Reed"},{"actor":"Ellie Kendrick","character":"Meera Reed"},{"actor":"Nathalie Emmanuel","character":"Missandei"},{"actor":"Jacob Anderson","character":"Grey Worm"},{"actor":"Dean-Charles Chapman","character":"King Tommen Baratheon"},{"actor":"Daniel Portman","character":"Podrick Payne"},{"actor":"Finn Jones","character":"Ser Loras Tyrell"},{"actor":"Kristian Nairn","character":"Hodor"},{"actor":"Mark Stanley","character":"Grenn"},{"actor":"Ben Crompton","character":"Eddison Tollett"},{"actor":"Luke Barnes","character":"Rast"},{"actor":"Deirdre Monaghan","character":"Morag"},{"actor":"Lino Facioli","character":"Lord Robin Arryn"},{"actor":"Paul Bentley","character":"the High Septon"},{"actor":"Jane McGrath","character":"Sissy"},{"actor":"Alisdair Simpson","character":"Ser Donnel Waynwood"},{"actor":"Niamh Lennon","character":"a King's Landing Handmaiden"},{"actor":"Gerald McMullan","character":"a Night's Watch Man"},{"actor":"Kristy Robinson","character":"Craster's Wife"}]}
