{"title":"Oathkeeper","season":"4","episode":"4","date":"Sun Apr 27 2014","authors":["Bryan Cogman"],"directors":["Michelle MacLaren"],"info":"\"Oathkeeper\" is the fourth episode of the fourth season of Game of Thrones. It is the thirty-fourth episode of the series overall. It premiered on April 27, 2014. It was written by producer Bryan Cogman and directed by Michelle MacLaren.","plot":"Dany balances justice and mercy. Jaime tasks Brienne with his honor. Jon secures volunteers while Bran, Jojen, Meera and Hodor stumble on shelter.","summary":[{"location":"Across the Narrow Sea","content":"Daenerys has 163 of the Great Masters crucified.  \nMissandei teaches Grey Worm how to speak the Common Tongue, where he reveals that all he remembers since his castration is that he was born in the Summer Isles. Missandei also reveals that she can remember that she saw Naath burning, as she was tacken as a slave for Slaver's Bay. Dany commands him and several Unsullied to infiltrate Meereen disguised as slaves and convince the slaves to rise against their masters. They visit a slave pen, where a number of slaves are discussing whether or not to rise against the Great Masters. One of the young slaves is already trying to convince his fellow men in chains to fight, but the older slaves argue they have no means to oppose their Masters, who have squashed every previous slave rebellion. Grey Worm arrives and tells them that only they can free themselves, then presents them with weapons. The uprising is a resounding success. With the city hers, Dany orders the crucifixion of 163 of the so-called \"Great Masters\" in retaliation for the 163 slave children crucified on the road to Meereen. Ser Barristan advises her against it, saying that sometimes it is best to answer injustice with mercy. Daenerys shows her Targaryen blood by firmly declaring that she will \"answer injustice with justice.\" The cries of the crucified Great Masters reach Dany's ears atop Meereen's tallest pyramid, where the city's emblem, the golden harpy of Ghis, has been draped in the banner of House Targaryen. Now, she has conquered all three of the cities on Slaver's Bay.\n\nA"},{"location":"At the Wall","content":"Jon Snow and Grenn are teaching several recruits, including Locke and Olly, how to fight against wildlings. Alliser Thorne admonishes Jon and reminds him that he is a steward, not a ranger, trying to provoke Jon in an excuse to have him killed. Jon leaves the yard and talks with Locke, who pretends he is from the Stormlands and genuinely wants to protect the realm. Janos Slynt points out to Thorne that Jon is well liked and Thorne is not, and when Maester Aemon insists upon an election for a new Lord Commander, Jon is far more likely to succeed Mormont. Slynt convinces Thorne to allow Jon to deal with the mutineers, in the hope that they will remove him from the problem. Meanwhile, Samwell Tarly is fretting about Gilly's safety in Mole's Town with the wildlings loose, and it is revealed that Sam told Jon about Bran still being alive and north of the wall. Locke brings Jon to Thorne, who sanctions his mission but tells Jon that he must secure volunteers rather than have men ordered along with him. Jon gives an impassioned speech, insisting that not only must the mutineers be dealt with for Castle Black's safety, but Lord Commander Mormont deserves justice. Much to Thorne and Slynt's surprise, Grenn, Eddison Tollett and a group of other men join Jon on his mission, including Locke who asks to say his vows if that is required before he goes north of the Wall.\n\nA"},{"location":"At King's Landing","content":"During their sword training, Bronn implores Jaime to visit his brother Tyrion in the dungeon, saying that Tyrion named Jaime his champion in The Eyrie because he knew Jaime would ride day and night to fight for him. Jaime finally visits Tyrion, confessing that Cersei asked him to murder him. Convincing Jaime that he didn't kill Joffrey, Tyrion notes that not even an irrefutable confession by the real perpetrator would satisfy Cersei. She is out for Tyrion's blood, and he says that the trial is even worse because at least one judge has always wanted him dead. Jaime tells Tyrion that Cersei offers a knighthood to whomever captures Sansa Stark. Tyrion insists that Sansa had nothing to do with the murder, despite having the best motive. Later, Jaime visits Cersei, who is disgusted that, in her view, Jaime is taking Tyrion's side because of his long-held affection for their brother.\nMeanwhile, Lady Olenna tells Margaery that she is about to leave for Highgarden. She mentions the new and prospective marriage between Margaery and the new king, Tommen. She insists that Cersei will turn Tommen against Margaery by the time they marry if Margaery doesn't act fast. Fortunately, Cersei is well distracted by accusing her innocent brother of the murder of her son. Margaery insists that Olenna cannot be certain of Tyrion's innocence, but Olenna states that Tyrion certainly is innocent and confesses that she would never have let Margaery marry \"that beast.\" Margaery is shocked but her grandmother firmly ends the conversation. That night, Margaery enters Tommen's chambers, slipping past the Kingsguard and charming Tommen. She puts in his mind the idea that one day she will be his and they might as well learn to like each other, and compliments him on his cat and kind demeanour. She promises to visit again and Tommen falls asleep smiling.\nIn the chambers of the Kingsguard, Jaime tasks Brienne with finding Sansa.  He urges her to find and keep the girl safe from those who would hand her over to Cersei and provides her with a horse, supplies, and a freshly forged suit of armor. Jaime then gifts her with the sword his father gave him, saying that the Valyrian steel is forged from Ned Stark's sword and that the steel from Ned Stark's sword should be used to defend Ned Stark's daughters. He also insists she take Podrick Payne with her as a squire, both as a reward for the boy's service to Tyrion and to keep him safe from those who would seek to use him against his former master. Before departing, Brienne names the sword \"Oathkeeper\" and vows to find Sansa, for the sake of Jaime and Lady Catelyn.\n\nE"},{"location":"En route to the Vale","content":"Sansa accuses Petyr Baelish of having Joffrey Baratheon murdered. At first Baelish evades the accusation, pointing out that he has been away for weeks and that Tyrion could be the perpetrator. Sansa defends Tyrion, with an innate certainty that he is innocent, and mentions that Baelish is far too smart to trust a drunk with the scheme. Impressed with her instincts, Baelish admits that Tyrion is in fact innocent, and reveals Sansa's own part in Joffrey's death - Ser Dontos' necklace was in fact the murder weapon, and someone slipped a stone (which was poisonous) into Joffrey's wine. Sansa is bewildered, because the Lannisters have done so much for Baelish, including granting him the seat of Harrenhal. Baelish confesses that while his friendship with the Lannisters was fruitful, it is best to keep enemies confused and his absence from the wedding means that he will never be suspected. Sansa declares that she doesn't entirely believe him: he's too clever to poison a king just to cause confusion. Baelish is again impressed, and confirms that Joffrey was simply too volatile; a king like him as an ally was more a hindrance than a benefit. More importantly, though, Joffrey's death was something that his \"new friends\" wanted very much, and a gift is always helpful to help a new friendship \"grow strong.\"\n\nB"},{"location":"Beyond the Wall","content":"At Craster's Keep, the mutinous deserters are still entrenched there, indulging themselves on the food stored there and raping Craster's wives. Karl drinks wine from the skull of Jeor Mormont, drunkenly bragging about himself and his skill as a hired killer back in King's Landing before ordering Rast to \"feed the beast.\" At the same time, one of Craster's wives enters with Craster's last son, insisting the infant must be given as a 'gift to the gods.. At Karl's orders, Rast leaves the infant on a patch of open ground, then deals with the beast - Ghost, who the mutineers have caged, and whom Rast taunts by withholding food and water from the direwolf. Suddenly, a snowstorm whips up and the temperature drops, causing the water Rast was taunting Ghost with to freeze. Recognizing the approach of White Walkers, Rast flees.\nNearby, Bran Stark and his companions hear the child's cries; warging into Summer, Bran goes to investigate, but Summer falls into a trap just outside Craster's Keep. Meera Reed, sensing danger, urges them to move on, but Bran insists on trying to free Ghost and Summer; before they can, however, they are taken prisoner by the mutineers. Some of the deserters amuse themselves by tormenting Hodor, while the others are taken to Karl, who threatens to kill Meera and Jojen. Jojen is suddenly overcome by a seizure and falls to the floor while Meera begs to be let go so she can help him. Karl does so when Bran reveals his true identity.\n\nI"},{"location":"In the Lands of Always Winter","content":"Somewhere in the northernmost reaches of the world, a lone White Walker rides its undead horse towards a shattered mountain, cradling Craster's last son in its arm. When it reaches the mountain, the White Walker places the baby upon an altar of ice at the center of a ring of large icicles. On the other side, a line of dark-garbed White Walkers watch the proceedings. After a moment, one of them strides forth and carefully picks up the wailing child, who swiftly calms. The White Walker presses the nail of its index finger into the baby's cheek. The sound of cracking ice can be heard as the child's eyes turn a depthless, icy blue."}],"firsts":["Ser Pounce","Morag","Craster's last son","White Walker","Night King","Mossador"],"deaths":["Great Master 1, stabbed to death by rebel slaves"],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Nikolaj Coster-Waldau","character":"Ser Jaime Lannister"},{"actor":"Lena Headey","character":"Queen Cersei Lannister"},{"actor":"Emilia Clarke","character":"Queen Daenerys Targaryen"},{"actor":"Kit Harington","character":"Jon Snow"},{"actor":"Aidan Gillen","character":"Lord Petyr Baelish"},{"actor":"Natalie Dormer","character":"Lady Margaery Tyrell"},{"actor":"John Bradley","character":"Samwell Tarly"},{"actor":"Isaac Hempstead-Wright","character":"Prince Bran Stark"},{"actor":"Sophie Turner","character":"Princess Sansa Stark"},{"actor":"Gwendoline Christie","character":"Brienne of Tarth"},{"actor":"Jerome Flynn","character":"Ser Bronn"},{"actor":"with Iain Glen","character":"Ser Jorah Mormont"},{"actor":"Diana Rigg","character":"Lady Olenna Tyrell"},{"actor":"Michiel Huisman","character":"Daario Naharis"},{"actor":"Ian McElhinney","character":"Ser Barristan Selmy"},{"actor":"Owen Teale","character":"Ser Alliser Thorne"},{"actor":"Burn Gorman","character":"Karl Tanner"},{"actor":"Noah Taylor","character":"Locke"},{"actor":"Dominic Carter","character":"Lord Janos Slynt"},{"actor":"Nathalie Emmanuel","character":"Missandei"},{"actor":"Jacob Anderson","character":"Grey Worm"},{"actor":"Thomas Brodie-Sangster","character":"Jojen Reed"},{"actor":"Ellie Kendrick","character":"Meera Reed"},{"actor":"Kristian Nairn","character":"Hodor"},{"actor":"Mark Stanley","character":"Grenn"},{"actor":"Ben Crompton","character":"Eddison Tollett"},{"actor":"Luke Barnes","character":"Rast"},{"actor":"Dean-Charles Chapman","character":"Prince Tommen Baratheon"},{"actor":"Daniel Portman","character":"Podrick Payne"},{"actor":"Josef Altin","character":"Pypar"},{"actor":"Brenock O'Connor","character":"Olly"},{"actor":"Emilio Doorgasingh","character":"a slave master"},{"actor":"Reece Noi","character":"a slave"},{"actor":"Philip Philmar","character":"a elder slave"},{"actor":"Ross Mullan","character":"a White Walker"},{"actor":"Richard Brake","character":"The Night King"},{"actor":"Deirdre Monaghan","character":"Morag"},{"actor":"Robert Goodman","character":"Valyrian slave"},{"actor":"Karl Jackson","character":"an Unsullied"},{"actor":"Jane McGrath","character":"Sissy"},{"actor":"Aeryn Walker","character":"Craster's wife"},{"actor":"Cheryl Lester","character":"Craster's wife"},{"actor":"Will Fortune","character":"Othell Yarwyck"},{"actor":"Graeme Peacock","character":"Littlefinger's Crew"},{"actor":"Kristy Robinson","character":"Craster's Wife"},{"actor":"Michael Stuart","character":"Night's Watch Officer"}]}
