{"title":"Mockingbird","season":"4","episode":"7","date":"Sun May 18 2014","authors":["David Benioff and D.B. Weiss"],"directors":["Alik Sakharov"],"info":"\"Mockingbird\" is the seventh episode of the fourth season of Game of Thrones[1]. It is the thirty-seventh episode of the series overall. It premiered on May 18, 2014. It was written by producers David Benioff and D.B. Weiss and directed by Alik Sakharov.","plot":"Tyrion enlists an unlikely ally. Daario entreats Dany to allow him to do what he does best. Jon’s warnings about the Wall’s vulnerability fall on deaf ears. Brienne follows a new lead on the road with Pod.","summary":[{"location":"At King's Landing","content":"Tyrion and Bronn  \nIn his cell, Tyrion and Jaime discuss Tyrion's fate and the irony of Lord Tywin striking down both his heirs if Jaime were to die being Tyrion's champion; Jaime declines to be Tyrion's champion as he cannot fight well enough with his left hand. Tyrion then requests Jaime to bring him Bronn, hoping the sellsword will stand for him just as he did at the Eyrie.\nBronn visits Tyrion in the clothes of a lord, having been betrothed to Lollys Stokeworth, by Cersei's doing. He refuses to fight the Mountain (whom Cersei has chosen for her champion), both for lack of a reward and believing Clegane is too dangerous for him to face, and bids farewell to Tyrion, who while heartbroken by Bronn's decision, understands.\n\n    Oberyn visits Tyrion in his cell.  \nLater, Tyrion is approached by Oberyn Martell, who tells Tyrion of his disappointment in their first encounter: as children, Oberyn and his sister Elia were told stories of the \"Lannister Monster\" and his extreme deformities. During a childhood visit to Casterly Rock, Cersei showed Tyrion, with great ceremony, to Oberyn and Elia. Oberyn tells Tyrion that he saw no monster, just a baby. Cersei told Oberyn and his sister that Tyrion killed her mother, and then cruelly assaulted Tyrion until Jaime stopped her. Oberyn says that he and Elia were quite disturbed at Cersei's already strong hatred toward Tyrion, who is disturbed by Cersei's relentless hatred as his eyes tear up. Oberyn tells Tyrion that he seeks justice for the death of his sister, and Tyrion replies, \"You are in the wrong place.\" Oberyn counters that he is in the perfect place; all those he means to bring to justice for his sister's murder are close at hand. Intending to start his revenge with Gregor Clegane, Oberyn offers his service as Tyrion's champion in the coming trial by combat.\n\n     \nGregor Clegane, known by most as 'the Mountain,' is mercilessly killing prisoners with a greatsword. Cersei approaches him and thanks him for his haste in returning to King's Landing as her champion for the trial by combat. Gregor asks who he will be fighting, Cersei asks if it matters, and he shakes his head.\n\nA"},{"location":"Across the Narrow Sea","content":"Daario visits Daenerys in her private chambers.  Daenerys is surprised by Daario in her private chambers. She feigns outrage at the intrusion, but agrees to hear his complaints. Daario laments that he is only good at two things, killing men and sleeping with women, and that he has no opportunities to pursue either strength. Dany counters that the Second Sons are currently acting as Meereen's police force and that there are many women in the city who would throw themselves at him; Daario dismisses the Second Sons' role as unchallenging and says the only woman he wants isn't interested. He begs Daenerys to send him and the Second Sons to make real war. Dany focuses on Daario's other proclaimed talent and orders him to remove his clothes.\nThe following morning, Daario bumps into Ser Jorah. He also says that it's a good time to talk to the queen, as she is in a very good mood, implying that he and Daenerys had just been intimate. Jorah is not amused, but Daenerys dismisses concerns about her intimate life. Daenerys tells Jorah that she sent Daario to take the Second Sons to Yunkai to regain control over the city and kill the masters that have resurfaced. Jorah relates to the mercy shown by Eddard Stark for his dealings in slavery and convinces Daenerys to bring the masters to justice without execution. Daenerys considers for a moment and then tells Jorah to assign Hizdahr zo Loraq as her ambassador to offer the masters a choice: they can live free in the new world she wants to create, or they can die clinging to their old one. The Second Sons will be stationed in Yunkai to enforce whichever choice the masters make. She also says to let Daario know that it was Jorah who changed her mind.\n\nA"},{"location":"At Dragonstone","content":"Selyse speaks with Melisandre.  Queen Selyse speaks to Melisandre, who is enjoying a bath. She quips that the Lord of Light told her to enjoy it as it was the last time she would have a good bath, but the joke goes over Selyse's head. To cement Selyse's position as Melisandre's most devoted follower, the Red Priestess tells her about using potions and illusions in serving the Lord of Light and that a bit of pageantry and deception in helping converts see the truth will be forgiven later on. Selyse asks her if she used the potions when she slept with Stannis, to which she replies that she did not. Selyse then remarks on her desire to leave their daughter Shireen behind when they go to the North but Melisandre is as dismissive about Shireen's \"heresy\" as she always is, and assures Selyse that Shireen will be needed where they are going.\nA"},{"location":"At the Wall","content":"Jon and his fellow brothers return from Craster's Keep. At first sight of his direwolf, Ghost, Alliser Thorne sends his \"beast\" away, outside Castle Black.\nAfterwards, Jon tries to convince the Night's Watch to barricade the Wall against the imminent wildling invasion by blocking off Castle Black's entry tunnel with ice and rock. He is denied after being reminded of his place in the Watch, when the First Builder reluctantly agrees with Thorne's assessment of their chances of defending the tunnel. Jon and Sam are sent to serve as sentries on top of the Wall until Mance arrives.\n\nI"},{"location":"In the Riverlands","content":"Arya and Sandor encounter a ​dying man in a ransacked village. Sandor gives the man a gift of mercy by stabbing him in the heart. Sandor is ambushed by Biter, and is bitten on the neck. He snaps Biter's neck and drops him dead in the dirt. Rorge encounters them and after a short interrogation is killed by Arya with a quick thrust by Needle to his heart. Afterward, Sandor clumsily addresses his wounds from Biter. Arya suggests burning to cauterize the wound, but is rebuffed by Sandor's fear of fire. Sandor confirms the story of his facial scars from burns inflicted by Gregor's wrath and how his father covered up the truth, making him feel alone. Arya offers to clean and stitch him up, and Sandor allows her to.\n\n     \nMeanwhile, Brienne and Podrick stop at an inn where they are served kidney pie made by none other than Hot Pie, who proceeds to tell them at length the process in finding the right ingredients. He then asks of Brienne's business, to which she replies that she is in Lady Stark's service to find and protect Sansa Stark. Hot Pie leaves after addressing the Starks as traitors. As Brienne and Podrick prepare to leave the inn, Podrick reminds Brienne that telling people of their quest could be dangerous, but Brienne's honesty is swiftly rewarded when Hot Pie approaches and gives them a loaf of bread shaped like a wolf. He tells them that he knows nothing of Sansa, but has seen her sister Arya alive, along with the Hound. Brienne is surprised because Arya has been presumed dead since she disappeared when her father Ned was executed. They deduce that Arya's captors are probably going to try to ransom Arya somewhere. Having memorized the complex family trees of the Great Houses, Podrick surmises that Arya's aunt Lysa Arryn is the Hound's only remaining chance of a reward for her. Therefore, Brienne and Podrick decide to head for the Eyrie.\n\nA"},{"location":"At the Eyrie","content":"While wandering the Eyrie's snow-covered courtyards, Sansa builds a snow replica of Winterfell. Robin chances upon her and seems impressed with her efforts. The cousins get along until Robin asks where the Moon Door is. Sansa tells him Winterfell doesn't need a Moon Door. Sansa agrees to add one, but in the process, Robin accidentally knocks over a tower. Robin insists she replicate the tower. This irritates Sansa and Robin throws a tantrum in response. Unable to control her anger, Sansa slaps Robin. Sansa immediately softens and tries to apologize, but before she can Robin threatens to tell his mother and runs away. Petyr Baelish witnesses the action and assures Sansa that he will deal with Lysa, whom he says should discipline her child more often, anyway. Petyr muses on how he should have been Sansa's father, but then tells Sansa that she is more beautiful than her mother Catelyn and kisses Sansa; who is so shocked that she doesn't resist. Unknown to the pair, the kiss is seen by Lysa.\n\n    Lysa is pushed out the Moon Door.  \nLater, Sansa is summoned by Lysa, who proceeds to explain the gory details about Moon Door executions. Lysa then grabs Sansa and threatens to throw her out for kissing Petyr. She is stopped when Petyr arrives and swears by everything he can think of that he will send Sansa away. Lysa releases Sansa and embraces Petyr, who assures Lysa that he only ever loved one woman - her sister. Lysa has only an instant to contemplate this betrayal, as Petyr shoves her out of the Moon Door and looks down as she plummets to her death hundreds of feet below."}],"firsts":["Dying man"],"deaths":["​Dying man, mercy-killed by Sandor Clegane","Biter, neck snapped by Sandor Clegane","Rorge, stabbed by Arya Stark","Lady Lysa Arryn, pushed out the Moon Door by Petyr Baelish"],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Nikolaj Coster-Waldau","character":"Ser Jaime Lannister"},{"actor":"Lena Headey","character":"Queen Cersei Lannister"},{"actor":"Emilia Clarke","character":"Queen Daenerys Targaryen"},{"actor":"Kit Harington","character":"Jon Snow"},{"actor":"Aidan Gillen","character":"Lord Petyr Baelish"},{"actor":"Carice van Houten","character":"Lady Melisandre"},{"actor":"John Bradley","character":"Samwell Tarly"},{"actor":"Sophie Turner","character":"Princess Sansa Stark"},{"actor":"Maisie Williams","character":"Princess Arya Stark"},{"actor":"Rory McCann","character":"Sandor Clegane"},{"actor":"Gwendoline Christie","character":"Brienne of Tarth"},{"actor":"Jerome Flynn","character":"Ser Bronn"},{"actor":"with Iain Glen","character":"Ser Jorah Mormont"},{"actor":"Pedro Pascal","character":"Prince Oberyn Martell"},{"actor":"Michiel Huisman","character":"Daario Naharis"},{"actor":"Owen Teale","character":"Ser Alliser Thorne"},{"actor":"Tara Fitzgerald","character":"Queen Selyse Baratheon"},{"actor":"Kate Dickie","character":"Lady Lysa Arryn"},{"actor":"Dominic Carter","character":"Lord Janos Slynt"},{"actor":"Barry McGovern","character":"a dying man"},{"actor":"Mark Stanley","character":"Grenn"},{"actor":"Ben Crompton","character":"Eddison Tollett"},{"actor":"Josef Altin","character":"Pypar"},{"actor":"Daniel Portman","character":"Podrick Payne"},{"actor":"Lino Facioli","character":"Lord Robin Arryn"},{"actor":"Brenock O'Connor","character":"Olly"},{"actor":"Andy Beckwith","character":"Rorge"},{"actor":"Ben Hawkey","character":"Hot Pie"},{"actor":"Hafþór Júlíus Björnsson","character":"Ser Gregor Clegane"},{"actor":"Brian Fortune","character":"Othell Yarwyck"},{"actor":"Gerard Jordan","character":"Biter"},{"actor":"Marko Jelic","character":"Prisoner"},{"actor":"Michael Stuart","character":"a Night's Watch Officer"}]}
