{"title":"The Watchers on the Wall","season":"4","episode":"9","date":"Sun Jun 08 2014","authors":["David Benioff and D.B. Weiss"],"directors":["Neil Marshall"],"info":"\"The Watchers on the Wall\" is the ninth episode of the fourth season of Game of Thrones[1]. It is the thirty-ninth episode of the series overall. It premiered on June 8, 2014. It was written by producers David Benioff and D.B. Weiss and directed by Neil Marshall.","plot":"The Night's Watch, although hopelessly outnumbered, attempts to defend Castle Black from Mance Rayder's massive wildling army, who plan to siege the fortress from the north. Meanwhile, a secret garrison of wildlings including Tormund, Styr, and Ygritte are poised to launch a surprise attack from the south of the Wall.","summary":[{"location":"At the Wall","content":"​​Jon and Sam are standing watch atop the Wall, staring out into the darkness of the north and awaiting the imminent wildling invasion. Sam attempts to interrogate Jon about what it was like to be with a woman, stating that as their deaths are likely imminent, it may be his last chance to find out. Sam brings up that the vows of the Night's Watch only explicitly forbid members from taking wives or producing children, and that other \"activities\" are open to interpretation. Jon replies glumly that Alliser Thorne most likely does not care about their interpretations. When further pressed by Sam to describe lying down with Ygritte, Jon attempts to explain but is unable to properly express it, proclaiming exasperatedly that he's \"not a bleeding poet.\"\nJon offers to take the watch up alone so Sam can go below, and as Sam steps into the elevator and begins to descend the Wall, an owl lands on top of the wall and begins hooting loudly. The owl is revealed to be controlled by a Thenn warg who is a member of the garrison of wildlings under command of Tormund and Styr, who have set up camp just outside of the southern entrance to Castle Black. Tormund boasts about a bear he supposedly had sex with, prompting Ygritte to cut him short and cast her doubts on the validity of his claim. She tells him that she only cares about getting as many arrows through the hearts of \"crows\" as possible. She angrily talks about how the people south of the Wall shut the the wildlings out by building it and hunting the wildlings as enemies; she says that now the wildlings are the hunters and the southerners their prey. Styr mockingly replies that Ygritte has more words about killing than she has arrows. She defends herself by saying she killed just as many people at Mole's Town as he, but Styr replies that none of them was her former lover. He further mocks her by saying that when she sees him, she'll likely just serve him a slice of \"ginger minge,\" causing her to jump to her feet in anger. Ygritte stares Styr down, claiming that she wants to kill Jon Snow herself, then looks around the camp and warns the others that she has an arrow ready for anyone else who attempts to kill him. Just outside the camp, a shaded person cradling something passes by the wildlings unnoticed.\n\n    Maester Aemon finds Sam in the Castle Black library.  ​Meanwhile, Sam is caught reading a book about wildlings by Maester Aemon. Aemon correctly guesses that Sam is reading the book because he wants to know what kind of fate might have befallen Gilly if she fell into wildling hands during the sack of Mole's Town. He also surmises that Sam has shown such a keen interest in her fate because he is in love with her, despite Sam's protests to the contrary. Aemon muses about the girl he once loved, stating that he can still picture her as clear as day and that she is more real than Sam is. After being dismissed by Aemon, Sam leaves the maester's chambers only to hear Gilly at the gate begging to be allowed inside, revealing her survival of the Mole's Town massacre and her identity as the cloaked figure approaching Castle Black. Pypar attempts to deny her passage into the castle, saying he is not allowed to open the gate under any circumstances. However, Sam roars at Pyp to allow her in, causing Pyp to relent and let her in. Sam promises Gilly wherever she goes next he will go too, but their reunion is cut short by two blows from the horn, indicating that Mance's wildling army has finally begun their assault. Sam rushes to get Gilly safely inside the castle while other brothers of the Night's Watch prepare for the imminent attack by wildlings.\n    Jon looking off the top of the Wall.  \nOn top of the Wall, Jon hears the horn blowing and looks north, witnessing a tremendous conflagration to the North, just as Mance had promised. South of the Wall, the Thenn warg's owl also spots the fire and informs Styr and Tormund that the time has come to attack Castle Black. Jon approaches Ser Alliser Thorne, who finally relents and admits that they should have heeded Jon's advice and blocked the gates. He grimly muses that leadership often means being second-guessed by \"every clever little twat with a mouth\" and when a man in charge second-guesses himself, all is doomed. Steeling himself for the impending siege, Thorne begins barking orders to the archers, preparing them to fire upon the attackers massing below.\n\n    Sam and Gilly share a kiss.  Sam brings Gilly​ and her baby to a storage room where she can hide. Gilly wants Sam to stay with her as he promised, but he cannot as he swore to defend the Wall as a brother of the Night's Watch. Before he leaves her, Gilly begs Sam to promise her that he won't die and the two finally share a kiss. As Sam and Pypar are preparing arrows at the southern gate, Pypar laments that he has never seen a real battle before or ever even held an edged blade. Pypar asks how Sam is not afraid, but Sam replies that he is, as there are thousands of wildlings about to overrun them. Pypar asks how he managed to kill a White Walker while being afraid, and Sam says that at that moment, he just had to do something or Gilly would have been killed and her baby would have been taken. Sam further explains that at that moment, he wasn't himself; he was nothing, and when you are nothing there is nothing to be afraid of. However, he explains the reason he is afraid now is because \"I'm not nothing anymore.\"\n     \nMeanwhile, Ygritte spies on the Castle to scout numbers of defenders. She tells the other wildlings that most of the guards are at the top of the Wall and that few are left in the Castle. The group immediately take off towards Castle Black's southern gate, while Ygritte seems to have second thoughts. North of the Wall, the massive wildling army emerges from the woods, their numbers including giants riding atop mammoths. Alliser orders the archers on the Wall to nock their arrows, but they draw instead while Grenn accidentally drops a barrel down the Wall. Alliser angrily drills his men on properly following orders when another horn blows from down below at Castle Black, signalling the unanticipated appearance of Tormund's band of wildlings at the castle's southern entrance. Realizing the dire need for experienced men to defend the keep from the surprise attack, Alliser orders Janos Slynt to assume command of the Wall's defenses and heads below to join the melee.\nBelow, Tormund and Styr's forces charge the gate while Ygritte, acting as a sniper, manages to pick off several men defending the gate with her bow. Pypar is firing a crossbow as Sam assists by reloading another crossbow, but Pypar's aim is poor due to inexperience and nerves and he repeatedly misses his shots. The band of wildlings manage to reach Castle Black's walls and begin scaling them using grappling hooks and ropes, forcing Sam and Pyp to retreat.\nAlliser Thorne arrives with reinforcements from the top of the Wall via the wooden lift system, which is being operated by Olly. Alliser gives an impassioned speech, promising that the ancient order of the Night's Watch and Castle Black will survive this battle. His speech rallies the black brothers and Alliser personally leads the charge against the wildlings who have breached Castle Black's defenses, causing an intense battle to erupt in the courtyard.\n\n     ​​On the northern side of the Wall, a wildling strike force led by two giants (one of which is riding a mammoth) charge towards Castle Black's outer gate. On top of the Wall, Janos Slynt, having no true leadership experience, breaks down at the sight of the massive wildling army and begins fumbling his orders. Grenn steps in by falsely claiming that Alliser needs Janos back down below. Janos believes the lie and leaves, allowing Jon to take command of the Wall's defenses. The black brothers continue to rain down arrows on the advancing wildlings, even killing ones that are attempting to scale the Wall. One giant, armed with a massive bow, manages to fire a huge arrow at one of the bunkers atop the Wall, completely obliterating it and killing the black brother manning it -- the force of the giant's arrow carries the black brother off the wall on to the other side where he is shoved into ground with a tremendous amount of force.\n    Hobb takes up his butcher's knife to defend the dining hall.  \nDown in Castle Black, the battle rages on between the wildlings and the Night's Watch. Styr and Ygritte continue to slay numerous black brothers. At one point, a group of wildlings breach Castle Black's dining hall. One wildling is killed when a black brother throws boiling stew in his face and beats him to death with the pot. Hobb, Castle Black's cook, calmly enters the dining hall and kills a wildling with his massive butcher's knife. Meanwhile, Janos Slynt cowardly retreats to a storage room where he discovers Gilly and her baby.\n\n    Samwell Tarly comforts Pypar as he dies.  \nPyp​ manages to kill a wildling with his crossbow, but is then shot through the neck by Ygritte. Sam comforts Pyp and stays with him until he dies. Sam is forced to leave Pyp's body and as he heads to Castle Black's lift system, but he is spotted by the Thenn warg. The warg charges at Sam as he desperately attempts to load his crossbow, managing to do so and firing a bolt into the warg's head just before he reaches him. Meanwhile, Alliser Thorne is locked in a vicious duel with Tormund on the catwalks of Castle Black, both seemingly evenly matched in skill. However, Thorne suffers a grievous wound and is forced to retreat, being dragged to safety as he continues to shout orders to his men.\n\n    Mag Mar Tun Doh Weg charges Castle Black's inner gate.  \nThe black brothers defending the Wall manage to repel most of the wildlings attacking the outer gate, but one giant manages to make it through, greatly weakening the gate by repeatedly smashing it with his fists and managing to singlehandedly begin lifting the gate. Jon, knowing the inner gate won't hold against the massive giant, sends a group of black brothers led by Grenn to hold it at any cost. Arriving at the inner gate, Hill cowers when faced by the giant charging at them, but Grenn bolsters his and the others courage by reciting the Night's Watch oath. The black brothers ready their weapons just as the giant slams himself into the inner gate.\n\n     \nSam arrives atop the Wall to ask Jon for more men to defend the castle, and Jon tasks Sam with releasing Ghost from his pen to assist in the fighting. Jon descends the Wall and finally enters the fray, quickly dispatching several wildlings and catching the attention of Styr; the two meet in a single combat. Styr eventually gets the upper hand by knocking Longclaw away and brutally assaulting Jon, smashing his face into an anvil and tossing him into the blacksmith's forge. Styr picks Jon up and begins strangling him, but Jon spits blood in Styr's face and distracts him long enough for Jon to grab the blacksmith's hammer lying next to him and buries it in Styr's skull.\n\n    Jon holds a dying Ygritte.  Upon killing Styr, Jon turns around to find Ygritte pointing her bow at him with an arrow drawn. He smiles at her, causing Ygritte to hesitate. Before either can say anything, Ygritte is shot near the heart by an arrow fired from Olly, avenging the death of his father at Ygritte's hands during the wildling attack on his village. Jon holds her in his arms as she tells him that they should have never left the cave, and they lament circumstances that prevented them from being together as she succumbs to her wound.\n    Tormund makes a last stand before he is subdued by Jon and the Night's Watch.  Atop the Wall, Eddison Tollett, who Jon left in command of the defenses, orders the men to drop the 'scythe.' A huge section of ice suddenly falls away from the wall revealing a massive anchor-like blade attached to a chain that swings along the Wall, mowing through the wildlings attempting to climb its face. Eddison notices the wildling forces are beginning to withdraw into the Haunted Forest, proclaiming that they have stopped them for now, but that the wildlings still outnumber the black brothers 1,000 to 1 and that Mance was simply testing their defenses. Below, a heavily wounded Tormund is surrounded in the courtyard but continues to fight despite being the only wildling alive in Castle Black. He is finally subdued by Jon with a crossbow and taken prisoner by the Night's Watch for interrogation. Sam returns to Gilly just like he promised and discovers Janos Slynt, who hid in fear during the entire battle. Against all odds, the Night's Watch have repelled Mance Rayder's forces for the time being.\nThe following morning, what is left of Castle Black's garrison begin to regroup and prepare for the inevitable next attack by Mance Rayder. Jon discusses with Sam that he has a suicidal solution to end the wildling threat; he plans to assassinate Mance Rayder, noting that he is the only thing binding the disparate wildling clans that make up the army, and his death will rob them of that purpose and leadership. Sam tries to talk sense into Jon, but to no avail. As Jon prepares to leave via Castle Black's tunnel, they discover the bodies of the black brothers who held the inner gate against the giant. Grenn is amongst the casualties and Jon tells Sam that all bodies must be burned. Before Jon leaves, he remembers the promise he made to Jeor Mormont and decides to leave Longclaw with Sam. Sam tells Jon to come back, and Jon looks at Sam and smiles unreassuringly before stepping out into the wilderness on the other side of the gate."}],"firsts":["Mag Mar Tun Doh Weg","Cooper","Donnel Hill","​Hobb","Smitty"],"deaths":["Dongo, shot by a balista bolt","Smitty, fell off the top of the Wall","Pypar, shot in the neck with an arrow by Ygritte","Thenn Warg, shot in the head with an arrow by Samwell Tarly","Styr, head smashed with a hammer by Jon Snow","Ygritte, shot with an arrow through the chest by Olly","Mag Mar Tun Doh Weg, killed by Grenn and five other black brothers","Grenn, killed by Mag Mar Tun Doh Weg","Cooper, killed by Mag Mar Tun Doh Weg","Donnel Hill, killed by Mag Mar Tun Doh Weg"],"cast":[{"actor":"Kit Harington","character":"Jon Snow"},{"actor":"John Bradley","character":"Samwell Tarly"},{"actor":"Hannah Murray","character":"Gilly"},{"actor":"Rose Leslie","character":"Ygritte"},{"actor":"Kristofer Hivju","character":"Tormund"},{"actor":"Peter Vaughan","character":"Maester Aemon"},{"actor":"Owen Teale","character":"Ser Alliser Thorne"},{"actor":"Dominic Carter","character":"Lord Janos Slynt"},{"actor":"Mark Stanley","character":"Grenn"},{"actor":"Ben Crompton","character":"Eddison Tollett"},{"actor":"Yuri Kolokolnikov","character":"Styr"},{"actor":"Josef Altin","character":"Pypar"},{"actor":"Brenock O'Connor","character":"Olly"},{"actor":"Joseph Gatt","character":"the Thenn Warg"},{"actor":"Ian Whyte","character":"Dongo the giant."},{"actor":"Neil Fingleton","character":"Mag Mar Tun Doh Weg"},{"actor":"Joe Claflin","character":"Cooper"},{"actor":"Neil Marshall","character":"a Night's Watch Archer"},{"actor":"Jack Roth","character":"Donnel Hill"},{"actor":"Michael Stuart","character":"a Night's Watch Officer"},{"actor":"Unknown","character":"Hobb"},{"actor":"Unknown","character":"Smitty"}]}
