{"title":"The Lion and the Rose","season":"4","episode":"2","date":"Sun Apr 13 2014","authors":["George R.R. Martin"],"directors":["Alex Graves"],"info":"\"The Lion and the Rose\" is the second episode of the fourth season of Game of Thrones and the thirty-second episode of the series overall. It aired on April 13, 2014 and was written by George R.R. Martin, the writer of the A Song of Ice and Fire novels on which the series is based. It was directed by Alex Graves.","plot":"A who's who of honored guests turns out for Joffrey and Margaery's wedding in King's Landing. Meanwhile, Bronn gives a lesson to an unlikely pupil; Bran's vision helps map out his journey; Stannis loses patience with Davos; and Ramsay takes a perverse delight in his new pet.","summary":[{"location":"At Dragonstone","content":"On the beach of Dragonstone, Melisandre presides over a public burning ceremony, setting three people chained to stakes ablaze as an offering to the Lord of Light. One of the condemned is Queen Selyse Baratheon's own brother Axell Florent, condemned for his lack of faith in the Lord's power. Watching the proceedings, Ser Davos Seaworth holds his tongue, though his disgust both for the ritual and Melisandre are plain. Melisandre is surprisingly silent throughout the proceedings; it is Selyse who takes the greatest pleasure in the ritual.\nAfterwards, Stannis and Selyse eat dinner, with Melisandre as a guest at their table. The royal couple argue over their daughter, Princess Shireen Baratheon; Selyse believes the girl's disfigurement is a punishment from the Lord of Light, but Stannis angrily forbids his wife from trying to physically chastise their daughter for her perceived faults. Selyse switches tactics and suggests that Melisandre speak to Shireen. Stannis doesn't protest, but Melisandre doesn't look particularly interested in the task. Nonetheless, Melisandre does speak with Shireen, who heard the death of her uncle from her bedroom window, explaining in gentle yet matter-of-fact terms that the Faith of the Seven and its holy books are lies: Melisandre insists there are only two gods, the Lord of Light and the Great Other, constantly at war. When Shireen asks if there is any truth to the Faith's belief in seven heavens and seven hells, Melisandre replies \"There is only one hell... the one we live in now\".\n\nA"},{"location":"At the Dreadfort","content":"In the forests surrounding the Dreadfort, the seat of House Bolton, Ramsay Snow hunts a peasant girl for his sport, accompanied by Theon Greyjoy (whom Ramsay now addresses by his new name, Reek) and Myranda, along with a pack of savage dogs. The girl is eventually brought down and torn to pieces by the dogs, much to Reek's horror.\nSoon after, Roose Bolton arrives at the Dreadfort accompanied by a detachment of his army, including Locke and Roose's new wife, Walda Bolton. Ramsay greets his father and his new step-mother (as well as privately congratulating Locke for his maiming of the Kingslayer). Roose wants to see Ramsay's captive Theon Greyjoy.\nTheon is brought to Roose's chambers, where Roose is disgusted and angered to learn Ramsay has tortured and flayed Theon; as Balon Greyjoy's sole surviving male heir, Theon was a valuable hostage. Roose notes that while he has been named Warden of the North, Tywin Lannister will not help him reclaim the north from the ironborn, and he had intended on trading Theon for Moat Cailin, a strategically placed fortress on the border between the North and the Riverlands currently held by Greyjoy forces, preventing the main Bolton army from returning north. Ramsay retorts that he already sent terms and Balon refused him. Roose is furious that Ramsay did so without his consent, but Ramsay demonstrates that his actions have made Reek docile and unable to betray them.\nAfter ordering Reek to shave him, Ramsay cajoles him into admitting that Bran and Rickon Stark are still alive. Ramsay reminds his father that the boys are now heirs to House Stark's rule of the North following Robb Stark's death, and nearly all the Northerners, who are furious at House Bolton and House Frey's treachery against the Starks, will rally behind Bran and Rickon rather than Roose if they learn the boys are alive. Ramsay, knowing how close Theon was to Robb, gleefully taunts him by revealing details of the Red Wedding, particularly relishing the fact that it was Roose who personally murdered Robb. Despite being clearly shaken to know the man he considered a brother is dead at the hands of his new masters, Theon does not openly react.\nRoose dispatches Locke with orders to find and kill Bran and Rickon; Reek suggests that Jon Snow might either be sheltering the boys at Castle Black or at least may know where they have gone, while Ramsay advocates killing Jon as well, given that the fact he has Stark blood could lead to him becoming a threat, since the Northeners will rally behind him or he will simply seek revenge (although harming Jon would constitute a grave crime since he is part of the Night's Watch and thus legally untouchable by the Seven Kingdoms). Roose gives Ramsay orders as well; to take Theon and an army to Moat Cailin and reclaim the fortress from the Greyjoys. If he succeeds, Roose will give consideration to legitimizing Ramsay as a member of House Bolton.\n\nB"},{"location":"Beyond the Wall","content":"We follow the point of view of a panting figure traveling through a dark, snow-covered forest. It kills a deer. Just as the figure makes its kill, it is revealed that the figure is Summer and that Bran Stark had been warging into Summer. Bran's warging is interrupted by Meera Reed, who says that Bran had been gone for hours. Bran is not happy about having been snapped out of his warging, saying that he was eating. Jojen Reed clarifies that Summer was eating and that what Bran cannot gain sustenance from what Summer eats. Jojen and Meera also caution Bran that warging so long is dangerous for other reasons. Even though it allows Bran the mobility he lost when he was injured, Bran would become trapped, forgetting his friends, his family, his home, and even himself. And if Bran forgets himself, they all lose everything.\nThe group breaks camp and continues traveling through the forest. They eventually come upon a weirwood tree. Bran has Hodor take him to the tree. Bran touches the tree just under the face carved into it and sees a vision. Several images rush to Bran's mind, including swarms of crows, wights (both human and horses), and the fall that paralyzed him. He also sees the Three-eyed raven taking flight in a darkened corridor and later land on a tree. Bran sees his father sharpening Ice, in the Black Cells, and being led to his execution; the Red Keep abandoned and covered in snow; and the shadow of a dragon flying over King's Landing. Bran also sees several images of a different weirwood tree located on top of an otherwise barren mountain. During the vision, a gravely voice tells Bran to \"look for me beneath the tree... NORTH.\" Bran snaps out of his vision out of breath, but then matter-of-factly states, \"I know where we have to go.\"\n\nA"},{"location":"At King's Landing","content":"Over a meal, Jaime and Tyrion discuss Jaime's gilded steel hand, and he discloses to Tyrion that he can no longer fight, as all of his instincts are wrong using his left hand. Jaime is perturbed that people will find out that he cannot fight so Tyrion tells him that he needs to train with his left hand with someone trustworthy in order to better protect the king, as the Lord Commander of the Kingsguard.\n\n    Brienne presented before King Joffrey and Queen Margaery at their wedding.  \nLater, Jaime waits in a courtyard by the sea for his training partner that Tyrion has arranged. Bronn emerges with two training swords. Jaime remarks that he hasn't wielded a sparring sword since he was nine. As they commence training, Bronn uses his usual dirty tactics and gets the better of Jaime, teaching him not only to use his offhand, but encouraging him to fight dirtier.\nTyrion finds Varys on his way to a breakfast celebration on the day of Joffrey's wedding. Varys divulges that Shae has been spotted and that his sister, Cersei, has been notified. Varys then says that there is nothing he can do to protect Shae any longer in fear of Tywin Lannister, the Hand of the King, or Cersei finding out that he has been lying to them. Tyrion then says that Shae will not leave King's Landing and is warned that Tywin has threatened to hang the next whore Tyrion is seen with.\n\n    The dais set up for the royal wedding.  \nAt the breakfast celebration, Mace Tyrell gifts Joffrey a magnificent golden chalice with seven facets, one for each of the major houses in the Seven Kingdoms and wishes he and his daughter, Margaery Tyrell, a long and happy marriage. Joffrey graciously accepts. Cersei spots Shae and tells Tywin that she is Tyrion's whore, and he commands for her to be sent to the Tower of the Hand before the wedding. Tyrion overhears this and looks vexed, but proceeds to approach Joffrey and Podrick Payne, Tyrion's squire, presents him with the Lives of Four Kings, a book detailing the reigns of four kings by Grand Maester Kaeth. Joffrey accepts the gift but his sincerity seems questionable. A member of the Kingsguard then presents a Valyrian steel sword and Tywin tells him that it is one of two swords of its kind in the capital, and Joffrey rushes to wield it. He promptly begins to slash at Tyrion's gift despite its rarity, and then asks for suggestions on its name from guests in attendance. He settle on the name Widow's Wail.\nAfter the breakfast, Tyrion is visited in his chambers by Shae and he informs her that there is a ship waiting for her bound for Pentos and that their \"friendship\" is at an end. Shae pleads to stay, but Tyrion says he is married and it is too dangerous for her to stay. \n\n    Joffrey is poisoned and killed.  \nWhen Bronn enters and tries to escort her out, she slaps him and runs away. When Tyrion later asks Bronn if she is gone, he says that she boarded the ship. When Tyrion asks if he saw it sail away, Bronn assures him that no one has been following him while escorting her, that she is gone and no one knows about it except the two of them and Varys. He then advises Tyrion to go and drink until it feels like he did the right thing.\nJoffrey and Margaery's wedding ceremony takes place in the Great Sept of Baelor conducted by the High Septon and they are wed in front of gods and men. At his wedding feast, King Joffrey speaks to the crowd about contemplating history. Out of a large golden lion, five dwarves ride out, representing Joffrey, Renly Baratheon, Stannis Baratheon, Robb Stark, and Balon Greyjoy, each of the five kings in the War of the Five Kings. The dwarves put on a performance, jousting, fighting, and making crude sexual acts. Joffrey, his brother Tommen, and Cersei laugh at the performance. The Tyrells (Margaery, Olenna, Mace, and Loras), as well as Varys, Prince Oberyn, Tywin, Tyrion, and Sansa Stark, make little effort to hide their disgust. Loras leaves in anger after watching the crude depiction of his deceased lover Renly (riding a mount resembling Loras), and Sansa looks on in obvious grief when the dwarf playing her brother Robb is killed after having his wolf's head knocked off. Joffrey expresses his delight with the play and prepares to give the champion dwarf a purse but then mockingly suggests that Tyrion fight him as well. Tyrion cleverly counters this jape by suggesting that Joffrey should fight instead and show the same bravery he displayed at the Battle of the Blackwater, cautioning his nephew to be careful as the champion dwarf is \"clearly mad with lust\" and it would be a tragedy for the king to lose his virtue hours before his wedding night. This draws a few stifled chuckles from their guests. Enraged and humiliated that his uncle outwitted him in front of all his wedding guests, Joffrey petulantly pours wine over Tyrion's head and orders him to serve him wine as his cupbearer.\nTyrion approaches Joffrey, who then purposely drops the goblet and kicks it under the table. Sansa hands the goblet to Tyrion, and he fills it with wine and hands it back to Joffrey. The king demands that Tyrion kneel before him but Tyrion refuses. Margaery interrupts the tense moment and says it is time to cut the pigeon pie. Joffrey hands the goblet to Margaery, who then places it at the edge of the table near her grandmother Olenna. Joffrey draws his new sword, cuts the pie, and several white doves fly out.\n\n    Cersei cries over her sons murder.  \nSansa and Tyrion attempt to leave the feast, while Margaery serves Joffrey a piece of pie. Joffrey commands Tyrion to serve him wine to wash down the pie. Tyrion hands the goblet to Joffrey and he quickly drinks all of it. Joffrey tries to speak, but begins coughing. He grabs his throat, and Margaery and Olenna exclaim that he is choking and needs help. Joffrey collapses face down and begins vomiting and convulsing. Jaime and Cersei rush in and turn Joffrey over on his back. Dontos Hollard suddenly approaches Sansa from behind and says she must come with him quickly, and she does. Joffrey points an accusatory finger in Tyrion's direction, as he examines the wine goblet (though it is not made clear if Joffrey is accusing Tyrion or merely the wine). Joffrey's eyes turn red, blood runs from his nose, he stops convulsing, and dies. Cersei sobs with grief and orders the Kingsguard to seize Tyrion for the poisoning of her son."}],"firsts":["Tansy","Ser Axell Florent","Walda Bolton","Mace Tyrell","Dwarf 1","Dwarf 2","Dwarf 3","Dwarf 4","Dwarf 5   "],"deaths":["Tansy, torn apart by Ramsay's hounds","Ser Axell Florent, burned alive by Melisandre","King Joffrey I Baratheon, choked to death by poison"],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Nikolaj Coster-Waldau","character":"Ser Jaime Lannister"},{"actor":"Lena Headey","character":"Queen Cersei Lannister"},{"actor":"Charles Dance","character":"Lord Tywin Lannister"},{"actor":"Natalie Dormer","character":"Lady Margaery Tyrell"},{"actor":"Liam Cunningham","character":"Ser Davos Seaworth"},{"actor":"Stephen Dillane","character":"King Stannis Baratheon"},{"actor":"Carice van Houten","character":"Lady Melisandre"},{"actor":"Alfie Allen","character":"Prince Theon Greyjoy"},{"actor":"Jack Gleeson","character":"King Joffrey Baratheon"},{"actor":"Isaac Hempstead-Wright","character":"Bran Stark"},{"actor":"Sophie Turner","character":"Lady Sansa Stark"},{"actor":"Gwendoline Christie","character":"Brienne of Tarth"},{"actor":"Sibel Kekilli","character":"Shae"},{"actor":"Iwan Rheon","character":"Ramsay Snow"},{"actor":"Conleth Hill","character":"Lord Varys"},{"actor":"Jerome Flynn","character":"Ser Bronn"},{"actor":"Diana Rigg","character":"Lady Olenna Tyrell"},{"actor":"Pedro Pascal","character":"Prince Oberyn Martell"},{"actor":"Indira Varma","character":"Ellaria Sand"},{"actor":"Michael McElhatton","character":"Lord Roose Bolton"},{"actor":"Noah Taylor","character":"Locke"},{"actor":"Tara Fitzgerald","character":"Queen Selyse Baratheon"},{"actor":"Julian Glover","character":"Grand Maester Pycelle"},{"actor":"Roger Ashton-Griffiths","character":"Lord Mace Tyrell"},{"actor":"Finn Jones","character":"Ser Loras Tyrell"},{"actor":"Thomas Brodie-Sangster","character":"Jojen Reed"},{"actor":"Ellie Kendrick","character":"Meera Reed"},{"actor":"Kristian Nairn","character":"Hodor"},{"actor":"Dean-Charles Chapman","character":"Prince Tommen Baratheon"},{"actor":"Daniel Portman","character":"Podrick Payne"},{"actor":"Ian Beattie","character":"Ser Meryn Trant"},{"actor":"Tony Way","character":"Dontos Hollard"},{"actor":"Kerry Ingram","character":"Princess Shireen Baratheon"},{"actor":"Charlotte Hope","character":"Myranda"},{"actor":"Jazzy de Lisser","character":"Tansy"},{"actor":"Paul Bentley","character":"the High Septon"},{"actor":"Elizabeth Webster","character":"Lady Walda Bolton"},{"actor":"James McHale","character":"Ser Axell Florent"},{"actor":"Pixie Le Knot","character":"Kayla"},{"actor":"Jón Þór Birgisson","character":"a Musician"},{"actor":"Georg Hólm","character":"a Musician"},{"actor":"Orri Páll Dýrason","character":"a Musician"},{"actor":"Raymond Griffiths","character":"a Dwarf"},{"actor":"Max Laird","character":"a Dwarf"},{"actor":"Dean Whatton","character":"Dwarf"},{"actor":"George Appleby","character":"a Dwarf"},{"actor":"Krysten Coombs","character":"a Dwarf"},{"actor":"Struan Rodger","character":"the Three-eyed raven"},{"actor":"Neil Baltus","character":"a Noble Man"},{"actor":"Richard Buick","character":"a Tyrell Wedding Guest"},{"actor":"Paul Herbert","character":"a Wedding Guest"},{"actor":"Stella Lutz","character":"a Noble Lady"},{"actor":"C.C. Smiff","character":"a Wedding Guest"},{"actor":"Sean Bean","character":"Lord Eddard Stark (archive footage, no lines)"}]}
