{"title":"The Laws of Gods and Men","season":"4","episode":"6","date":"Sun May 11 2014","authors":["Bryan Cogman"],"directors":["Alik Sakharov"],"info":"\"The Laws of Gods and Men\" is the sixth episode of the fourth season of Game of Thrones.[1] It is the thirty-sixth episode of the series overall. It premiered on May 11, 2014. It was written by co-producer Bryan Cogman and directed by Alik Sakharov.","plot":"Stannis and Davos set sail with a new strategy. Dany meets with supplicants. Tyrion faces down his father in the throne room.","summary":[{"location":"At the Dreadfort","content":"Yara Greyjoy prepares her troops for their assault on the Dreadfort to rescue her brother, Theon. She reads the letter sent by Ramsay Snow, threatening to flay all ironborn who do not leave the North. While Ramsay has rather violent sex with Myranda, Yara and her troops land and scale the walls of the castle. They quietly take out the guards as they search for Theon. Interrogating a guard, Yara learns of Theon's location which is the dog kennels, and Yara then kills the guard, despite promising not to. There, the ironborn and Yara see Theon sitting in a cage. Yara opens the cage, but Theon refuses to go with her, believing it is another cruel trick played by Ramsay. Ramsay and several Bolton troops enter and a fight ensues, with several Bolton and Greyjoy soldiers killed. Theon tells Yara his name has always been Reek, bites her, and cowers in his cage. Ramsay releases the hounds and Yara is forced to retreat to her ship. When one of the ironmen asks about Theon, Yara says Theon is \"dead.\" \nRamsay allows Reek to take a bath, as a reward for his loyalty. Reek fears the bath is another trick but Ramsay assures him it is not. While Reek bathes, Ramsay now plans to assault Moat Cailin and needs Reek to pretend to be someone he isn't: Theon Greyjoy.\n\nA"},{"location":"At King's Landing","content":"At a meeting of the Small Council, Tywin informs the councilors that Tyrion's trial will begin that afternoon. Lord Varys informs Tywin that the Hound has been spotted in the Riverlands, and Tywin orders a bounty on his head. Varys also informs the council of Daenerys's conquest of Meereen, and Tywin decides to take measures to prevent her from launching an invasion. In the dungeon, Jaime has Tyrion shackled and brought into the throne room to begin his trial. King Tommen recuses himself from the trial, appointing his grandfather Tywin, Prince Oberyn Martell, and Lord Mace Tyrell as judges. Several witnesses are called for the prosecution, including Ser Meryn Trant, Grand Maester Pycelle, Queen Regent Cersei, and Varys, all of whom give testimony backing the accusations against Tyrion.\n\n    Varys testifies at Tyrion's trial  \nAt recess, Jaime asks Tywin to spare Tyrion, offering to break his oath to the Kingsguard and return to Casterly Rock, to be his heir. Tywin accepts, telling Jaime that Tyrion will be allowed to join the Night's Watch after being found guilty of Joffrey's murder, provided he pleads for mercy. Before the recess ends, Jaime speaks with Tyrion and urges him to do so. Tyrion is deeply distrustful of the offer, remarking that Eddard Stark was promised the same thing and yet still lost his head, but Jaime pleads with his brother to trust him, insisting that their father will keep his word.\nReturning to the trial, Tywin orders the next witness to testify: Shae. She testifies that Tyrion and Sansa planned Joffrey's murder together, claiming that Sansa wanted vengeance for the murder of her father, mother, and brother. She tells the judges of Tyrion's sexual desires, embarrassing him in front of the crowd. Before she can continue, Tyrion, enraged beyond sense, angrily demands that he be allowed to confess his crimes. He angrily roars about how he saved King's Landing from Stannis Baratheon's forces and says he should've allowed Stannis to kill everyone in King's Landing, much to the horror and disgust of the people in the court. Tyrion then claims to be guilty. Tywin assumes that he is guilty for murdering King Joffrey Baratheon. Tyrion denies this, saying he is guilty of a \"far more monstrous crime. I am guilty of being a dwarf!\" Tywin scoffs at Tyrion's claims and says he is not on trial for being a dwarf. Tyrion angrily says he has been on trial for his entire life as a dwarf. Tywin asks if he has nothing to say in his defense. Tyrion then says he has nothing to say in his defense \"but only this.\" He then reveals his true feelings about Joffrey, denying guilt in the king's murder but saying he wished to have killed Joffrey himself. Tyrion then turns his full fury towards Cersei and says that watching her \"vicious bastard\" of a son die gave him more relief than \"a thousand lying whores.\" He then turns around to the court and roars that he wishes to have become the monster they thought he was and would have gladly give his life to watch everyone die from drinking poison. This enrages everyone in the court and Tywin orders Ser Meryn to escort Tyrion back to the dungeons. Before he can be escorted out, Tyrion bellows that he will not lose his life for a crime he did not commit and, knowing that he will get no justice from the court, demands a trial by combat. \n\nI"},{"location":"In Braavos","content":"Stannis Baratheon and Ser Davos visit the Iron Bank of Braavos in hopes of securing funds to aid Stannis' war effort. At first Tycho Nestoris, a representative from the bank, rejects their request, but Davos entreats him and points out that funding Stannis is the best way they could possibly get the gold they loaned to Tywin Lannister back. The Bank agrees to lend them gold, and Davos uses it to once again recruit his old pirate friend Salladhor Saan to Stannis' cause.\n\nI"},{"location":"In Meereen","content":"Drogon toasting goats  On one sunny day outside of Meereen, a goat herder and his son are peacefully tending the goats on a hill while the son throws rocks to pass the time. Suddenly, Drogon (now the size of a horse) appears and burns the field and kills a flock of goats while taking one with him. The goat herder travels to Meereen to visit the queen and lays the charred remains of his flock before Daenerys, hoping to not anger the queen and believes it to be punishment. Daenerys apologizes about Drogon's actions and promises to pay back three times the worth of his flock. \nAfter he departs, Hizdahr zo Loraq presents his petition: the right to bury his father's remains in the Temple of the Graces, as he was one of the Meereenese Great Masters crucified on Daenerys's orders. She counters that he was one of the masters that crucified the 163 children. Loraq reveals that his father actually spoke out against the crucifixion of the slave children but was overruled, but later was killed due to Daenerys's judgment anyway. Somewhat mollified, Daenerys allows him to bury his father. As he leaves, Daenerys asks how many more supplicants are waiting; Missandei answers that there are over 200 more."}],"firsts":["Tycho Nestoris","Lhara","Goatherd"],"deaths":["Bolton guard, killed by Yara Greyjoy"],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Nikolaj Coster-Waldau","character":"Ser Jaime Lannister"},{"actor":"Lena Headey","character":"Queen Cersei Lannister"},{"actor":"Emilia Clarke","character":"Queen Daenerys Targaryen"},{"actor":"Charles Dance","character":"Lord Tywin Lannister"},{"actor":"Natalie Dormer","character":"Lady Margaery Tyrell"},{"actor":"Liam Cunningham","character":"Ser Davos Seaworth"},{"actor":"Stephen Dillane","character":"King Stannis Baratheon"},{"actor":"Alfie Allen","character":"Reek"},{"actor":"Iwan Rheon","character":"Ramsay Snow"},{"actor":"Conleth Hill","character":"Lord Varys"},{"actor":"Sibel Kekilli","character":"Shae"},{"actor":"with Iain Glen","character":"Ser Jorah Mormont"},{"actor":"Pedro Pascal","character":"Prince Oberyn Martell"},{"actor":"Julian Glover","character":"Grand Maester Pycelle"},{"actor":"Ian McElhinney","character":"Ser Barristan Selmy"},{"actor":"Mark Gatiss","character":"Tycho Nestoris"},{"actor":"Roger Ashton-Griffiths","character":"Lord Mace Tyrell"},{"actor":"Lucian Msamati","character":"Salladhor Saan"},{"actor":"Nathalie Emmanuel","character":"Missandei"},{"actor":"Jacob Anderson","character":"Grey Worm"},{"actor":"Gemma Whelan","character":"Princess Yara Greyjoy"},{"actor":"Finn Jones","character":"Ser Loras Tyrell"},{"actor":"Dean-Charles Chapman","character":"King Tommen Baratheon"},{"actor":"Ian Beattie","character":"Ser Meryn Trant"},{"actor":"Joel Fry","character":"Hizdahr zo Loraq"},{"actor":"Charlotte Hope","character":"Myranda"},{"actor":"Philip Arditti","character":"a goatherd"},{"actor":"Rhodri Miles","character":"a First Mate"},{"actor":"Sarine Sofair","character":"Lhara"},{"actor":"Samantha McEwan","character":"a Bathhouse prostitute"},{"actor":"Michael Hough","character":"Ironborn in skiff"},{"actor":"Anthony Boyle","character":"a Bolton guard"},{"actor":"Conor Watters","character":"Hizdahr zo Loraq's manservant"},{"actor":"Gian Sanghera-Warren","character":"a goatherd's son"},{"actor":"Niamh Lennon","character":"a King's Landing Handmaiden"},{"actor":"Graeme Peacock","character":"Stannis Crew"},{"actor":"Dean Weir","character":"Noble Man"}]}
