{"title":"The Mountain and the Viper","season":"4","episode":"8","date":"Sun Jun 01 2014","authors":["David Benioff and D.B. Weiss"],"directors":["Alex Graves"],"info":"\"The Mountain and the Viper\" is the eighth episode of the fourth season of Game of Thrones[1]. It is the thirty-eighth episode of the series overall. It premiered on June 1, 2014. It was written by producers David Benioff and D.B. Weiss and directed by Alex Graves.","plot":"Unexpected visitors arrive in Mole's Town. Littlefinger's motives are questioned. Ramsay tries to prove himself to his father. Tyrion's fate is decided.","summary":[{"location":"In the North","content":"Ramsay Snow sends Reek, forced to reassume his former identity of Theon Greyjoy, to treat with the ironborn garrison holding the northern fortress of Moat Cailin, barring the armies of House Bolton from returning to the North. Theon rides into the fortress to find corpses lying everywhere from constant attacks, and disease is running rampant; the ironborn remaining are sick, under-equipped and outnumbered. The garrison commander, Ralf Kenning, rebuffs the offer made by Ramsay of safe passage in exchange for surrender, and clearly thinks Theon to be an imposter, but he is cut down by one of his men, who accepts it on behalf of the soldiers. The ironborn surrender to Ramsay, but he has them killed and flayed regardless.\nIn the aftermath, Ramsay meets with his father and presents him with the Greyjoy banner that was flying over the fortress. In recognition, Roose presents Ramsay with a decree of legitimization, making him officially a member of House Bolton. Delighted at the knowledge he will succeed his father as Warden of the North, Ramsay and Reek accompany Roose's army as it approaches its final destination: the ruins of Winterfell. \nIn Mole's Town, a whore is arguing with Gilly about her baby who woke her up during the night. Meanwhile, wildlings, including Tormund, Styr and Ygritte, attack the town, killing everyone in their path. Ygritte discovers Gilly hiding with her baby, but urges them to keep quiet, sparing their lives.\n\nA"},{"location":"At the Wall","content":"News from M​ole's Town has arrived at Castle Black, where Sam worries about Gilly, blaming himself for bringing her to the town instead of keeping her with him at Castle Black. Grenn is angry at them cowering in the castle instead of helping their brothers in neighboring towns. Jon Snow says they can't go out to fight against the wildlings, as that is exactly what they want. Pypar and Edd try to comfort Sam by saying she might be alive and hiding, as she has survived worse situations, such as living with Craster, making a long march to the Wall, and even surviving a White Walker. This gives Sam hope that Gilly and her baby may have survived. Jon notes they have a bigger problem; if Mole's Town has been destroyed, Castle Black is next, and the few black brothers who remain are outnumbered a thousand to one by Mance Rayder's army. Edd notes that if the wildlings don't kill them all, there is even worse behind them that will finish the job, and asks whichever last man of the group is still alive at the end to burn the others, as he doesn't want to come back after he is dead.\n\nA"},{"location":"Across the Narrow Sea","content":"As Grey Worm is swimming with some other Unsullied outside Meereen, he notices Missandei and a number of other women bathing naked downstream. She spots him looking at her and returns his gaze, standing up slowly for him to see her before finally covering herself. Later Daenerys asks whether Missandei thinks he was spying on her. She says no, and Daenerys mentions that Dothraki have no taboos against nudity or public love-making. Of course, Missandei is not Dothraki, but she says it doesn't matter, as Grey Worm isn't interested in her – none of the Unsullied desire women. Missandei says he was interested though, surprisingly to both of them. Daenerys inquires whether, when a slave is castrated, the masters take \"all of it\"; both the \"pillar\" and the \"stones.\" Missandei says she doesn't know, to which Daenerys asks if she's ever wondered. Thoughtful, Missandei confirms that she has.\nIn Dany's audience chamber, Grey Worm comes to apologize to Missandei, but she tells him he doesn't need to. He hopes he didn't frighten her, and she says he did not. Addressing her in the Common Tongue, he tells her the lessons she gives are precious to him. Gently correcting his vocabulary, she notes that she doesn't remember teaching him the word \"precious.\" Grey Worm tells her that Jorah taught it to him. She asks whether he remembers his birth name, and Grey Worm says he remembers nothing. She asks if he remembers when they cut him, and he shakes his head \"no.\" She tells him she's sorry they did that to him, and when Grey Worm asks her why, she says it's a terrible thing to do to a boy. Grey Worm counters that, had the masters not cut him, he never would have been Unsullied, he never would have been freed, chosen to lead them, and met her. Missandei is visibly moved by this. Grey Worm apologizes once again, and she stops him while he turns to leave, telling him she is glad he saw her. He tells her he's glad as well. \nAs Ser Barristan Selmy watches the Unsullied taking the bodies of the crucified masters down outside Meereen, a small boy approaches him, giving him a scroll bearing the seal of the Hand. He reads its contents slowly in consternation. He confronts Ser Jorah: the document is a royal pardon signed by King Robert Baratheon. Barristan surmises Jorah spied on Daenerys in exchange for the pardon. Jorah begs to be allowed to speak with her privately, but Barristan tells him that he will never be alone with her again. In an audience before her, a seething Daenerys demands an explanation, and Jorah says it is a ploy by Tywin Lannister to divide them. Dany counters that the pardon was signed the year they met. Asking him whether he claims the pardon was forged, Jorah admits that it was not. He soon confesses to giving Varys information on Daenerys' activities in Essos. Daenerys angrily says that his telling them of her pregnancy by Khal Drogo led to her near-poisoning at the hands of a wine merchant. Jorah then protests that his actions stopped her from being poisoned, but Daenerys retorts this was only because he knew it might be coming. Jorah begs for her forgiveness, but Daenerys rebuffs him, saying he betrayed her, selling her secrets to the man she holds responsible for the death of her family. She spares his life, however, and gives him a day to leave Meereen. She warns that if he is seen in the city after that, his head will be thrown into Slaver's Bay. Jorah is last seen riding from Meereen on a horse.\n\nI"},{"location":"In the Vale","content":"Petyr Baelish is testifying before a tribunal consisting of Lord Yohn Royce, Lady Anya Waynwood, and Ser Vance Corbray. The lords are suspicious of Lysa Arryn's death, which occured so soon after her marriage. Baelish has been attempting to spin the death as a suicide, but the lords don't believe him, given Lysa's devotion to her son. They rebuff Littlefinger's explanations in favor of speaking with the only other witness: his \"niece,\" Alayne. After confirming that Baelish can stay for her testimony, Sansa reveals her true identity and relates the tale of her captivity and escape from King's Landing. She continues, truthfully telling of Lysa's mental instability, jealousy and death, changing only a few details (saying Littlefinger only kissed her on the cheek and Lysa threw herself through the Moon Door). Sansa breaks down in tears and the lords are convinced, but while none of them are looking, she gives Littlefinger a stone-faced look.\nLater, Baelish visits Sansa and asks why she lied on his behalf. Sansa explains that she has no idea what Royce, Corbray, and Waynwood would want from her if he were eliminated, but that she does know what it is he wants. Littlefinger seems impressed that she made such a calculating decision, but attempts to cast doubt on her certainty, by asking if she really knows what he wants. Later on, as Littlefinger and Robin prepare to depart on a tour of the Vale, a raven-haired Sansa accompanies them, in a feathered black dress with a plunging neckline.\nAt some point, before or after this event, Sandor Clegane and Arya Stark arrive at the Bloody Gate of the Eyrie  and are informed of Lysa's death by Ser Donnel Waynwood. The Hound stares in shock, while Arya begins laughing due to the irony.\n\nA"},{"location":"At King's Landing","content":"In the last hours before his trial by combat, Tyrion and Jaime share a final drink in Tyrion's cell and reminisce about Orson Lannister, their simple-minded cousin who spent his days smashing beetles with a rock. Tyrion tells Jaime of how he used to observe Orson day after day in an attempt to understand his motives, but in the end he was never able to come to reach any understanding. Tyrion asks Jaime if he thinks Oberyn stands a chance, but Jaime is not optimistic. As a bell rings out to announce daybreak in the city, Jaime takes his leave, wishing his brother luck.\nLannister guardsmen escort Tyrion to the arena, where a large crowd has assembled. He grows apprehensive to find a helm-less Oberyn drinking, and wearing very light armor – in comparison to his opponent, Ser Gregor Clegane, clad from head to foot in heavy armor and wielding a greatsword. Oberyn dismisses Tyrion's concerns, noting that he always drinks before a fight and favors speed over protection. As Gregor and his squire make their way to the arena, Ellaria becomes concerned, noting that The Mountain is the biggest man she's ever seen, but Oberyn remains confident that he will emerge triumphant. Grand Maester Pycelle steps into the arena and begins making a long-winded speech asking the gods to favor the innocent before Tywin Lannister cuts him short and begins the trial by combat.\nOberyn, after impressing the crowd with a display of acrobatic spear maneuvers, goes on the attack, stabbing out at Gregor and constantly moving out of the knight's reach, forcing Gregor to tire himself out chasing his opponent. As he evades Gregor, Oberyn repeatedly taunts Gregor by constantly bringing up his part in the murder of his sister, Elia Martell, and her children, and demanding a confession, only enraging Clegane further. As the fight progresses, Oberyn manages to seriously injure Gregor, stabbing him first in the chest, severing his hamstring and then burying his spear in Gregor's stomach, pinning him to the floor. As Jaime and Tyrion exchange a relieved grin across the arena, a furious Oberyn circles the prone Gregor, demanding that before he dies, Gregor confess to murdering Elia and her children, raping Elia, and that it was Tywin who gave the order.\nHowever, Oberyn stands too close to his seemingly defeated opponent, and Gregor manages to trip and seize him. Berserk with fury, Gregor grabs Oberyn by the throat and lifts him off the ground, smashing out most of his teeth with a single devastating punch. Climbing on top of Oberyn, Gregor finally admits for all to hear that he raped and killed Elia as he gouges out Oberyn's eyes with his thumbs before crushing the Viper's skull between his hands, which he proclaims having done the same to his sister. As Ellaria screams in horror, a stunned silence sweeps over the crowd. The short joyful moments for Tyrion and Jaime are shattered, as Tywin stands and proclaims the will of the gods is clear: Tyrion is guilty and sentenced to death. Tyrion cannot even reply, shockingly staring in catatonic astonishment at Oberyn's skull-crushed corpse, as does Jaime; the only different reaction is from Cersei, who stares at Oberyn's slaughtered body, listening to Tyrion's death sentence while smirking in vindication."}],"firsts":["Kegs","Black Jack Bulwer","Mully","Ralf Kenning","Adrack Humble","Lord Yohn Royce","Lady Anya Waynwood","Ser Vance Corbray","Ser Daemon Sand"],"deaths":["Kegs, slain by an unidentified wildling","Black Jack Bulwer, slain by an unidentified wildling","Mully, slain by an unidentified wildling","Mole's Town whore, speared through the stomach by Ygritte","Ralf Kenning, killed by Adrack Humble","Adrack Humble, flayed by Ramsay Bolton/Bolton men","Prince Oberyn Martell, skull crushed by Gregor Clegane"],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Nikolaj Coster-Waldau","character":"Ser Jaime Lannister"},{"actor":"Lena Headey","character":"Queen Cersei Lannister"},{"actor":"Emilia Clarke","character":"Queen Daenerys Targaryen"},{"actor":"Kit Harington","character":"Jon Snow"},{"actor":"Aidan Gillen","character":"Lord Petyr Baelish"},{"actor":"Charles Dance","character":"Lord Tywin Lannister"},{"actor":"Alfie Allen","character":"Reek"},{"actor":"John Bradley","character":"Samwell Tarly"},{"actor":"Sophie Turner","character":"Sansa Stark"},{"actor":"Maisie Williams","character":"Lady Arya Stark"},{"actor":"Rose Leslie","character":"Ygritte"},{"actor":"Kristofer Hivju","character":"Tormund"},{"actor":"Hannah Murray","character":"Gilly"},{"actor":"Iwan Rheon","character":"Ramsay Bolton"},{"actor":"Conleth Hill","character":"Lord Varys"},{"actor":"Rory McCann","character":"Sandor Clegane"},{"actor":"with Iain Glen","character":"Ser Jorah Mormont"},{"actor":"Pedro Pascal","character":"Prince Oberyn Martell"},{"actor":"Indira Varma","character":"Ellaria Sand"},{"actor":"Michael McElhatton","character":"Lord Roose Bolton"},{"actor":"Ian McElhinney","character":"Ser Barristan Selmy"},{"actor":"Julian Glover","character":"Grand Maester Pycelle"},{"actor":"Roger Ashton-Griffiths","character":"Lord Mace Tyrell"},{"actor":"Yuri Kolokolnikov","character":"Styr"},{"actor":"Jacob Anderson","character":"Grey Worm"},{"actor":"Nathalie Emmanuel","character":"Missandei"},{"actor":"Mark Stanley","character":"Grenn"},{"actor":"Ben Crompton","character":"Eddison Tollett"},{"actor":"Josef Altin","character":"Pypar"},{"actor":"Paola Dionisotti","character":"Lady Anya Waynwood"},{"actor":"Rupert Vansittart","character":"Lord Yohn Royce"},{"actor":"Hafþór Júlíus Björnsson","character":"Ser Gregor Clegane"},{"actor":"Grahame Fox","character":"Ralf Kenning"},{"actor":"Lino Facioli","character":"Lord Robin Arryn"},{"actor":"Lois Winstone","character":"the Mole's Town whore"},{"actor":"Jody Halse","character":"Adrack Humble"},{"actor":"Alisdair Simpson","character":"Ser Donnel Waynwood"},{"actor":"Richard Doubleday","character":"Ser Vance Corbray"},{"actor":"Lu Corfield","character":"the Mole's Town madam"},{"actor":"Tim Lers","character":"Kegs"},{"actor":"Cormac McDonagh","character":"Black Jack Bulwer"},{"actor":"Andy Moore","character":"Mully"},{"actor":"Samuel Paul Small","character":"a Little Bird"},{"actor":"Mark Quigley","character":"Bolton Guard"},{"actor":"Unknown","character":"Ser Daemon Sand"},{"actor":"Unknown","character":"Joss Stilwood"}]}
