{"title":"Two Swords","season":"4","episode":"1","date":"Sun Apr 06 2014","authors":["David Benioff","D.B. Weiss"],"directors":["David Benioff "," D.B. Weiss"],"info":"\"Two Swords\" is the first episode of the fourth season of Game of Thrones. It is the thirty-first episode of the series overall. It premiered on April 6, 2014. It was written and directed by executive producers David Benioff and D.B. Weiss.","plot":"Tyrion welcomes a guest to King's Landing. At Castle Black, Jon Snow finds himself unwelcome. Dany is pointed to Meereen, the mother of all slave cities. Arya runs into an old friend.","summary":[{"location":"In King's Landing","content":"Tywin Lannister has the ancestral Stark Valyrian steel greatsword Ice (held by the Lannisters since Eddard Stark's execution) melted down and re-forged into two smaller swords, after which he burns the wolf pelt scabbard the greatsword was held in. He presents one to his son Jaime as a gift. Jaime is impressed, as the Lannisters have never previously owned a Valyrian steel sword. Tywin tells him he acquired the original sword from \"someone who no longer needed it\" and then commissioned a Volantis blacksmith to re-forge it. He wants Jaime to be his heir and return home to Casterly Rock, but Jaime insists on remaining in the Kingsguard. Furious at Jaime's disobedience and lack of ambition, Tywin rebuffs him. He tells Jaime to keep the sword anyway. \nTyrion Lannister, Bronn, and Podrick Payne wait on a road outside the city for the arrival of Prince Doran Martell of Dorne, who has been invited to the royal wedding. Tyrion quizzes Bronn on the sigils of the Dornish houses, none of which he knows, however Podrick answers perfectly. Lord Blackmont approaches them on horseback and says Prince Doran is in poor health and remained at Sunspear. Doran's brother, Prince Oberyn, will be attending the wedding in his stead, and arrived before dawn. Assigning the reception of the Dornish Lords to the City Watch, Tyrion says they should find Oberyn as soon as possible \"before he kills somebody or several somebodies\".\nPrince Oberyn and his bastard paramour Ellaria Sand are examining prostitutes in a brothel owned by Petyr Baelish, but currently managed by Olyvar, as Lord Baelish is now in the Vale. They choose the contortionist Marei, and Oberyn orders Olyvar to get undressed also. Oberyn is infuriated when he hears men singing The Rains of Castamere. He confronts the two Lannister soldiers, who insult him and Ellaria. Oberyn moves closer and chastises them for being \"pink little men who are far too slow on the draw\" rather than being \"golden lions\". One of the soldiers reaches for his sword, and Oberyn quickly stabs him through the wrist with a dagger and tells the other that his friend will only live if he immediately gets help. Tyrion and Bronn enter, and Oberyn and Tyrion step outside to speak privately. Oberyn says he wants revenge for the murder of his niece Rhaenys, his nephew Aegon, and the rape and murder of his sister Elia in the sack of King's Landing by Lannister troops during Robert's Rebellion. He wants Gregor Clegane, who murdered Elia, and Tywin, whom Oberyn believes gave the order for Elia and her children to be killed.\nTyrion, Sansa, Shae, and another handmaiden are sitting in a garden. Sansa is still distraught over the deaths of her brother and mother. Tyrion attempts to console his wife but fails; Sansa has heard the gruesome details of the Red Wedding, how the corpses of her mother and brother were desecrated. Sansa then leaves for the godswood, not to pray but because it is the only place no one talks to her. Tyrion returns and finds Shae in his bed. He scolds her because no one can find out about their relationship. She attempts to seduce him but he resists. She accuses him of trying to bribe her with diamonds and ship her away to the Free Cities, but he doesn't know what she's talking about (Varys did this acting alone). She angrily leaves the room but is spotted by the handmaiden, who is hiding behind a pillar.\nJaime, Cersei, and Qyburn are in Cersei's chambers. Cersei has had a golden prosthetic hand made for Jaime, and Qyburn attaches it to Jaime's stump. Qyburn asks Cersei about her symptoms, and she says they are gone. After Qyburn departs, Jaime tells her that he will stay in the Kingsguard with one hand so he can stay close to her, then tries to kiss her, but she turns away, much to Jaime's confusion and anger. Cersei implies that she has taken other lovers and that their relationship has changed because of his lengthy absence, a statement that clearly wounds Jaime. The handmaiden suddenly enters and says she has important information for Cersei.\nAs preparations for the royal wedding continue, Margaery Tyrell and her grandmother Olenna are interrupted by Brienne of Tarth, (Olenna being delighted to see the truth of the rumors about Brienne) who requests a private word with Margaery. Brienne tells Margaery the truth of Renly's death and vows to one day exact revenge on Stannis Baratheon, whom she holds responsible. They walk past a statue of King Joffrey standing over a dead direwolf, commemorating the victory over the northern rebellion.\nElsewhere in the Red Keep, Jaime, Ser Meryn Trant and King Joffrey discuss security at the upcoming wedding. Jaime is clearly irked by Joffrey's arrogance as well as Meryn's sycophantic agreement with the king's bragging that he is responsible for keeping the people fed (Jaime notes that this is more the doing of the Tyrells) and claiming he singlehandedly won the war. Jaime (who had previously noted to his father that thousands in King's Landing alone still want Joffrey dead) points out that the war is far from won; Stannis is still alive and will probably raise fresh armies. Dismissive of the threat posed by Stannis following the Battle of the Blackwater, Joffrey leafs through the Book of Brothers, which details the history of the Kingsguard and those who served in it. He reads Jaime's brief entry and sneers that someone must have forgotten to record all of his uncle's great deeds. He also questions Jaime's ability to serve in the Kingsguard with one hand. Jaime defensively quips that using his left hand makes for more of a challenge.\nAs Sansa prays alone in the godswood, she is watched by Jaime and Brienne; Brienne expects Jaime to uphold his oath to return Catelyn Stark's daughters in return for his freedom, but Jaime counters by pointing out the situation is complicated by Catelyn's death and Sansa's marriage to Tyrion. As Sansa is leaving the godswood, she is approached by Dontos Hollard, who thanks her for convincing Joffrey to spare his life and gives her what he claims to be his mother's necklace as a token of gratitude.\n\nI"},{"location":"In the North","content":"Ygritte and Tormund stand outside a stone ravine. Tormund chides her for failing to finish off Jon Snow. Suddenly, their scouts signal that someone is approaching. Styr and a band of Thenn approach them through the ravine. Out of earshot, Tormund comments about how much he hates Thenns. Styr says his party raided a village south of the ravine and gathered meat. He says the meat tastes so much better south of the Wall, and chides Tormund for losing their warg as well as Jon. He reminds Tormund how the Night's Watch are feasting and getting fat at Castle Black. Styr suggests that Tormund taste crow meat before he dies, as a human arm roasts over a fire.\n\nA"},{"location":"At the Wall","content":"At Castle Black, Jon Snow has survived the injuries inflicted by Ygritte and has largely recovered, though he still grimaces while getting dressed and walks with a slight limp. Having been told of Robb's death, Jon shares with Samwell Tarly that he had always been jealous of Robb for having more of their father's affection and for being better than him at riding and fighting, and with girls. Despite all this, he says he could never bring himself to hate Robb. Sam responds by saying he has felt the same way about Jon, that Jon is better than him at everything (except reading). \nIt turns out that Sam had been sent to retrieve Jon, who has been summoned to testify before a panel of five sworn brothers, including Maester Aemon, acting Lord Commander Alliser Thorne, First Builder Othell Yarwyck, and the exiled former Lord Commander of the King's Landing City Watch, Janos Slynt. Both Thorne and Slynt are openly hostile to Jon, disbelieving much of what he says. At the hearing, Jon admits to killing Qhorin Halfhand but says that it was not murder, rather Qhorin wanted Jon to kill him to give Jon credibility with the wildlings in order to get a spy into Mance's army. Slynt dismisses Jon as \"the bastard son of a traitor\" while Thorne, a friend of Qhorin's, reacts with incredulity that Jon would presume to act like he knew the Halfhand. Jon responds by saying that Thorne should know that Qhorin would have done anything to protect the Night's Watch.\nWhen Jon refers to the wildlings as \"Free Folk,\" Slynt accuses him of going native, to the extent he even talks like them. Jon snaps back, acknowledging that he talks like a wildling and also admits to living amongst the wildlings, eating with them, and climbing the Wall with them. He catches himself before admitting that he lay with one, but says it anyway. Slynt calls for Jon's execution for breaking one of his vows. Aemon points out the impracticality of executing every ranger who lays with a girl and says that \"the Wall would be manned by headless men.\" Thorne says that there is a difference between sneaking off to a brothel and sleeping with the enemy.\nJon does not defend himself at this point. Instead, he says that Mance Rayder intends to attack the Night's Watch with his army of 100,000 wildlings and gives intelligence on Mance's plan of attack. Both Thorne and Slynt disbelieve what Jon has to say. Aemon, however, realizes that Jon is speaking the truth, and the hearing ends with Jon being allowed to keep his head, although after Jon leaves, Thorne expresses his distrust for Jon.\n\nI"},{"location":"In the Riverlands","content":"Arya Stark and the \"Hound\" Sandor Clegane are still traveling through the Riverlands on a single horse. They pass by overturned carts and dead bodies, including those of children. Arya asks when she is going to get her own horse, complaining of the Hound's stench. He scoffs at the idea, noting that horses are hard to come by and that he wouldn't give Arya her own horse (even if one was available) as she is the only thing of value he has since he did not take anything of value when he left King's Landing. Arya assures him she has no plans to run off, saying that she would die by nightfall without him as she has no one to go to. The Hound reminds her that she still has an aunt in the Vale, Lysa Arryn, to whom he plans to ransom Arya.\nThe two eventually come upon a tavern. Both hungry, Arya suggests that they attack the men there, to which the Hound expresses reluctance as there are five men. Just then, two men exit to relieve themselves. Arya recognizes one of them as Polliver, the Lannister man-at-arms who had previously taken Arya's sword Needle and killed her friend Lommy. She also notices that Polliver still has Needle and runs off to get it back. The Hound chases after her, stopping her at the tavern's door, but they are seen and choose to go in anyways.\nIt is clear that Polliver and the other men are making trouble and intend to rape the tavern owner's daughter. Arya and the Hound go to a table far away from everyone else, but Polliver still recognizes the Hound and walks over to their table and strikes up a conversation. He does not recognize Arya, who he thinks is just the Hound's latest sexual conquest. Polliver implies that he and his men intend to rape and pillage on their way back to King's Landing and invites the Hound to come along. Polliver says that he and his men wear the King's colors and can do whatever they like, to which the Hound leans forward and states emphatically, \"Fuck the King.\"\nThe conversation then becomes tense and turns into a standoff. They eventually draw their swords. At first, the Hound fights the five men alone while Arya stands in the corner. He easily dispatches two of them and fights off the rest, stabbing one in the groin. Another, however, gets him on the ground, holding a dagger to his throat. The Hound is able to fight him off, stabbing him repeatedly in the head with his own dagger.\nArya then joins the fray, smashing a pot over the head of one of the men and stabbing him with his own long sword. She then slashes Polliver's leg from behind, causing him to fall to the ground. Arya takes Needle from Polliver and stands over his prone form. She echoes what he had said to Lommy just before he killed him, though Polliver still doesn't recognize her and has no idea what she is talking about. Arya then repeats what he had said to her when he took Needle: \"Fine little blade. Maybe I'll pick my teeth with it.\" It is at that point when Polliver recognizes her and becomes frightened. Arya then kills Polliver in the same way he had killed Lommy by driving Needle slowly into his throat. Arya and the Hound then leave the tavern, taking with them a horse for Arya and a chicken the Hound wanted.\n\nA"},{"location":"Across the Narrow Sea","content":"Daenerys Targaryen sits near the sea with her three dragons, each one about the size of a small horse. Daenerys strokes Drogon's head, while Rhaegal and Viserion fight over a dead lamb, Drogon joins the fight. As Daenerys tries to calm him down, without warning, Drogon snaps at her with a hiss, a warning to not interfere. He then roars and goes to contest the kill.\n\n    Drogon snarls a warning at his mother.  \nThis act, that her own children would threaten her, and that they are outgrowing her influence and ability to rein them, leaves Daenerys visibly shaken. Jorah Mormont approaches and tells her that dragons can never be tamed, not even by their mother.\nDaenerys returns to her Unsullied army to resume the march to Meereen. She notices Grey Worm and Daario Naharis are absent and sets out to find them after being told they are \"gambling\". She finds the two men sitting face-to-face holding their swords in front of them; they have been contesting their strength since midnight. Daario explains they are deciding on which of them will ride up front with her in the vanguard. Frustrated, Daenerys states that the honor goes to Ser Jorah and Ser Barristan as they did not keep her waiting all morning. She orders the two men to ride at the back with the livestock. Daenerys also adds that the last man holding his sword shall find a new queen to fight for and both men immediately drop their weapons.\nOn the road to Meereen, Daenerys speaks with Missandei, who tells her queen that Meereen would be wise to fear her approach. Daario meets them on the cliff side, and Daenerys expresses her annoyance when he shows her flowers he has picked. He reveals that the flowers represent a portrait of the landscape, and serve various purposes, chiefly that knowing her surroundings is important to Daenerys' strategy.\nThe marching army halts, and Daenerys goes to the forefront, discovering a slave child crucified upon a cross. The child is dead, her hand pointing the way to Meereen, and Ser Jorah tells Daenerys there is one for each mile to the last of the great slave cities, 163 in total. Ser Barristan offers to have outriders go ahead to bury them, but Daenerys refuses, ordering that each of them be buried, and their collars removed, but not before she has looked upon each and every face."}],"firsts":["Prince Oberyn Martell","Ellaria Sand","Morgan","Lord Blackmont","Lord Dagos Manwoody","Ser Deziel Dalt","Ser Endrew Tarth","Styr, Magnar of Thenn","A Thenn Warg","Lowell"],"deaths":["Lowell, killed by Sandor Clegane","Polliver, stabbed by Arya Stark"],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Nikolaj Coster-Waldau","character":"Ser Jaime Lannister"},{"actor":"Lena Headey","character":"Queen Cersei Lannister"},{"actor":"Emilia Clarke","character":"Queen Daenerys Targaryen"},{"actor":"Kit Harington","character":"Jon Snow"},{"actor":"Charles Dance","character":"Lord Tywin Lannister"},{"actor":"Natalie Dormer","character":"Lady Margaery Tyrell"},{"actor":"Jack Gleeson","character":"King Joffrey Baratheon"},{"actor":"Sophie Turner","character":"Princess Sansa Stark"},{"actor":"Maisie Williams","character":"Princess Arya Stark"},{"actor":"John Bradley","character":"Samwell Tarly"},{"actor":"Rose Leslie","character":"Ygritte"},{"actor":"Kristofer Hivju","character":"Tormund Giantsbane"},{"actor":"Rory McCann","character":"Sandor Clegane"},{"actor":"Gwendoline Christie","character":"Brienne of Tarth"},{"actor":"Jerome Flynn","character":"Ser Bronn of the Blackwater"},{"actor":"Sibel Kekilli","character":"Shae"},{"actor":"with Iain Glen","character":"Ser Jorah Mormont"},{"actor":"Diana Rigg","character":"Lady Olenna Tyrell"},{"actor":"Pedro Pascal","character":"Prince Oberyn Martell"},{"actor":"Indira Varma","character":"Ellaria Sand"},{"actor":"Michiel Huisman","character":"Daario Naharis"},{"actor":"Ian McElhinney","character":"Ser Barristan Selmy"},{"actor":"Peter Vaughan","character":"Maester Aemon"},{"actor":"Owen Teale","character":"Ser Alliser Thorne"},{"actor":"Anton Lesser","character":"Qyburn"},{"actor":"Yuri Kolokolnikov","character":"Styr, the Magnar of Thenn"},{"actor":"Jacob Anderson","character":"Grey Worm"},{"actor":"Nathalie Emmanuel","character":"Missandei"},{"actor":"Dominic Carter","character":"Lord Janos Slynt"},{"actor":"Daniel Portman","character":"Podrick Payne"},{"actor":"Ian Beattie","character":"Ser Meryn Trant"},{"actor":"Tony Way","character":"Dontos Hollard"},{"actor":"Will Tudor","character":"Olyvar"},{"actor":"Andy Kellegher","character":"Polliver"},{"actor":"Chris Reilly","character":"Morgan"},{"actor":"Stuart Martin","character":"Morgan's friend"},{"actor":"Joseph Gatt","character":"a Thenn warg"},{"actor":"Martin Walsh","character":"an Innkeeper"},{"actor":"Daniel Rabin","character":"Lord Blackmont"},{"actor":"Brian Fortune","character":"Othell Yarwyck"},{"actor":"Dez McMahon","character":"Ser Endrew Tarth"},{"actor":"Sara Dylan","character":"a Handmaiden"},{"actor":"Josephine Gillan","character":"Marei"},{"actor":"Tommy Dunne","character":"the Valyrian sword smith"},{"actor":"Gabrielle Dempsey","character":"Innkeeper's daughter"},{"actor":"Maria Sikavica","character":"a Whore"}]}
