{"title":"The Climb","season":"3","episode":"6","date":"Sun May 05 2013","authors":["David Benioff","D.B. Weiss"],"directors":["Alik Sakharov"],"info":"\"The Climb\" is the sixth episode of the third season of Game of Thrones. It is the twenty-sixth episode of the series overall. It premiered on May 5, 2013. It was written by executive producers David Benioff & D.B. Weiss and directed by Alik Sakharov.","plot":"Tywin plans strategic unions for the Lannisters. Melisandre pays a visit to the Riverlands. Robb weighs a compromise to repair his alliance with House Frey. Roose Bolton decides what to do with Jaime Lannister. Jon, Ygritte and the Wildlings face a daunting climb.","summary":[{"location":"In the Seven Kingdoms","content":"In King's Landing, Lord Tywin Lannister meets with Lady Olenna Tyrell to discuss having Ser Loras marry his daughter, Cersei. They trade barbs about Cersei's age, Cersei's capability to have more children, and accusations of incest with Jaime, as well as Loras's well-known homosexuality. Tywin is adamant that Cersei, whom he calls the Kingdom's most beautiful woman, should marry Loras, the Kingdom's most handsome and desired bachelor, but Olenna blatantly refuses to consent, hinting that Joffrey is the result of incest. Tywin replies that if that is true, he has no right to the throne and the Tyrells just \"threw a flower into the dirt\". Olenna says she will not risk \"throwing another flower into the dirt\" if Cersei cannot bear heirs for the Tyrells. Realizing her unchanged position on the matter, Tywin threatens to make Loras a knight of the Kingsguard, which would force Loras to give up his right to marriage and to inherit Highgarden. Olenna relents, and consents to the marriage of Loras and Cersei.\nIn the gardens, Sansa Stark tries to get closer to Loras by discussing their hopefully impending wedding. Loras is clearly uncomfortable being so close to her, but brightens when discussing the lavish wedding he's had planned – although Sansa, for once, becomes suspicious when she realizes that Loras seems more excited by the food and the wedding joust than by her. Loras quickly placates her with a compliment and then describes the wedding gown he's envisioned for her. Sansa says she's looking forward to seeing Highgarden, as she's only ever lived in Winterfell and can't wait to leave King's Landing. In this, Loras finds unexpected common ground with her and agrees that the Red Keep is \"the most terrible place there is\".\nCersei and Tyrion Lannister observe the couple from Cersei's chambers overlooking the garden. Tyrion sarcastically asks which of the four of them has it the worst. He then finally accuses his sister of trying to have him killed during the Battle of the Blackwater. Cersei, tired of fighting him, remains quiet while he deduces that only two people can command the Kingsguard. Tyrion realizes that while Cersei certainly has the authority to command a Kingsguard, she isn't stupid enough to command Ser Mandon Moore to kill him in public. Tyrion realizes that it was in fact Joffrey who ordered Ser Mandon Moore to kill him, because Tyrion was the only one who stood up to him. Cersei tells him his life is not in danger from Joffrey, as he dare not try anything like that now that Tywin is the Hand. They discuss about Jaime's possible return to King's Landing, with Cersei wondering where he could possibly be. She asks Tyrion which one of them should be the one to break the news to Sansa.\nTyrion decides he might as well dash Sansa's hopes sooner rather than later. He goes to Sansa's chamber and asks for a private word, but Sansa declines to dismiss Shae. Tyrion gives Shae a carefully coded apology for not telling her in private before breaking the news to Sansa.\nLater on, Lord Varys finds Lord Petyr Baelish in the throne room. Varys and Baelish discuss the Iron Throne and the pageantry and propaganda that creates nations and cements dynasties. Varys asserts that he serves the realm, but Baelish scoffs that \"the realm\" is an invention of Aegon the Conqueror. Baelish tells Varys that he is aware of Varys' arrangement with Ros, and that he has given her to \"a friend\" who is eager for a new experience. Baelish revels in the chaos that he has caused, likening chaos to a ladder (for those brave enough to climb) rather than a pit to be lost in, as Varys and everyone else sees it.\n\n    Joffrey kills Ros  \nElsewhere, Sansa weeps as Baelish's ship departs, both of her plans to leave King's Landing in tatters. Meanwhile, Joffrey coldly contemplates Ros's quarrel-ridden corpse.\n\nIn the Riverlands, the hideout of the Brotherhood without Banners outside of Hollow Hill, Anguy trains Arya Stark with a bow.     Anguy teaching Arya how to shoot a bow better.   Arya spots someone behind her target, which is revealed to be Melisandre and a small group of Stannis Baratheon's men. She speaks to Thoros in High Valyrian, demanding to know what became of his mission to convert Robert Baratheon to the worship of the Lord of Light. He bluntly tells her he failed. Melisandre is brought to the Brotherhood's hideout and is shocked when she learns of the six deaths of Beric Dondarrion, exclaiming that Thoros should not have that kind of power. Thoros counters that he has no power, he only asks for favors and the Lord of Light sees fit to grant them. The priestess seems troubled by his response (or perhaps by the fact that the Lord of Light looks favorably on causes other than her own). Melisandre says the Brotherhood has someone the Lord of Light needs, and soon after has her men take Gendry into her custody. Arya protests, particularly when she sees that Melisandre has given the Brotherhood two heavy sacks of gold in exchange. She confronts the red priestess, calling her a witch. Melisandre ignores the barb and looks into Arya's eyes. She sees many other eyes, of many other colors- eyes that Arya will shut forever. Melisandre abruptly tells her that they will meet again.\n    Edmure is enraged at having to marry Roslin  \nAt Riverrun, King Robb Stark and his advisors meet with \"Black Walder\" and Lothar Frey to discuss an alliance for his planned attack on Casterly Rock. The Freys carry Walder Frey's demands for an alliance, which includes a formal apology from Robb, the castle Harrenhal and all of its lands and incomes, and for Edmure Tully to marry Roslin, one of his daughters. Edmure is reluctant to marry a woman he has never met, but is eventually convinced by the group to go through with the arrangement.\n\n    Jaime and Bolton discuss Jaime's release.  \nAt Harrenhal, Lord Roose Bolton has dinner with Jaime and Brienne of Tarth. Bolton tells Jaime he will send him to King's Landing as restitution for his lost hand but only on the condition that Jaime swear to tell his father that Bolton was not personally responsible for maiming him. Jaime assumes that Brienne will accompany him, but Bolton intends to keep her with him, under arrest for abetting treason.\nIn the North, tensions rise at camp between Osha and Meera Reed before Bran Stark diffuses the situation. Jojen Reed experiences a seizure while sleeping, and Meera explains they are caused by his visions. Jojen then tells Bran that in his vision he saw Jon Snow with the wildlings.\n\n    Theon is tortured  Elsewhere, the cleaning boy awakens Theon Greyjoy to continue torturing him. The boy threatens to remove Theon's pinky finger if he cannot guess the boy's true identity and their current location. He gives the impression that Theon guessed right when Theon says he is the younger brother of Torrhen Karstark, Rickard Karstark's son, and that they are in Karhold. But then, the boy tells Theon he was lying, and begins flaying Theon's finger while telling him that he is torturing Theon only for his own amusement. \nB"},{"location":"Beyond the Wall","content":"Samwell Tarly and Gilly stop to camp during their journey to The Wall after having fled Craster's Keep. Sam shows Gilly the Dragonglass dagger he found at the Fist of the First Men and tells her about Castle Black.\n\n    Jon and Ygritte kissing on the top of the wall  \nAt camp at the base of the Wall, the wildling party led by Tormund Giantsbane prepare to climb. Jon Snow and Ygritte talk about their impending climb and their relationship. Ygritte reveals she is aware that Jon is still loyal to the Night's Watch, but tells him he must be loyal to each other instead. While climbing, Ygritte strikes the Wall and causes a massive crack, which dislodges a large sheet of ice, sending several wildlings to their deaths. Ygritte and Jon hang precariously by their safety rope. Orell decides that Tormund cannot continue climbing with the weight of Jon and Ygritte's bodies pulling them down and begins cutting the rope. Jon sees what Orell is doing and barely manages to swing to his left and plant a hook in the ice, saving himself and Ygritte. They reach the top of the wall, and Ygritte is awed by the view beyond the wall and to the south, before she and Jon share a passionate kiss."}],"firsts":["Lothar Frey","Black Walder Rivers"],"deaths":["Ros, shot multiple times with a crossbow by Joffrey Baratheon"],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Nikolaj Coster-Waldau","character":"Ser Jaime Lannister"},{"actor":"Lena Headey","character":"Queen Cersei Lannister"},{"actor":"Kit Harington","character":"Jon Snow"},{"actor":"Richard Madden","character":"King Robb Stark"},{"actor":"Michelle Fairley","character":"Lady Catelyn Stark"},{"actor":"Aidan Gillen","character":"Lord Petyr Baelish"},{"actor":"Charles Dance","character":"Lord Tywin Lannister"},{"actor":"Carice van Houten","character":"Lady Melisandre"},{"actor":"Alfie Allen","character":"Prince Theon Greyjoy"},{"actor":"Isaac Hempstead-Wright","character":"Prince Bran Stark"},{"actor":"Sophie Turner","character":"Princess Sansa Stark"},{"actor":"Maisie Williams","character":"Princess Arya Stark"},{"actor":"John Bradley","character":"Samwell Tarly"},{"actor":"Joe Dempsie","character":"Gendry"},{"actor":"Jack Gleeson","character":"King Joffrey Baratheon"},{"actor":"Rose Leslie","character":"Ygritte"},{"actor":"Conleth Hill","character":"Lord Varys"},{"actor":"Sibel Kekilli","character":"Shae"},{"actor":"Diana Rigg","character":"Lady Olenna Tyrell"},{"actor":"Gwendoline Christie","character":"Brienne of Tarth"},{"actor":"Michael McElhatton","character":"Lord Roose Bolton"},{"actor":"Paul Kaye","character":"Thoros of Myr"},{"actor":"Richard Dormer","character":"Lord Beric Dondarrion"},{"actor":"Mackenzie Crook","character":"Orell"},{"actor":"Natalia Tena","character":"Osha"},{"actor":"Clive Russell","character":"Ser Brynden Tully"},{"actor":"Tobias Menzies","character":"Lord Edmure Tully"},{"actor":"Kristofer Hivju","character":"Tormund Giantsbane"},{"actor":"Iwan Rheon","character":"Ramsay Snow"},{"actor":"Hannah Murray","character":"Gilly"},{"actor":"Finn Jones","character":"Ser Loras Tyrell"},{"actor":"Thomas Brodie Sangster","character":"Jojen Reed"},{"actor":"Ellie Kendrick","character":"Meera Reed"},{"actor":"Esme Bianco","character":"Ros"},{"actor":"Philip McGinley","character":"Anguy"},{"actor":"Kristian Nairn","character":"Hodor"},{"actor":"Tom Brooke","character":"Lothar Frey"},{"actor":"Tim Plester","character":"Black Walder Rivers"},{"actor":"Sara Dylan","character":"a Handmaiden"},{"actor":"Art Parkinson","character":"Prince Rickon Stark"},{"actor":"Jamie Michie","character":"Steelshanks"},{"actor":"Tyrone Kearns","character":"Brotherhood Member"}]}
