{"title":"Kissed by Fire","season":"3","episode":"5","date":"Sun Apr 28 2013","authors":["Bryan Cogman"],"directors":["Alex Graves"],"info":"\"Kissed by Fire\" is the fifth episode of the third season of Game of Thrones. It is the twenty-fifth episode of the series overall. It premiered on April 28, 2013. It was written by story editor Bryan Cogman and directed by Alex Graves.","plot":"The Hound is judged by the gods; Jaime is judged; Jon proves himself; Robb is betrayed; Tyrion learns the cost of weddings.","summary":[{"location":"Beyond the Wall","content":"Tormund warns Jon.  Jon Snow is with the group of twenty wildlings under the command of Tormund, who were sent ahead of the main army of King-Beyond-the-Wall Mance Rayder to scale the Wall and attack Castle Black from behind. Jon and Ygritte are gathering firewood, when the warg Orell asks him about the defenses of the Night's Watch. Orell has seen through the eyes of his eagle that there are patrols on top of the Wall and he wants to know how frequent they are. Jon says they usually sent out patrols in teams of four, two builders to inspect for structural damage and two rangers to protect them, but that the frequency of their patrols often changes. Orell says the wildlings know there are nineteen castles along the south side of the Wall, but he wants to know how many are currently manned. Jon finds this very unpleasant, but reluctantly says that only three are currently manned. Apart from Castle Black (which even the wildlings know is manned), there is also Eastwatch-by-the-Sea at the extreme eastern end, and The Shadow Tower at the western end. Jon is then asked how many men currently garrison Castle Black. Jon is very reluctant to answer, but after being threatened by Orell, he gives an exaggerated number, saying there are one thousand men (this is a lie, as Castle Black only had six hundred men before the Great Ranging, and the garrison now is closer to three hundred). Tormund tells Jon that he likes him, but if he's lying to them, he'll rip his guts out through his throat.\n    Ygritte is caught off-guard when Jon begins performing oral sex on her.  \nJon and Ygritte then walk away, but she steals his sword Longclaw, making him chase her to get it back. She leads him into a nearby cave, which is heated by natural hotsprings, which form a waterfall and a pool. Ygritte starts disrobing, and says that she wants to make sure Jon Snow has truly come over to the wildlings' side and broken his Night's Watch vows - by making him break his oath of celibacy with her. She quickly shucks off all of her clothes and walks up to him naked. Jon is very hesitant to break his vows, and very shy because he's never had sex before. Ygritte questions why he's still dressed, and they start kissing. Jon continues to kiss down her body as she insists that he has no experience and therefore \"You know nothing, Jon Sn--\" but stops mid-word as Jon starts performing oral sex on her.\n\n    Jon and Ygritte taking a bath after sex.  Some time after they finish having sex, they lie together in a naked embrace. Ygritte asks if \"that thing you did with your mouth\" is what Lords do to their Ladies in the south, but Jon says she just seemed to like it when he kissed her there. He admits he's never had sex with anyone before and is \"a maid\", though Ygritte starts listing off some wildling boys she's had sex with before. The first was a boy who also had red hair like her, which is rare among the wildlings and considered very lucky: they call having red hair being \"kissed by fire\", and another was a Thenn that was \"built like an ox\", but he could not speak the Common Tongue. Jon and Ygritte then slide into the hot springs pool to take a bath together and romantically cuddle more. Ygritte tells Jon she wishes they could stay in this cave forever (instead of having to leave and face the winter, wars, and monsters outside).\nA"},{"location":"Across the Narrow Sea","content":"In Slaver's Bay, Daenerys Targaryen's new army of freed Unsullied, having just sacked Astapor, head north to the next of the three great slaver-cities, Yunkai. Ser Jorah Mormont tells Ser Barristan Selmy how he was knighted at the end of the Greyjoy Rebellion, in which they both fought. Jorah explains that he was the second man through the breach during the Siege of Pyke, right behind Thoros of Myr, who charged in headlong waving about his flaming sword. Barristan thinks this is amusing as he wasn't there (he was commanding the Siege of Old Wyk at the time). King Robert Baratheon himself knighted Jorah for his bravery that day, the proudest of Jorah's life, though he says what he was most thinking about was that he really needed to piss because he'd been sealed in metal plate armor for sixteen hours straight.\nBarristan admits that Robert was a good man and a good warrior, but laments that he turned out to be a terrible king. Barristan laments that he wasted so much of his life defending kings who didn't deserve it; seventeen years defending Robert, and the Mad King Aerys Targaryen before that. Barristan explains that a man of honor must keep his vows no matter what, whether he's serving a drunk or a lunatic (the reason why he never turned on King Aerys the way Jaime Lannister ultimately did). Barristan says that just once before he dies, he wants to know what it's like to serve with pride, fighting for someone he believes in.\nTheir talk turns to Daenerys, and Jorah says that Barristan can believe in her. Barristan says she'll have good men to advise her, though he respectfully warns that it might not be well for her to be seen with Jorah at her side when they return to Westeros; Jorah admits that he may never be rid of the moral taint of selling slaves, which is abhorred in Westeros. Jorah then begins to subtly ask about the advisors on the Small Council, if any of them spoke against Robert when he wanted Daenerys, the last Targaryen, assassinated. It becomes apparent that Jorah is trying to figure out if Barristan knew that Jorah was initially a spy for King Robert, reporting back to Varys. Jorah's report that Daenerys was pregnant is what made Robert demand that Daenerys be assassinated at a Small Council meeting with Ned Stark. Jorah points out that the Lord Commander of the Kingsguard traditionally holds a seat on the Small Council. However, Barristan explains that as a former Kingsguard member under Aerys Targaryen, and one who'd killed several of Robert's friends, while Robert didn't mind keeping him in his position as a guard, he never really trusted his advice, so he left him out of Small Council meetings. Jorah is relieved that Barristan was therefore not present at any council meeting so he couldn't have learned that Jorah was sending it reports on Daenerys. Jorah and Barristan briefly bicker about the fact that Barristan only just came to them, while Jorah was defending Daenerys from Robert Baratheon's assassins for months, and Barristan isn't Lord Commander here; Jorah takes his orders from Daenerys.\nMeanwhile, Daenerys and her translator/aide-de-camp Missandei meet with the assembled officers of the Unsullied. She addresses them in Low Valyrian, and says that now that they are no longer slaves but free men and they can make their own choices, and she asked them to choose one among them to be leader of all the Unsullied. They part ranks and one of the eunuchs steps forward. She asks him to remove his helmet and tell her his name, and he introduces himself as \"Grey Worm\". Daenerys is confused, and Missandei explains that when the slavemasters of Astapor castrate slave-boys to train them as Unsullied, they force new slave-names onto them which are intentionally demeaning, usually a combination of a color and a kind of vermin, i.e. \"Grey Worm\", \"Red Flea\", \"Black Rat\", etc. This is to enforce the mentality in the Unsullied that this is just what they are: worthless, expendable vermin. Disgusted, Daenerys issues the command that all Unsullied must choose their own new names as free men, or reclaim the names their parents gave them. The Unsullied commander says that he will continue to be known as \"Grey Worm\": his original name is accursed, because it was the name he had when he was taken as a slave, but \"Grey Worm\" is a lucky name he will bear with pride, because it is the name he had when he was set free by Daenerys Stormborn of House Targaryen. Daenerys is deeply touched by his loyalty.\n\nI"},{"location":"In the Seven Kingdoms","content":"At Riverrun, the prisoners Martyn and Willem Lannister (squires fifteen and fourteen years old, respectively) awake to hear shouting and fighting outside the door to their cell. Lord Rickard Karstark fights his way into the room with some of his own men. Confused, Willem asks if this is a rescue, and is promptly killed by the Karstark men. Martyn begs that he is just a squire and didn't do anything, but Lord Rickard ignores his pleas and stabs him in the belly with a dagger, killing him. \n\n    Martyn and Willem lie dead before Robb.  \nThe bloody corpses of the two Lannister prisoners are laid out on the floor in front of King in the North Robb Stark in Riverrun's main meeting room. Robb is disgusted, remarking that Karstark needed five men to brutally murder two unarmed squires in their own prison cell. Karstark insists that it was a father's vengeance. Robb points out that these boys had nothing to do with the death of Karstark's sons, who were both killed by Jaime Lannister. Rickard explains that he was denied his vengeance when Robb's mother Catelyn set Jaime free in hopes of a prisoner exchange for her daughters in King's Landing. Finally having enough, Karstark did the next best thing, and killed Jaime's kin who they held prisoner. Robb angrily shouts that they were only little boys, and Karstark can't blame Catelyn for his treasonous killing of prisoners of war. Karstark stands firm, and says the only treason is in letting their enemies go, when in war they should be killing them - if Robb's father ever taught him that. Brynden Tully punches Karstark over this remark, but Robb tells him to leave Karstark alone. Karstark has utterly lost faith in Robb, and says that the King in the North will just give him a scolding, though he should probably call him \"the King Who Lost the North\" after he allowed Winterfell to fall. Robb orders all of Karstark's men hanged, and to hang the lookout last so he can watch the others die. Rickard Karstark himself is sent to the dungeons.\nRobb's uncle Edmure Tully insists that if word of this leaves Riverrun, Tywin Lannister will exact heavy reprisals for the deaths of his young nephews. Therefore, he suggests that they just quietly bury the boys, and simply keep silent about their deaths until the war is over. Robb, however, refuses to be a liar: he says he cannot fight a war in the name of justice if he will not serve justice to murderers within his own ranks. All of Robb's advisors tell him this is a bad idea. Catelyn and his wife Talisa warn him that the Karstark soldiers will abandon his cause and return home if he executes their lord, and they are already badly outnumbered. Catelyn says they should keep Lord Rickard hostage, and Edmure agrees, saying that they can just keep him hostage and tell the other Karstarks that no harm will come to him so long as they remain loyal. \n\n    Robb executes Rickard.  \nRobb ignores their pleas, and he has Lord Karstark brought out to the courtyard of Riverrun to be executed during a driving rainstorm. Karstark points out that not only are both of their Houses descended from the First Men, but the Starks and Karstarks are kin (as House Karstark is a cadet branch of House Stark, founded centuries ago by younger son Karlon Stark). Robb says that their blood relationship did not stop Rickard from betraying him and won't stop Robb from executing him now, but Rickard says it isn't meant to: he wants it to haunt Robb until the day he dies. With his last words, Lord Rickard says that Robb will be cursed (as a kinslayer) and that Robb is no king of his. Obedient to the laws of his father Eddard Stark - that the man who passes the sentence must swing the sword - Robb pronounces the sentence of death and personally beheads Lord Rickard.\nRobb's strict adherence to justice makes things turn out just as badly as his advisors said they would: the Karstarks withdraw their soldiers from his army and march for home, resulting in Robb losing almost half of his forces which were stationed at Riverrun. Robb openly admits to Talisa that she was right, and he made a mistake. Robb says Tywin Lannister realizes that he's in such a strong position he doesn't even need to attack the Northerners anymore, he just needs to wait, and let their demoralized forces unravel. When the war began Robb's army was unified around a central purpose, but now they have lost momentum, and his generals are acting like bickering children. Robb shows Talisa a war map of the Seven Kingdoms - depicting Robb's armies concentrated around Riverrun and Harrenhal, Lannister and Tyrell armies overrunning the Stormlands, Lannister/Tyrell armies concentrated in King's Landing, and Greyjoy forces occupying the western coasts of the North. Talisa suggests that he try to take the fight to the Lannisters if they won't come to him, but he explains that this is hopeless. Taking King's Landing would have been difficult to begin with, but now Tywin and the bulk of the main Lannister army, as well as a large Tyrell army, are defending the city. Attacking the capital head-on would be suicide, and Tywin would crush them within a day. Talisa suggests that he lead his army back to the North to repulse the Greyjoys from his homeland and rebuild his powerbase. Robb points out that as soon as all of his tired soldiers are back home, they won't want to leave again - particularly because \"winter is coming,\" and the coming one is expected to be very long, five years or more. The Northerners have been away from their farms fighting in the war, however, so they haven't even begun to collect harvests to set aside as winter stockpiles. Thus if Robb returns to the North, it will be difficult to rally his men to return south to defend the Riverlords who declared for him. Eyeing the map with Talisa, Robb decides that if King's Landing is too strong to attack and he can't return home, his only remaining option is to strike where his enemy is weakest. Robb decides that with the main Lannister army-group under Tywin now positioned all the way to the east in King's Landing, he needs to return to the Westerlands and make an all-or-nothing assault against Casterly Rock. This will make the Lannisters lose face, just as Robb did when he lost his home castle of Winterfell, and bring momentum back to his army. However, with the loss of the Karstark forces, they don't currently have enough men to consider attacking Casterly Rock. The only way they can gain enough soldiers to even attempt such an assault is if Robb can win back the allegiance of House Frey, whose thousands of soldiers withdrew from Robb's army when he broke his promise to make a marriage-alliance with them by marrying Talisa, a political nobody, instead of one of the Lord Walder Frey's daughters. Thus, Robb must try to repair his alliance with House Frey.\n\n    Locke taunting Jaime about his hand.  At Harrenhal, Locke presents the captive Jaime Lannister and Brienne of Tarth to the Northern castellan, Lord Roose Bolton. Locke is quite proud of himself for his torture of Jaime, but Roose is surprised that Jaime has lost his hand. Oblivious, Locke boasts that Jaime hasn't \"lost\" the hand, and points out that he cut it off and hung Jaime's own hand around his neck. Angered that Locke maimed such a valuable hostage, Bolton demands that he dispose of Jaime's rotting hand, and orders that accommodations be provided for the pair of prisoners. When Jaime asks if there is news from the capital, Bolton informs him that Stannis Baratheon laid siege to the city in the Battle of the Blackwater... then needlessly drags out revealing the result. Bolton toys with Jaime but remains completely calm, never even grinning, before finally revealing that his sister Cersei is alive and well, and his father's forces successfully repulsed Stannis's assault. Jaime is so overcome by delirium and relief that his family is safe that he collapses. Bolton calls for Qyburn to attend to Jaime's injuries. Later, Qyburn peels away the crude tourniquet that Locke's men applied to Jaime, and finds that the stump of his right arm has become badly infected. Jaime asks if he will die, and Qyburn says he won't, but the corruption has spread to the point that it would be safest just to amputate the rest of his right arm at the shoulder. Half-delirious from the infection, Jaime refuses, and says he'll kill Qyburn if he tries. Jaime then notices that Qyburn is not a Maester, because he isn't wearing a maester's chain of office. Qyburn acknowledges this, explaining that he was stripped of his chain by the Citadel and thrown out of the Order of Maesters, because as he says, he was conducting experiments which they felt were \"too bold.\" Qyburn gets ready to cut Jaime, and says he'll at least try to save his elbow, but with a sudden burst of effort Jaime grabs him around the throat with his left hand, and says he doesn't need his right hand to kill him. Qyburn relents, and says he could try cutting out the chunks of flesh which are outright rotten, then burning out the wounds with boiling wine, and with luck this might be able to stop the infection without having to amputate more of Jaime's arm above the wrist. Jaime says he's willing to try this, but Qyburn cautions that it will cause a great amount of pain so he needs to give him Milk of the Poppy, but Jaime refuses to take it, and says he'll just scream. Qyburn cautions him that it will cause a massive amount of pain, but Jaime says that he will just scream loudly. Qyburn begins to dig into the stump of Jaime's arm to cut out the gangrenous tissue, and Jaime howls in agony.\nSome time later, Brienne is in Harrenhal's bathhouse, scrubbing off weeks' worth of caked on grime and filth from the trek through the Riverlands. Jaime then appears in the doorway assisted by a servant, barely able to stand due to the pain he is in. He asks the servant to help him take off his muddy rags and leave. Jaime then walks naked into the same communal bath that Brienne is in, on the far side. She is also naked and angrily points out that there are other baths, but he says he wants this one; he's afraid he's going to pass out at any moment, and wants her to save him from drowning if he does, because he doesn't want to be the first Lannister to die in a bathtub. Brienne asks why she should care how he dies, but he points out that she swore a solemn vow to get him to King's Landing in one piece - which (indicating the stump of his hand) has not been going so well. Jaime quips that it's no wonder Renly died with Brienne guarding him, at which she defiantly stands up out of the bath, facing him fully nude, to show him she isn't afraid of him. Jaime gravely says that was \"unworthy\" and asks for forgiveness, Brienne angrily orders him not to mock her, but he insists he's seriously apologizing. Exhausted, Jaime says he's tired of fighting and just wants to have a truce; Brienne says you need trust to have a truce, but he says he trusts her, so she sits back down.\n\n    Jaime recounts Aerys's madness.  Jaime then notes that Brienne has the same look on her face that he's seen on countless faces in the past seventeen years: people that despise him, call him \"kingslayer\" more than his own name, or \"oathbreaker\" and \"a man without honor.\" Jaime then goes on to recall the Mad King's obsession with wildfire, how Aerys enjoyed watching people being burned alive. Jaime recalls Aerys burned lords he didn't like, Hands who failed him, and anyone he thought was against him. Ultimately, half of Westeros rebelled against him, so Aerys had his pyromancers place caches of wildfire all over King's Landing: under the Great Sept of Baelor, under the slums of Flea Bottom, under houses, stables, taverns, and even under the Red Keep itself. After Robert's victory at the Trident he marched on the capital city, but Jaime's father Tywin arrived there first, leading the entire Lannister army, and promising to defend the city. Jaime warned Aerys that his father was never a man to choose the losing side, that this must be a trick and he should surrender the city while he still could, but the Mad King refused to listen. Nor did Aerys listen to Varys when he gave the same warning that Tywin couldn't be trusted - but he did listen to Grand Maester Pycelle, who convinced Aerys the Lannisters were there to help. Aerys opened the city gates, and the Lannisters proceeded to sack the city. Jaime again begged Aerys to surrender, but the Mad King ordered Jaime to bring him Tywin's head, and his pyromancer to set the city ablaze, burning its hundreds of thousands of inhabitants with wildfire. Jaime makes it plain to Brienne that was his breaking point and asks her what she would do if her precious Renly commanded her to kill her own father and then stand by and do nothing as he murdered thousands of innocent people; she can only sit in shocked silence. Jaime goes on to say that he killed the pyromancer first, then drove his sword into Aerys's back as the Mad King tried to run for his life. Shaken at the memory, Jaime speculates that King Aerys didn't believe he would die in the blaze; in his lunacy, the Mad King believed he would be reborn as a dragon in the fire, granting him the power to burn his enemies to ashes... so Jaime finished Aerys off by slitting his throat in order to make sure he died, concluding that Eddard Stark found him at that point.\nStunned, Brienne asks why Jaime didn't defend himself with this account before. Jaime angrily rants that the \"honorable\" Lord Stark would never have believed a word he said: Stark didn't want to hear Jaime's side of the story when he'd already judged him guilty.     Jaime faints.  Jaime goes on to rage, yelling what right Stark had to judge him, by what right the wolf dares to judge the lion. The strain of recounting his harrowing tale overcomes Jaime, however, and he begins to faint, nearly falling face-first into the water. Brienne catches him and calls for help for the Kingslayer, at which (as he slips out of consciousness) he whimpers to himself \"Jaime. My name is Jaime...\"\n    The Hound vs Beric.  \nElsewhere in the Riverlands, at the hideout of the Brotherhood Without Banners in Hollow Hill, Sandor Clegane prepares to fight Beric Dondarrion in a trial by combat. As both men prepare, Thoros of Myr prays to the Lord of Light to judge Sandor for his crimes if he is guilty or give strength to his sword if he is innocent. Before the fight begins, Beric calls upon the Lord of Light to ignite his sword with flame, using only his blood. Due to the Sandor's fear of fire, Beric initially has an advantage against the Hound. Beric even manages to set Sandor's wooden shield on fire, which is strapped so tightly to Sandor's arm that he cannot remove it and is nearly burned himself. Eventually, however, Sandor's raw physical strength and anger (born of terror) overpowers Beric, and with a single downward swipe, cuts right through his flaming sword, his armor, and deep into his shoulder, killing him.\n\n    Thoros reviving Beric.  \nAs Beric falls to the ground, Thoros quickly rushes to his side, and begins praying to the Lord of Light to revive him. Sandor falls to the ground to desperately try and extinguish his flaming shield. Arya Stark grabs a dagger and attempts to kill the Hound while he is down, but she is stopped by Gendry. As she curses him, Sandor taunts Arya over how the god prefers him over her dead friend, however they are both interrupted by Beric, who has been revived by the Lord of Light's power. Having won the trial, and proven his innocence in the eyes of god, Sandor is allowed to leave. The Brotherhood had taken all of the gold Sandor had on him (to fund their cause), and in lieu of returning it, Beric gives him a promissory note which will grant payment at the end of the war. Sandor scoffs at this and throws it to the ground, but Anguy says he should be thankful they're letting him leave with his life. Clegane is hooded so he won't know the way back to their hideout, then led away to be released some distance away.\nAfter the fight, Gendry works on repairing Beric's armor, and Arya questions why, because they will be leaving soon. Gendry says that he has decided to stay and work as a smith for the Brotherhood Without Banners, to aid them in their cause to protect the smallfolk during the war. Arya says that their plan was to find her brother Robb, and Robb needs soldiers too, but Gendry points out that he has no attachments to Robb Stark: Arya would be going to her noble-born family, and he'd just be serving another lord. Gendry says he's been serving other men his whole life and he has nothing to show for it: he worked most of his life for Tobho Mott and he repaid Gendry by selling him to the Night's Watch (as soon as the secret payments from Varys ended), and he \"served\" Tywin Lannister as a prisoner at Harrenhal, every day afraid he'd be killed or tortured. He'd be serving in the Brotherhood too, but they chose Beric as their leader, and they're more like a family - and as a common-born tavern maiden's son who was orphaned at a young age, Gendry has never had a family. Arya sadly chokes out that she could be his family. In response, Gendry politely but firmly points out that the class differences between them mean that if he goes back with her, they'd never be family: he'd still be a commoner, and she'd be \"m'lady.\"\nLater that night, Arya looks into the campfire and recites her nightly prayer-list for the death of her enemies. Thoros says that they plan to bring her to Riverrun to reunite her with her family, and in exchange for a reward from Robb to fund their cause. Arya points out that they are ransoming her, and Thoros admits they technically are, but this is different. They do intend to escort her safely through the war-ravaged countryside to her family, and Beric would like to return her for free out of memory of her father, but they really need the gold to support themselves. Beric says he knows she must be angry with him, but releasing Sandor was the right thing to do, as they'd promised to let him go free if he won the trial by combat. Arya is still quietly upset, as she's now seen many honorable men keep their promises and behave lawfully only to be killed for it (such as Yoren and her own father). She wonders why Beric would want to let Sandor go when he nearly killed him, but Beric insists that he did actually kill him. When Arya asks how, Beric points her to Thoros to explain, but he says that he isn't the one who brings Beric back to life, it's the Lord of Light, and Thoros is just the \"lucky drunk\" who recites the prayers. Beric opens his shirt to reveal several grievous scars on his torso: they explain that Beric has actually died and then been brought back to life six times now, counting his recent death in the trial by combat. He has been impaled on a lance, shot with an arrow, and at his fifth death the Lannisters hanged him for treason and stuck a dagger in his eye (which didn't heal when Thoros brought him back). Arya earnestly asks Thoros if he could bring back to life a man without a head. Thoros and Beric both understand that she is asking about bringing back her father, but Thoros says he doesn't think it works that way (both because he was decapitated, and because he's been dead for far too long by now). Beric consoles her that her father was a good man, but he wouldn't wish his resurrected life on him. Beric explains that being brought back from the dead carries a heavy toll, as pieces of his memory and who he was before chip away each time. Arya still says she would wish Beric's life on her father, because at least Beric is still alive.\n\nAt Dragonstone, King Stannis Baratheon is still deeply depressed after his defeat at the Battle of the Blackwater, and doesn't have the daily support of the Red Priestess Melisandre since she left on what she claimed was an important mission. Most of Stannis' army has been destroyed, and the only reason the Lannisters haven't attacked Dragonstone yet is because so much of their fleet was destroyed at Blackwater that they cannot yet mount an amphibious assault. With little else to do, Stannis takes the time to visit his wife, Queen Selyse (who was born into House Florent), for the first time since returning from the battle. He finds her in her chamber, praying over a fire to the Lord of Light: Selyse is a fanatical believer in the Lord of Light religion, far more so than Stannis, and it was indeed Selyse who first invited Melisandre to Dragonstone. Stannis and Selyse do not have a loving relationship, but she reveres and is in awe of him as her king and the Lord's Chosen. She tells him not to despair despite his defeat, and he will be victorious, but he laments that he used to believe that once. Due to his extreme belief in duty, (unlike his hedonistic brother Robert) Stannis is badly shaken by the fact that he broke his marriage vows to Selyse, when he had sex with Melisandre to create the Shadow-assassin creature that killed Renly. He begins to confess to Selyse that he has sinned and shamed her, but she interrupts him and says Melisandre already told her everything - and that no act done in service of the Lord of Light can be a sin. Indeed, she wept for joy when Melisandre told her of this service she did for the Lord of Light with Stannis, and because the Red Priestess gave him a \"son\" (of sorts) which she never could. Stannis' face is filled with a mix of shock, disgust, and relief. Selyse had three sons with Stannis but they were all stillborn, and she walks over to a corner of her chamber where she keeps their tiny corpses preserved in glass jars. The deaths of her \"sweet boys\" and failure to produce a male heir deeply affected Selyse, and caused her to zealously embrace the foreign religion of the Lord of Light. She weeps, and laments that she has given Stannis nothing - he does not blame her, and with pity he says that's not true. Selyse understands he is referring to their daughter and only child, Princess Shireen Baratheon. She grows annoyed when she realizes he's come to see her too, and says he shouldn't waste time on such distractions, but insists that she is his daughter, and she relents because it is not her place to question her king.    Shireen visits Davos while in the dungeons.  \nShireen is alone in her room drawing and singing a song about life under the sea to herself, and is excited to see her father. She is a cheerful but sickly young girl (about the same age as Arya Stark), with the left side of her face badly scarred and disfigured by the dreaded Greyscale disease. Stannis wanted to see his daughter, but he is awkward in expressing warm emotions to her. She says she heard he was in a battle and asks if he won, and he good-naturedly says no. Shireen is slightly let-down, but asks if the Onion Knight came back as well: Ser Davos Seaworth has been her friend during his service to her father, and he even made her a toy ship. Growing tense over their falling out, Stannis briefly explains that Ser Davos is a traitor and is rotting in the dungeon. Confused, he flatly says she should best put him out of her mind.\nLater that night, Shireen sneaks down to the dungeon of Dragonstone and finds the cell of \"Ser Onion Knight.\" He wakes up and tells her she shouldn't be there, but she explains that the fat guard Bert is on duty, who usually drinks a lot of wine and sleeps through his watch. She asks if it is true that he is a traitor, and he says that it is, as he disobeyed her father. She says she doesn't care, he's her friend. She was worried that he must get bored down in his cell, so she brought him a book to read, about Aegon the Conquer and his dragons - she excitedly points out that the Targaryens built Dragonstone, and Aegon used to live in this very castle. Davos reluctantly explains that it's wasted on him, because he doesn't know how to read. Undaunted, Shireen offers to teach him how to read, by coming down to his cell and reading to him when Bert is on duty. Davos chides her that they can't, but she asks what's the worst the guards could do to them if they find out, lock them in cells? They have a quiet laugh, and Shireen starts to read to Davos An History of Aegon the Conqueror and His Conquest of Westeros.\nIn King's Landing, Queen Regent Cersei Lannister encounters Petyr \"Littlefinger\" Baelish in a courtyard, and tells him she fears that the Tyrells do not have the Lannisters' best interests at heart, but her father won't listen. Therefore, she asks that Littlefinger use his spies to try to find out what they're up to, because he has a good working relationship with them after brokering the Lannister-Tyrell alliance. He agrees, but Cersei warns him that this had better produce more results than when she previously asked him to find Arya Stark, but the girl could not be found.\n\nIn the castle gardens, Sansa Stark and Margaery Tyrell watch her brother Ser Loras spar with his squire. Sansa confidently remarks on his fighting ability, and inquires when she and Loras will wed, as per the Tyrell plot to keep her out of the hands of Baelish and/or the Lannisters. Margaery replies that she will \"plant the seed\" of the idea after she and Joffrey are married. Sansa is skeptical Joffrey will let her go but Margaery is confident he will do it to please her, once she is his wife. After the match, Ser Loras' new squire Olyvar flirts with him, which leads to them having sex back in Loras' chambers. As they finish, Loras mentions that he is engaged to be married... a fact that Olyvar passes on to his real master, Littlefinger, so he can pass the information on to Cersei.    Loras and Olyvar  \nA short time later, Littlefinger meets with Sansa, offering her a place on his ship that will take him from the capital to the Vale of Arryn. Sansa practices lying for a change, and tells him that they should wait until after Joffrey's wedding, primarily because she fears for his safety if the plan fails. A master manipulator, Littlefinger is clearly suspicious of her motives, but doesn't press the matter for the moment. Instead he says he is touched by her concern for his safety, and insists that she call him \"Petyr.\"\nAt the same time, Tyrion Lannister is engaged in a meeting with Lady Olenna Tyrell; with the upcoming royal wedding shaping up to be an extravagant and expensive affair, Tyrion is concerned about the cost. Olenna points out that the Tyrells have done much to supply the city with soldiers and provisions to assist in the war effort, as well as the coming winter. Olenna is bored to discuss financial matters, but quickly lists off specific details of the soldiers and supplies the Tyrells are supplying to aid the crown, demonstrating that Tyrion doesn't need to lecture her about wartime expenses. She insists that the royal wedding must go on as planned, as it will do much to improve the city's morale and keep the people happy, otherwise they will start blaming the Lannisters for the war again. Tyrion cannot outmaneuver Olenna, but in the end she decides on her own that she won't have it said House Tyrell isn't doing its part to help, so she agrees to pay for half the cost of the festivities, for which Tyrion is grateful.\nTyrion heads to the Small Council chamber to report success to his father Tywin, only to find Cersei present as well, much to his annoyance. Tywin explains that the Tyrells are plotting to wed Sansa to Ser Loras and states that he will not allow them to steal \"the key to the north\" out from under him. Tyrion questions how Sansa is the key to the North, given that her older brother is still alive. Tywin explains that the desertion of the Karstarks have cost Robb Stark half his army, and (combined with already being badly outnumbered by the Lannister-Tyrell alliance) his days are now numbered. Theon Greyjoy murdered Robb's younger brothers at Winterfell, which makes Sansa Robb's heir: if he dies, rule of Winterfell and the North goes to her and any man she marries... which Tywin has no intention of letting the Tyrells get their hands on. Tyrion questions if it is wise to offend their allies by refusing the match, but Tywin points out that as a plot against them, the Tyrells' plan is, by definition, a secret, thus the Lannisters can't be said to be \"refusing\" them something which they aren't officially trying to do. He also notes that the Tyrells won't go through with their plan until after Joffrey's wedding, which means they need to act first... namely by finding Sansa another husband.\n\nAfter a moment, Tyrion realizes from the comments of his father and sister that they are talking about him. Tyrion tries to protest, pointing out that Joffrey has made Sansa's life a living hell since the day he had her father executed and to force Tyrion on her after she has finally escaped Joffrey is cruel, even by Tywin's standards. Tywin questions if Tyrion plans to mistreat Sansa and asserts that he is not concerned with the girl's happiness and neither should his son. Tyrion protests that Sansa is a child, but Cersei counters she has flowered and is a woman now who can bear children. Tyrion flatly refuses, but Tywin points out that recently he was complaining that he wasn't rewarded for his actions in the Battle of the Blackwater, and as heiress to the North, Sansa is a far better reward than he could expect, and in any case, it is long past time Tyrion was wed. At this, Tyrion snarls that he was wed, referring to his past marriage to Tysha, asking if his father has forgotten that. Returning his son's hateful glare with one of his own, Tywin retorts that he remembers all too well.    Tywin arranges some marriages.  \nCersei gloats over the matter, but her smug attitude quickly evaporates when her father commands that she will wed Ser Loras instead. Cersei flatly refuses, but Tywin is insistent: the marriages of Cersei and Tyrion will place the North and the Reach firmly in the Lannisters' control. Tywin points out that Cersei is still fertile: she needs to marry and \"breed.\" When Cersei protests she is Queen Regent and not a brood mare, Tywin angrily roars back that she is his daughter and will do as she is told: she will marry Loras and in so doing, put an end to what Tywin calls \"the disgusting rumors\" Stannis has been spreading about her and Jaime. Cersei switches to earnestly begging him, calling him \"father\" and pleading that he not force her into an arranged marriage a second time (after her long and loveless marriage with King Robert). Tywin refuses to listen and storms out in disgust, raging that the pair have disgraced the Lannister name for far too long. Cersei slowly shifts her gaze toward Tyrion to gauge his reaction to her distress but sees he is too glum about his own predicament."}],"firsts":["Karstark lookout","Petyr Baratheon (Deceased)","Tommard Baratheon (Deceased)","Edric Baratheon (Deceased)","Princess Shireen Baratheon","Grey Worm","Olyvar"],"deaths":["Lord Beric Dondarrion, hacked by Sandor Clegane, resurrected minutes later","Willem Lannister, stabbed by Rickard Karstark","Martyn Lannister, stabbed by Rickard Karstark","Karstark lookout, hanged at Robb Stark's command","Lord Rickard Karstark, beheaded by Robb Stark"],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Nikolaj Coster-Waldau","character":"Ser Jaime Lannister"},{"actor":"Lena Headey","character":"Queen Cersei Lannister"},{"actor":"Emilia Clarke","character":"Queen Daenerys Targaryen"},{"actor":"Kit Harington","character":"Jon Snow"},{"actor":"Richard Madden","character":"King Robb Stark"},{"actor":"Iain Glen","character":"Ser Jorah Mormont"},{"actor":"Michelle Fairley","character":"Lady Catelyn Stark"},{"actor":"Aidan Gillen","character":"Lord Petyr Baelish"},{"actor":"Charles Dance","character":"Lord Tywin Lannister"},{"actor":"Liam Cunningham","character":"Ser Davos Seaworth"},{"actor":"Stephen Dillane","character":"King Stannis Baratheon"},{"actor":"Natalie Dormer","character":"Lady Margaery Tyrell"},{"actor":"Oona Chaplin","character":"Queen Talisa Stark"},{"actor":"Sophie Turner","character":"Princess Sansa Stark"},{"actor":"Maisie Williams","character":"Princess Arya Stark"},{"actor":"Joe Dempsie","character":"Gendry"},{"actor":"Rose Leslie","character":"Ygritte"},{"actor":"Rory McCann","character":"Sandor Clegane"},{"actor":"Diana Rigg","character":"Lady Olenna Tyrell"},{"actor":"Gwendoline Christie","character":"Brienne of Tarth"},{"actor":"Ian McElhinney","character":"Ser Barristan Selmy"},{"actor":"Michael McElhatton","character":"Lord Roose Bolton"},{"actor":"Paul Kaye","character":"Thoros of Myr"},{"actor":"Richard Dormer","character":"Lord Beric Dondarrion"},{"actor":"Mackenzie Crook","character":"Orell"},{"actor":"Anton Lesser","character":"Qyburn"},{"actor":"Clive Russell","character":"Ser Brynden Tully"},{"actor":"Tobias Menzies","character":"Lord Edmure Tully"},{"actor":"Kristofer Hivju","character":"Tormund Giantsbane"},{"actor":"Noah Taylor","character":"Locke"},{"actor":"Finn Jones","character":"Ser Loras Tyrell"},{"actor":"John Stahl","character":"Lord Rickard Karstark"},{"actor":"Tara Fitzgerald","character":"Queen Selyse Baratheon"},{"actor":"Kerry Ingram","character":"Princess Shireen Baratheon"},{"actor":"Nathalie Emmanuel","character":"Missandei"},{"actor":"Jacob Anderson","character":"Grey Worm"},{"actor":"Philip McGinley","character":"Anguy"},{"actor":"Daniel Portman","character":"Podrick Payne"},{"actor":"Will Tudor","character":"Olyvar"},{"actor":"Dean-Charles Chapman","character":"Martyn Lannister"},{"actor":"Timothy Gibbons","character":"Willem Lannister"},{"actor":"Shaun Blaney","character":"a Karstark lookout"},{"actor":"Jamie Michie","character":"Steelshanks"},{"actor":"Dennis McKeever","character":"Night's Watch Officer"},{"actor":"Tyrone Kearns","character":"Brotherhood Member"}]}
