{"title":"Dark Wings, Dark Words","season":"3","episode":"2","date":"Sun Apr 07 2013","authors":["Vanessa Taylor"],"directors":["Daniel Minahan"],"info":"\"Dark Wings, Dark Words\" is the second episode of the third season of Game of Thrones. It is the twenty-second episode of the series overall. It premiered on April 7, 2013. It was written by co-executive producer Vanessa Taylor and directed by Daniel Minahan.","plot":"Sansa Stark is introduced to Olenna Tyrell and is incautious when questioned about King Joffrey Baratheon. Shae asks Tyrion Lannister for help protecting Sansa. Jaime Lannister provokes Brienne into a duel but finds himself recaptured. Arya Stark crosses paths with the Brotherhood Without Banners and is recognized by their new prisoner Sandor Clegane. Ravens bring dark news to the King in the North at Harrenhal; his brothers are still missing and Hoster Tully has died. Jon Snow learns about wargs from the Free Folk. Bran Stark is surprised to meet new allies in the barren North.","summary":[{"location":"Beyond the Wall","content":"Jon Snow marches slowly South with the Free Folk army of King-Beyond-the-Wall Mance Rayder. Mance explains that his army is a diverse force, formed of about ninety different groups or clans of wildlings, who speak seven different languages, and have numerous internal rivalries. However, he managed to unite them all by telling them the truth: that they will all die if they remain north of the Wall. Mance brings Jon to one of his scouts, Orell. He is sitting silently with his eyes rolled back as an eagle circles above him. Mance says that he is a \"warg\", and Ygritte is surprised that Jon doesn't know what that is. Mance explains that a warg is a person who is capable of entering the mind of an animal, seeing what it sees and even controlling its actions. Orell controls his menagerie to scout miles ahead. Mance asks him what he has seen, and Orell says he saw the Fist of the First Men - and many dead \"crows\".\n\n    Mormont assigns Rast care of Tarly.  \nLord Commander Jeor Mormont of the Night's Watch leads the few survivors of the slaughter at the Battle of the Fist of the First Men south in hope of reaching the Wall. Samwell Tarly is exhausted and collapses. Rast is annoyed that Sam hid during the battle, and thinks they should leave him because he's slowing them down. Sam is upset that Grenn and Edd abandoned him at the start of the attack, although they refuse to leave him now. Mormont tells Sam that he has to keep moving, and sternly forbids Sam to die. Mormont orders Rast to keep Sam alive until they reach the Wall on pain of death.\n\nI"},{"location":"In the Seven Kingdoms","content":"Bran Stark dreams that he is walking and hunting in the woods; he sees the mysterious three-eyed raven again. As he aims his bow, he relives his memories of when he was practicing archery with Jon and Robb, and hears the voice of his father Eddard. Bran shoots at the raven but misses. A young stranger appears. The boy tells Bran that he cannot shoot the raven, because he is the raven. Bran awakens suddenly, worrying Hodor for a moment but he says that he is fine. Osha says they have enough problems without dark dreams. Bran, Rickon, Osha, Hodor, and the direwolves Summer and Shaggydog continue to head north from Winterfell to the Wall.\nLater, the same boy from the dream approaches their camp in the woods unarmed. Summer snarls at him initially but then sniffs his hand and turns away. Osha comes up behind the boy with a sharpened wooden spear, only for the boy's sister to surprise Osha and put a knife to her throat. The boy introduces himself as Jojen Reed, and his sister as Meera Reed. House Reed are loyal bannermen of House Stark, and they have been searching for Bran and Rickon so that they can protect them.\nWhen they are on the move again, Jojen and Bran discuss his wolf-dreams. Jojen explains that Bran himself is a warg. Jojen says that it starts out as vivid dreams seeing the world through his wolf's eyes, but with practice he will be able to consciously enter the mind of his wolf and control its actions. Bran asks if prophetic dreams are part of being a warg, but Jojen explains that's a different, related ability. \"The Sight\" allows those who possess it to see events that haven't happened yet, or events that happened long before they were born, or events happening now but thousands of miles away. Jojen confirms that Bran's dream of his father Eddard the day he died was an example of the Sight, and that Jojen himself had a similar dream the same day. He says that when he told his father, Lord Howland Reed, he openly wept, for he correctly realized that his son's dream signified that Eddard was dead. Bran says that Howland was a great friend of his father Eddard's who fought alongside him during Robert's Rebellion. Jojen says that Howland doesn't like to talk about the war much. Jojen confirms that Bran wasn't simply experiencing a vision of Jojen in his earlier dream, but that he reached out with his mind to contact Bran in his dream, and that he remembers seeing the three-eyed raven too.\nAt an indeterminate location, Theon Greyjoy has been chained up in a dungeon after being knocked out before the Sack of Winterfell. Men come in, some wearing ironborn clothing, and interrogate him. When he asks what they want, one of his captors says he wants to do \"this\" and starts prying his fingernails off with a knife. Later they use a foot press to torture him, while also slowly turning a screw into his foot until it is bleeding freely, repeatedly asking him why he captured Winterfell, but apparently not caring about the answers he gives. Theon at first tells them the simple truth that he wanted to take and hold Winterfell while the North was vunerable to impress his father, then starts frantically lying, saying he hates the Starks and is their enemy, desperately trying to figure out what his captors want him to tell them. When the guards leave they put a bag over his head. A servant boy comes over to Theon and unwinds the foot press, and tells him that he has been sent by his sister Yara to rescue him. However, he must wait until nightfall when the castle is asleep, so he puts the bag back on and the desperate Theon is left alone crying for help.\nKing Joffrey Baratheon is being fitted for new clothes in his chambers, in preparation for his upcoming wedding to Margaery Tyrell. His mother Cersei begins to criticize Margaery, saying that she is only charitable to the poor to build up support for herself, and also saying that she thinks she dresses like a harlot. However, Joffrey barely tolerates his mother's chiding and dismissively tells her off.\n\nShae dresses Sansa Stark in her chambers, and warns Sansa about Petyr \"Littlefinger\" Baelish. She points out that Baelish has offered to help Sansa for nothing in return, which probably means that he's after something. Sansa naively says that he's an old friend of her mother's, believing that should be reason enough. Shae suggests that Baelish is actually sexually attracted to Sansa. This disturbs Sansa, but she thinks it is simply impossible, as Baelish is so much older than her. Shae continues to warn Sansa that Baelish is manipulative and men usually only want \"one thing\" from pretty young ladies, and \"love\" often isn't what they're after.    Sansa warns the Tyrells that Joffrey is a monster.  \nSer Loras Tyrell arrives at the door and escorts Sansa to the gardens to meet with Margaery and their grandmother, Lady Olenna Tyrell. Sansa reminds Loras that they met once before at the Tourney of the Hand, and he takes his leave after introducing her. Lady Olenna is a cunning and intelligent woman who speaks her mind, and bluntly says that her son Mace was a fool for supporting Renly Baratheon's claim to the throne, though Margaery speaks well of Renly. Lady Olenna insists that Sansa tell her the truth about what Joffrey is like, as he is to marry Margaery. Sansa is initially reluctant, but when Olenna mentions her father, Sansa breaks down and, her eyes blazing, angrily recounts how Joffrey had said he would show her father mercy, only to behead him in front of her, and how he then took her up to the wall and forced her to look at her father's head on a spike and claim him providing her father with a swift death was \"mercy\". Realizing what she has just been saying, Sansa nervously attempts to backtrack. Olenna continues to prod Sansa as she fidgets around, and it becomes obvious that she is visibly afraid about being overheard. After enough times of Olenna insisting that she can trust her not to repeat what she says, Sansa blurts out that Joffrey is \"a monster\". Olenna is disappointed, but unsurprised, given the rumors that have been circulating about Joffrey's public outbursts. Sansa is worried that this means the Tyrells will cancel their proposed marriage alliance (meaning Sansa will be stuck with Joffrey again), but Olenna assures her that her son Mace is too intent on Margaery entering into a royal marriage to cancel it for anything.\nShae sneaks into Tyrion Lannister's new chambers. He warns her that his father threatened to kill her if he found her with him again, and that his father follows through on such threats. Undeterred, Shae starts undressing Tyrion, and asks him for a favor; to protect Sansa from Baelish. Tyrion says that he no longer has enough power or influence to attempt to do that, though Shae accuses him of being attracted to Sansa, which he cheerfully denies. It also comes out that Tyrion had sex with Ros back in the North, though Tyrion points out it was before he met Shae. They playfully bicker about it as they start having sex.\n\n    Margaery finds a way to bond with Joffrey.  \nMargaery is summoned to Joffrey's chambers to see if she needs anything before he leaves on a hunting trip. While Joffrey has previously been easy for Margaery to manipulate, Cersei was apparently able to plant one seed of doubt in his mind; the fact that Margaery was married to his uncle Renly (and thus, already had sex with another man), whom Cersei described as a \"traitor and known degenerate\". When questioned, Margaery says that she was ordered to marry a traitor as her family duty, but Joffrey implies that this still means he must have had sex with her. Joffrey angrily questions Margaery about the relationship and she delicately placates him by feigning demure shyness and painting herself as a dutiful, but frustrated, bride. She uses the rumors about Renly's homosexuality to redirect Joffrey's anger, stating that Renly always found excuses to avoid sex, but, in one instance, drunkenly suggested \"something that sounded very painful and could not possibly result in children\", which draws her new fiance's sympathy. Margaery eventually manages to divert attention to the new custom crossbow Joffrey's had made for his excursion. It quickly becomes apparent that Joffrey is excited by violence and sadism, so she flirts with him by complimenting the crossbow and musing about killing something herself. Easily played, Joffrey offers to take her with him to share in the excitement of killing something.\nKing Robb Stark settles into the council chamber at Harrenhal with his wife Queen Talisa. Lord Roose Bolton interrupts them with two messenger-raven missives, each of which brings bad news. First, Robb's maternal grandfather Hoster Tully has finally died after a long illness at his castle of Riverrun. Second, Roose delivers a letter from his bastard son Ramsay Snow, stating that the ironborn torched Winterfell and put all of its inhabitants to the sword, and then fled all before his force arrived there. There has been no sighting of Bran or Rickon, and though Robb hopes that they are still alive, there is a strong possibility that they are dead. Moreover, there has been no word of Theon, and if he took the boys captive the Greyjoys haven't sent out any demands. This double-blow reduces Catelyn Stark to tears and she laments that she had not seen her father in years. She is horrified at the thought that Bran and Rickon were in danger while she was away and could not protect them, and are now likely dead.\nRobb leaves Roose in command of Harrenhal with a detachment of the Northern army while Robb leads his main host back across the Riverlands to Riverrun. Lord Rickard Karstark angrily says that this is a waste of time, though Robb points out that Catelyn's brother and his uncle, Edmure Tully, is now lord of Riverrun and his levies will reinforce their army. Karstark maintains that unless Edmure has been breeding soldiers like rabbits, it will make no difference: with their new Tyrell allies, the Lannisters now outnumber them over two to one. Robb asks if Karstark has lost faith in their cause, and Karstark says he still believes in revenge. However, the fact that Robb lost his home castle makes him seem vulnerable in the eyes of his bannermen, and many no longer believe in Robb as they once did. Lord Karstark asks to speak his mind (as if he wasn't already), and says that he thinks Robb lost the war the day he married Talisa, a political nobody, throwing away any opportunity to forge marriage-alliances with badly needed allies, specifically breaking his promise to enter into a marriage-alliance with House Frey.\nTalisa notices that Catelyn is making a prayer wheel for the Faith of the Seven, and offers to help. Catelyn explains that they can only be made by mothers who are praying for the welfare of their children. Catelyn reveals that she has only made them twice before, one of which was when she was praying for Bran to wake from his coma, which worked after a fashion, as he did survive though he lost the use of his legs. Talisa asks after the other time, and Catelyn says that when they were younger, one of the boys had a pox, and Maester Luwin said that if he survived the night he would be all right, but that it would be a long night. Catelyn explains that the boy was Jon Snow, and at first the thought that Jon would conveniently die of natural causes made her inwardly pray to the Seven for his end. However, Catelyn then became horrified at herself for thinking such a thing, particularly as Jon was an innocent child, and the person Catelyn really hated was Jon's unidentified mother. So she made a prayer wheel and stayed up with him all night, praying to the gods that if they forgave her earlier wish that Jon would die, she promised she would urge Eddard to have Jon legitimized as a Stark and she would raise him as her own son. Jon recovered, however, Catelyn did not keep her promise. In grief at the death of her father and apparent death of her two youngest sons, and her continued grief at losing Eddard, Catelyn says the gods are punishing her misconduct with this war.\nNot too far away in the Riverlands, Arya Stark, Gendry, and Hot Pie are heading north from Harrenhal, planning to eventually reach the Red Fork of the Trident River and then follow it west to her grandfather's castle-seat at Riverrun. Off-screen, Arya explained to the boys how Jaqen H'ghar helped them escape because he offered that he would kill any three people she named. Gendry loudly criticizes Arya, in disbelief that she used up two of the names on minor Lannister guards when she could have said someone like \"King Joffrey\" or \"Tywin Lannister\" and ended the entire war, at which Arya gets quite defensive. However, as they advance in the forest, they run into a scouting party of the Brotherhood Without Banners, a group of outlaws, whose leader Thoros of Myr they hear singing \"The Rains of Castamere\" as they approach. They recognize them as the group the Lannister torturers were asking about at Harrenhal. Thoros seems a friendly sort, and they make the children come with them. They later give them food and drink at a local inn. Gendry says he used to work as a smith in King's Landing for Tobho Mott, whom Thoros recognizes but says he charged double what the other smiths did; Gendry counters that's because it was double the quality. Arya insists that she knows how to use a sword despite Thoros' disbelief, but when she tries to mock-fence with him he quickly disarms her. Other members of the Brotherhood return to the inn with a captive; Sandor \"The Hound\" Clegane. As Thoros trades insults with Sandor, Arya tries to leave, but the Hound stops her in astonishment and asks what in seven hells they're doing with \"the Stark bitch\", revealing her identity to all.\nFinally, Jaime Lannister and Brienne of Tarth are slowly making their way across country through the Riverlands, heading to King's Landing intending to make the prisoner exchange for the Stark girls (really, just Sansa). Jaime continues to mock Brienne along the way. Brienne is wary enough not to let Jaime out of her sight, even insisting on keeping him on his leash and watching while he urinates so he doesn't slip away. Jaime deduces that Brienne isn't from the North because he would have noticed her at Winterfell when he visited there, so (as she is from House Tarth) she must be a Baratheon supporter. She angrily denies supporting Stannis, thus confirming that she served Renly. Jaime accurately deduces that she fancied Renly, but points out that Renly wasn't attracted to women so much as he was to Loras. Brienne says she doesn't want to hear his filthy lies, but he says that he knew Renly better than she did, reminding her that both of them spent the last 17 years living in the Red Keep, ever since Robert's Rebellion when Renly was just a child prancing down the halls. Jaime insists that Renly's homosexuality was actually \"the worst kept secret at court\" if she thinks he's lying. He continues to casually mock Renly which makes Brienne grab him, but he relents and says he doesn't particularly care that Renly loved Loras, as he feels people aren't free to choose the ones they love (which he knows better than most). They come across a farmer with a heavily laden mule, who notices that they're cutting cross-country and avoiding the major roads, and suspects that they're avoiding soldiers. Jaime tells Brienne that he suspects the man is a scout meant to intercept them, and even if he isn't he can still spread word he saw them. He urges her to kill the man, but she refuses.\n\n    Brienne gives Jaime a beatdown  \nLater, the pair have to cross a river, which means they can either attempt a dangerous fording or take the bridge, which will probably be watched. Brienne takes the safer route of the bridge, but Jaime manages to distract her long enough to take away her spare sword and cut his bonds. Brienne and Jaime enter into an extended sword fight on the bridge. Jaime starts off very aggressively, putting Brienne on the defensive. However, Jaime's mobility is reduced because his hands are still manacled, and he is malnourished after having spent the past full year chained up in a cell. Jaime begins to tire, and Brienne wears him down further by making body-blows with kicks and punches. After a protracted fight Jaime finally slumps to the ground in exhaustion. Just then, riders from House Bolton arrive led by a man named Locke. Jaime asks if they want to negotiate, but Locke says they'll have his head if he doesn't bring the Kingslayer back to the King in the North, so there's not much Jaime can do to dissuade him from taking them prisoner."}],"firsts":["Jojen Reed","Riverrun traveller","Master Torturer","King's Landing tailor","Lady Olenna Tyrell","Tyrell server","Orell","Meera Reed","Thoros of Myr","Anguy","Brotherhood Member","Ramsay Snow","Locke"],"deaths":["Hoster Tully, died off-screen of natural causes"],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Nikolaj Coster-Waldau","character":"Ser Jaime Lannister"},{"actor":"Lena Headey","character":"Queen Cersei Lannister"},{"actor":"Kit Harington","character":"Jon Snow"},{"actor":"Richard Madden","character":"King Robb Stark"},{"actor":"Michelle Fairley","character":"Lady Catelyn Stark"},{"actor":"Natalie Dormer","character":"Lady Margaery Tyrell"},{"actor":"Isaac Hempstead-Wright","character":"Prince Bran Stark"},{"actor":"Jack Gleeson","character":"King Joffrey Baratheon"},{"actor":"Sophie Turner","character":"Princess Sansa Stark"},{"actor":"Maisie Williams","character":"Princess Arya Stark"},{"actor":"Alfie Allen","character":"Prince Theon Greyjoy"},{"actor":"Oona Chaplin","character":"Queen Talisa Stark"},{"actor":"Joe Dempsie","character":"Gendry"},{"actor":"Rose Leslie","character":"Ygritte"},{"actor":"John Bradley","character":"Samwell Tarly"},{"actor":"James Cosmo","character":"Lord Commander Jeor Mormont"},{"actor":"Sibel Kekilli","character":"Shae"},{"actor":"Rory McCann","character":"Sandor Clegane"},{"actor":"Diana Rigg","character":"Lady Olenna Tyrell"},{"actor":"Ciarán Hinds","character":"Mance Rayder"},{"actor":"Mackenzie Crook","character":"Orell"},{"actor":"Paul Kaye","character":"Thoros of Myr"},{"actor":"Gwendoline Christie","character":"Brienne of Tarth"},{"actor":"Noah Taylor","character":"Locke"},{"actor":"Natalia Tena","character":"Osha"},{"actor":"Michael McElhatton","character":"Lord Roose Bolton"},{"actor":"Iwan Rheon","character":"Ramsay Snow"},{"actor":"Kristofer Hivju","character":"Tormund Giantsbane"},{"actor":"Finn Jones","character":"Ser Loras Tyrell"},{"actor":"Thomas Brodie Sangster","character":"Jojen Reed"},{"actor":"Ellie Kendrick","character":"Meera Reed"},{"actor":"Ben Hawkey","character":"Hot Pie"},{"actor":"John Stahl","character":"Lord Rickard Karstark"},{"actor":"Philip McGinley","character":"Anguy"},{"actor":"Mark Stanley","character":"Grenn"},{"actor":"Ben Crompton","character":"Eddison Tollett"},{"actor":"Luke Barnes","character":"Rast"},{"actor":"Kristian Nairn","character":"Hodor"},{"actor":"Art Parkinson","character":"Prince Rickon Stark"},{"actor":"Michael Shelford","character":"Master Torturer"},{"actor":"Joe Purcell","character":"a Riverrun traveller"},{"actor":"Joe Cassidy","character":"a King's Landing tailor"},{"actor":"Will Rastall","character":"Tyrell server"},{"actor":"Tyrone Kearns","character":"Brotherhood member"},{"actor":"Sean Bean","character":"Lord Eddard Stark (voice only, archive footage)"}]}
