{"title":"Mhysa","season":"3","episode":"10","date":"Sun Jun 09 2013","authors":["David Benioff","D.B. Weiss"],"directors":["David Nutter"],"info":"\"Mhysa\" is the tenth and final episode of the third season of Game of Thrones. It is the thirtieth episode of the series overall.[1] It premiered on June 9, 2013. It was written by executive producers David Benioff and D.B. Weiss and directed by David Nutter.   ","plot":"Joffrey challenges Tywin. Bran tells a ghost story. In Dragonstone, mercy comes from strange quarters. Dany waits to see if she is a conqueror or a liberator.","summary":[{"location":"In the Seven Kingdoms","content":"At the Twins, the carnage at the Red Wedding continues to unfold. While the Northern lords are being slaughtered in the main hall, outside the walls of the castle House Frey soldiers ambush the Stark army in its own camp. What follows is not a battle but a one-sided massacre as the Northern army is taken completely by surprise due to the betrayal of their supposed allies. The betrayers torch all of the camp's tents, with many men burning alive inside of them. Frey men wildly mutilate the dead and dying. From one of the twin towers of the Frey stronghold, Roose Bolton watches the massacre.\n\n    Robb's corpse desecrated, with his direwolf's head sewn in place of his own.  \nSandor Clegane attempts to slip away amidst the carnage on a horse, along with the unconscious Arya Stark, by casually riding away while carrying a Frey banner. Before they can leave, Arya regains consciousness - as she and the Hound turn to see a group of Frey men shouting as they march through the main gate. The Freys have horrifically desecrated Robb Stark's corpse by decapitating it, then crudely attaching the severed head of his direwolf Grey Wind in its place. Drunk with \"victory\", the Freys gleefully parade the mutilated body around the castle on a horse while mockingly chanting \"King in the North! King in the North! Here he comes, the King in the North!\", which is met with by cheers and peals of laughter from the crowds of Frey soldiers.\nSandor is horrified by the gruesome spectacle, while he holds Arya, who looks on with a dead stare. The Hound rides away with her, undisturbed thanks to the Frey banner in his hand.\nIn the great hall of the castle the following morning, as servants clean up the pools of blood left by their former wedding guests, Lords Walder Frey and Roose Bolton gloat over their victory and the rewards their treachery has won them. Frey will become Lord of Riverrun, and the Freys will replace the Tullys as the Lannisters' vassals in the Riverlands. Bolton has been appointed as the new Warden of the North, replacing the Starks - though Tywin Lannister intends to eventually give the position to a future Lannister heir produced by Tyrion Lannister and Sansa Stark.\nBolton expresses his concern that Brynden Tully escaped the massacre, but Walder dismisses his worries, pointing out that the Blackfish - and the remaining Tully garrison at Riverrun - is alone and outnumbered against the combined strength of the Lannisters, Boltons, and Freys, although Bolton is still visibly concerned. Bolton makes plain his contempt for Robb Stark, considering the late boy-king arrogant, politically incompetent, and unwilling to take Roose's advice and make the hard decisions needed to win. Walder questions Roose if he intends to rule the North from Winterfell, and he says that he might move his ruling seat there at some future time, after it is rebuilt. This leads Walder to ask how Winterfell ended up a ruin. Roose explains that his bastard son Ramsay Snow offered Robb Stark's terms that the ironborn occupiers would be shown mercy if they handed over Theon Greyjoy, but when they did they learned that Ramsay, in his father's words, \"has his own way of doing things\"...\nAt the Dreadfort, Ramsay Snow eats his breakfast of a thick sausage, taunting Theon about his recent emasculation by pointing to his sewn up and blood-stained trousers, and laughing as Theon finally begs for death as a release from the nightmare. Ramsay tells him that he is more valuable alive than dead so the answer must be no. Ramsay notes that Theon reeks, and decides that that shall be his new name: Reek. Theon refuses to acknowledge the name, twice insisting that he is Theon Greyjoy, but after Ramsay beats him, he finally breaks down and says his name is Reek.\n​On Pyke, Balon Greyjoy reads a message from Lord Bolton's bastard while his daughter Yara Greyjoy cautiously opens a box crudely carved with the Greyjoy kraken. As Ramsay's letter explains the box contains \"Theon's favorite toy.\" The message bluntly says that the ironborn have until the full moon to withdraw from the North or receive more bits and pieces of Theon. In addition any remaining ironborn will be flayed alive - just as Ramsay flayed alive Theon's twenty ironborn followers at Winterfell after they surrendered, even though he had promised them safe passage. It was in fact Ramsay Snow and his soldiers from House Bolton who burned Winterfell to the ground: he simply sent false reports for his father Roose to deliver to Robb Stark which claimed that the ironborn were responsible, as the Boltons were preparing to betray the Starks months before the Red Wedding.\nBalon acts indifferent to Theon's situation since he defied Balon's orders and Yara's common sense when he stayed at Winterfell. Furthermore, he cannot further the Greyjoy line as the contents of the box prove. However, Yara does not share her father's attitude toward her last living brother. She announces her intention to take her fastest ship with her fifty best men, sail around Westeros, besiege the Dreadfort, and liberate Theon.\nIn the Riverlands, a despondent Arya Stark and Sandor Clegane ride away from the outskirts of the Twins. They pass close to a small group of Frey men, one of whom is bragging about being one of the men who cut off Grey Wind's head and attached it to Robb Stark's body. Arya approaches them and sweetly asks to warm herself by the fire. She offers the coin given to her by Jaqen H'ghar as payment. When the Frey man investigates, she stabs him in the neck. Slightly thrown, the Hound deals with the others before demanding to know where Arya got the knife. She reveals it's his. He admonishes her to let him know the next time she plans to do something like that. As he grumbles and cleans up the bodies, Arya whispers, \"valar morghulis\".\nMeanwhile, in King's Landing, Tyrion Lannister and Sansa Stark walk through the gardens. A pair of passing gentlemen snigger at Tyrion, either for his dwarf status or due to rumors he has not consummated his marriage. Sansa tells him to pay them no mind. Tyrion reminds Sansa that he's used to it, as he's always been a dwarf. He also states that he's not Joffrey, Tyrion would rather bide his time and humiliate them. Sansa playfully follows his line of thinking, and suggests \"sheep-shifting\"- secretly hiding sheep's dung deep within a mattress (as Arya used to do to her), so that the target always wakes up smelling of dung. Tyrion is amused but is confused by the term, though he realizes belatedly that Sansa has misheard the word \"shit\". He is rescued from having to explain his wife's mistake by Podrick Payne, who calls him to a meeting of the Small Council.\nIn Tywin's chambers Grand Maester Pycelle dithers over giving Tyrion a coded message from Lord Frey. Joffrey jubilantly explains its meaning that Robb and Catelyn Stark are both dead. Tyrion is visibly startled by the news, already foreseeing the long-term problems that the incident will cause, but Joffrey brushes him off and gleefully states that he intends to serve Robb's severed head to Sansa at his wedding feast. None of the Small Council are able to mask how distasteful they find the concept. Varys points out that Sansa is Joffrey's aunt by marriage now (and it would be unseemly not to give her the basic respect that accords).\nA deeply embarrassed Cersei forces a smile and insists to the rest of the council that Joffrey was only joking and did not mean it. This puzzles Joffrey, who matter-of-factly states to his mother that he did mean it, and he will have Robb's head served at his wedding feast. Tyrion flatly forbids it and tells Joffrey that Sansa isn't his to torment anymore. Joffrey angrily proclaims that he is the king, and everyone is his to torment. Tywin counters that a king who has to remind his subjects that he is the king, is no king. Joffrey goes apoplectic and tries to fight his grandfather, deriding Tywin as a coward who hid under Casterly Rock while Joffrey's father King Robert won the real war when he overthrew the Targaryens. The entire Small Council tenses waiting for Tywin to respond to this shocking insult: instead Tywin coldly and calmly declares that the king is tired and advises the Queen Regent to see him to bed. Joffrey weakly protests that he is not tired but leaves with his mother, and Tywin also asks Pycelle to give his grandson a sedative to make sure he goes to sleep.\nTywin dismisses the rest of the council, save Tyrion, who drily notes that the Lord of the Seven Kingdoms has been sent to bed without his supper. He confronts Tywin about his part in the Red Wedding, and deduces that his father must have orchestrated it, as Walder Frey is not brave enough to have carried it out on his own. The Hand blithely confirms this. He dismisses Tyrion's concerns that the Northerners will never forget nor forgive such an outrage, arguing he wants them to remember so that it will make them wary of rebelling again. Tyrion shows his distaste for Tywin's choice of a wedding as the place to inflict the slaughter, but Tywin responds, asking why killing ten thousand soldiers in battle is nobler than killing a dozen guests at a wedding.\nTywin again waxes poetic about family, noting Tyrion's failure to consummate his marriage to Sansa. Tyrion refuses to force himself on Sansa to do his duty, and notes that she is hardly likely to warm to him now that the Lannisters have murdered her mother and brother. Tyrion demands to know when Tywin ever put the family's interests above his own. Tywin retorts that he did exactly that on the day that Tyrion was born: he wanted to throw his newborn son into the sea, but instead he spared him and raised him as his son, because he is a Lannister.\nImmediately after leaving, Tyrion returns to his chambers and calls for Sansa, who simply regards him with a forlorn, tear-streaked face confirming that she was already informed of her family's death. Tyrion backs out, knowing that his sympathy would be rather cold comfort.\nElsewhere in the Red Keep, Varys meets with Shae. He tells her that he knows she is genuinely in love with Tyrion - and that is why she should take the diamonds he offers her and leave immediately for Essos to build a new, lavish life for herself. Varys is convinced that Tyrion is the last hope for the Seven Kingdoms' current regime, therefore Shae is a weakness that Tyrion, and thus the realm, cannot afford. Shae confirms that she is in love with Tyrion and that she cares deeply for Sansa as well, but in spite of her pain at seeing them together and the danger she poses, Shae will not leave until or unless Tyrion asks her to.\nUnknown to everyone in King's Landing, Jaime Lannister, Brienne of Tarth, and Qyburn finally arrive; the city folk do not even recognize Jaime after his long absence from the capital. They make their way to the Red Keep, where Jaime immediately calls on Cersei, who regards him with a confused look as she takes in his disheveled appearance and missing hand.\nAt Dragonstone, Ser Davos Seaworth tests his new-found literacy on Stannis Baratheon's correspondence, declining Shireen Baratheon's invitation to read more tales of Aegon I Targaryen. He expresses dissatisfaction about the odd spelling of the word \"night\", before hearing the horns that signal Melisandre's intents to sacrifice Gendry. He argues with Stannis again about sacrificing the boy, but Stannis is convinced by Melisandre that using Gendry as part of her blood magic will give him the power to destroy his enemies and claim the Iron Throne. When he doesn't get through to his liege, Davos takes matters into his own hands and frees the boy, giving him a rowboat and directions to King's Landing. A furious Stannis sentences Davos to death but the Onion Knight produces a letter from the Night's Watch. Davos insists that it is Stannis' duty to assist the black brothers, and that he will need Davos's assistance to rally troops and mercenaries. Melisandre burns the letter and acknowledges the truth: the War of the Five Kings is irrelevant. The true war lies in the North, and evil and death are marching on the Wall. She also agrees that Davos has an important role to play in the events to come. Stannis sarcastically laughs at R'hllor's sense of humor, noting that the god Davos likes to mock has chosen him for a higher purpose.\n\nA"},{"location":"At the Wall","content":"Arriving at the abandoned Nightfort, Meera Reed tells Bran, Hodor and Jojen that the castle is safe to enter. While around the fire Bran tells the story of the Rat Cook, a Night's Watch member who killed a guest under his roof, a sin the gods cannot forgive. Later that night, Bran is awoken by a sound, and wakes his companions in time to see something large climbing out of the castle well; Meera attacks and overpowers the intruder, who is revealed to be Samwell Tarly, accompanied by Gilly. Sam quickly deduces Bran's identity by recognizing Bran's direwolf and Hodor. Bran asks Sam to take him and his group north of the Wall, and though Sam protests the idea, given the threat of the White Walkers and the undead horde they command approaching, he eventually relents and takes them through the passage. Before they separate Sam gives the group the rest of his dragonglass supply and tells them that it has the power to kill White Walkers. The groups then head in different directions; Sam and Gilly for Castle Black, and the Reeds, Hodor, and Bran beyond the Wall.\nAt Castle Black, Sam and Gilly meet with Maester Aemon, who is furious at the prospect of Sam having violated his vows. Sam defends himself by reciting the Night's Watch oath to protect the realms of men whatever side of the Wall they are on and repeating Jeor Mormont's assertion that a wall of ice 500 miles long and 700 feet high was not built to keep out barbarians. Aemon's demeanor softens upon learning that Gilly was one of Craster's wives, and acknowledges that she is now a refugee and should be sheltered. Aemon then orders Sam to begin writing letters immediately and make sure that all forty-four of Castle Black's ravens are well-fed, as every one of them is to fly that night: the White Walkers have returned, and Westeros must be warned.\nStopping to rest and tend to his injuries after fleeing the wildlings, Jon Snow finds himself confronted by a furious Ygritte, who has an arrow ready to shoot him. Jon tries to talk Ygritte out of shooting him, insisting that he still loves her but that she should have known his loyalty to the Watch was never gone. Though his feelings are clearly reciprocated, Ygritte is still angered by his betrayal and shoots Jon three times with her bow as he flees from her, watching him go with tears in her eyes.\nJon is badly injured, but his horse manages to carry him the rest of the way to Castle Black, as he hovers in and out of consciousness. Having reached safety, Jon is brought inside the castle by the guards, where he encounters Sam and Pypar, who are overjoyed to see him and insist that his injuries be taken care of.\n\nA"},{"location":"Across the Narrow Sea","content":"Outside the walls of Yunkai, Daenerys Targaryen and her advisors wait for the city's slaves to appear. Daenerys frets that the Yunkish slaves, who are better treated than Astapor's might have grown to like their chains and will not welcome freedom. Finally, the gates open and the freedmen pour out. Missandei begins to tell them of how Daenerys the Unburnt freed them, but Daenerys interrupts and says that it is the slaves' own choice to reach for their freedom. After a moment, one of the freedmen stretches his hand towards Daenerys and calls out \"mhysa\". After a moment, another follows suit, then another and another until the entire crowd is chanting \"mhysa\". Bewildered, Daenerys turns to Missandei, who reveals that the word means \"mother\" in the Old Ghiscari language. When the slaves advance on Daenerys, the Unsullied step into formation, but the queen tells them to stand down. Telling her dragons to fly, Daenerys steps out of the protection of the Unsullied and into the crowd, who carry on their chanting. Daenerys is embraced by the former slaves, offering a glimmer of hope in an increasingly darker and hopeless world."}],"firsts":["Frey soldier #1","Frey soldier #2","Desmond Crakehall","Eldrick Sarsfield","Night's Watchman","Fruit vendor","Yunkai'i slave #1","Yunkai'i slave #2","Yunkai'i slave #3","Yunkai'i slave #4","Yunkai'i slave #5"],"deaths":["Frey soldier #1, stabbed by Arya Stark","Frey soldier #2, killed by Sandor Clegane"],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Nikolaj Coster-Waldau","character":"Ser Jaime Lannister"},{"actor":"Lena Headey","character":"Queen Cersei Lannister"},{"actor":"Emilia Clarke","character":"Queen Daenerys Targaryen"},{"actor":"Kit Harington","character":"Jon Snow"},{"actor":"Iain Glen","character":"Ser Jorah Mormont"},{"actor":"Charles Dance","character":"Lord Tywin Lannister"},{"actor":"Liam Cunningham","character":"Ser Davos Seaworth"},{"actor":"Stephen Dillane","character":"King Stannis Baratheon"},{"actor":"Carice van Houten","character":"Lady Melisandre"},{"actor":"Isaac Hempstead-Wright","character":"Prince Bran Stark"},{"actor":"Sophie Turner","character":"Princess Sansa Stark"},{"actor":"Maisie Williams","character":"Princess Arya Stark"},{"actor":"Alfie Allen","character":"Prince Theon Greyjoy"},{"actor":"Jack Gleeson","character":"King Joffrey Baratheon"},{"actor":"Rose Leslie","character":"Ygritte"},{"actor":"John Bradley","character":"Samwell Tarly"},{"actor":"Joe Dempsie","character":"Gendry"},{"actor":"Rory McCann","character":"Sandor Clegane"},{"actor":"Conleth Hill","character":"Lord Varys"},{"actor":"Sibel Kekilli","character":"Shae"},{"actor":"David Bradley","character":"Lord Walder Frey"},{"actor":"Patrick Malahide","character":"King Balon Greyjoy"},{"actor":"Michael McElhatton","character":"Lord Roose Bolton"},{"actor":"Peter Vaughan","character":"Maester Aemon"},{"actor":"Julian Glover","character":"Grand Maester Pycelle"},{"actor":"Gwendoline Christie","character":"Brienne of Tarth"},{"actor":"Iwan Rheon","character":"Ramsay Snow"},{"actor":"Ian McElhinney","character":"Ser Barristan Selmy"},{"actor":"Anton Lesser","character":"Qyburn"},{"actor":"Hannah Murray","character":"Gilly"},{"actor":"Thomas Brodie-Sangster","character":"Jojen Reed"},{"actor":"Ellie Kendrick","character":"Meera Reed"},{"actor":"Gemma Whelan","character":"Princess Yara Greyjoy"},{"actor":"Daniel Portman","character":"Podrick Payne"},{"actor":"Ed Skrein","character":"Daario Naharis"},{"actor":"Kristian Nairn","character":"Hodor"},{"actor":"Nathalie Emmanuel","character":"Missandei"},{"actor":"Jacob Anderson","character":"Grey Worm"},{"actor":"Josef Altin","character":"Pypar"},{"actor":"Kerry Ingram","character":"Princess Shireen Baratheon"},{"actor":"Ciaran O'Grady","character":"a Frey soldier"},{"actor":"Michael Liebmann","character":"a Frey soldier"},{"actor":"Alexer Mileman","character":"a fruit vendor"},{"actor":"Will O'Connell","character":"a Night's Watchman"},{"actor":"Maro Drobnic","character":"Lord Desmond Crakehall"},{"actor":"Marin Tudor","character":"a a Yunkai'i slave"},{"actor":"Roxanna Kadyrova","character":"a Yunkai'i slave"},{"actor":"Jamal Ouarraq","character":"a Yunkai'i slave"},{"actor":"El Hasani","character":"a Yunkai'i slave"},{"actor":"Mustapha Mekanassi","character":"a Yunkai'i slave"},{"actor":"Mustapha Rachidi","character":"Yunkai Citizen"},{"actor":"Michael Stuart","character":"Stark Bannerman"}]}
