{"title":"Second Sons","season":"3","episode":"8","date":"Sun May 19 2013","authors":["David Benioff","D.B. Weiss"],"directors":["Michelle MacLaren"],"info":"\"Second Sons\" is the eighth episode of the third season of Game of Thrones. It is the twenty-eighth episode of the series overall. It premiered on May 19, 2013. It was written by executive producers David Benioff & D.B. Weiss and directed by Michelle MacLaren.","plot":"King's Landing hosts a wedding, and Tyrion and Sansa spend the night together. Dany meets the Titan's Bastard. Davos demands proof from Melisandre. Sam and Gilly meet an older gentleman.","summary":[{"location":"Across the Narrow Sea","content":"Daenerys, Jorah and Barristan hide behind a ruined building to spy on the encampment of the Second Sons, a professional mercenary company, the \"powerful friends\" the Yunkish have employed. Barristan explains that although there are only 2,000 of them, the Second Sons are armored and mounted, enough to cause trouble for the Unsullied. Daenerys tells Barristan to organize a meeting with the Second Sons' captains, saying that men who fight for gold \"can't afford to lose to a girl.\"\nShortly thereafter, Daenerys hosts the captains Mero, a Braavosi also known as the Titan's Bastard, and Prendahl na Ghezn, a Ghiscari. Also in attendance is Prendahl's capable and striking lieutenant, Daario Naharis. The uncouth and sexually vulgar Mero makes himself at home, observes that Daenerys looks like a whore he knows in Lys and feels up Missandei, although the surprisingly gracious queen shrugs his insults off. Prendahl and Mero refuse Daenerys' offer of an alliance, pointing out they will not get their rewards until she reclaims the Iron Throne, which is still a distant prospect. With aplomb she replies that a fortnight previous she had no army, and a year before that she had no dragons. Smiling gently she gives them two days to make a decision and sends them off with a barrel of wine Mero had demanded. Daario smiles over his back at her as they depart. Once the sellswords are gone, Daenerys drops her pretence of cordiality and while glowering at Mero's back, instructs Barristan that if they must fight the Second Sons, he is to kill Mero first. Selmy replies that he would be glad to do so.\nAt the mercenary camp, Mero fondles a Yunkish pleasure-slave while discussing the situation with Prendahl and Daario. It swiftly becomes apparent that Daario and Mero do not agree, but Prendahl cuts off their philosophical discussion to call for action over \"the dragon bitch.\" They eventually decide to simply assassinate Daenerys and be done with it. Mero gives the slave three coins, one each from Volantis, Meereen, and Braavos, and tells her to randomly give them to the three mercenaries – the one who gets the Braavosi coin will kill the queen.\n\n    Daario (dressed as an Unsullied) holds a knife at Missandei's throat.  \nThat night, as Daenerys bathes, she is surprised to learn that Missandei speaks no fewer than nineteen languages. Missandei says this shouldn't be that odd, since it only took Daenerys a year to gain a reasonable grasp of Dothraki. The khaleesi bristles at the idea she speaks only reasonable Dothraki and switches to the language to teach Missandei a lesson, only to have her pronunciation corrected. Suddenly, an Unsullied enters and hold a knife to Missandei's throat, advising the women not to scream. He removes his helmet, revealing himself as Daario. He explains that he is here to kill Daenerys on orders from his captains, but they ran into a \"philosophical disagreement\" over her beauty. He then produces their severed heads. Intrigued, Daenerys rises from her bath and asks if Daario will swear fealty to her. He bends the knee and swears his sword, his men and his heart to Daenerys.\n\nB"},{"location":"Beyond the Wall","content":"Sam slays a White Walker.  Samwell Tarly and Gilly continue on their journey to Castle Black, taking refuge in a destroyed cabin next to a heart tree. Before they enter, two crows land on a branch on the heart tree, and begin to squawk loudly.\nLater at night, Sam tries to light a fire, but is frustrated in his attempts; Gilly tries and does it easily. Meanwhile, Sam suggests that Gilly name her son, but she does not know any boy names. Sam gives her some examples, and also explains the difference between first and last names. Gilly likes the name Randyll, Sam's father's first name, but Sam asks her not to give the child that name. Sam shares the truth about his father and his upbringing marked by cruelty which they both have in common.\nSuddenly, they are interrupted by a thunderous squawking of the crows. Sam and Gilly go outside to investigate, and discover hundreds of crows filling the nearby tree and on the structure itself screeching violently. Gilly is then horrified to see a White Walker approaching them, and knows that it is after her child. Sam tries to halt its advance, but the Walker shatters his sword with its bare hand and knocks him aside, then continues to bear down upon her. As the monster reaches out to seize the infant, Sam staggers back to his feet, pulls out his dragonglass dagger, and attacks the Walker, stabbing it in the back. The Walker howls in pain as its whole body begins to freeze from the point at which it was stabbed. It falls to its knees, and shatters, leaving nothing but white dust and the dagger. The dagger is left behind as Sam and Gilly race away in a panic. The crows fly out of the trees and chase them, screaming their hatred.\n\nI"},{"location":"In the Seven Kingdoms","content":"Arya Stark, now a captive of Sandor Clegane after he kidnapped her from the Brotherhood Without Banners, picks up a rock and stands over him planning to strike. She thinks he is sound asleep. He opens his eyes and tells her she has one chance to hit him, and kill him, but if she fails he will break her hands. Later she sits on the horse with him sullen and refusing food he offers her. Sandor points out that for all she hates him, Arya could have been taken captive by someone far worse. He tells her about Sansa and how he rescued her from a group of would-be rapists. Arya disbelieves this, but Sandor says \"Ask your sister if you ever see her again.\" They arrive at a river which Arya initially thinks to be the Blackwater. Rather confused with her lack of understanding he points out that the river is the Red Fork of the Trident. Arya believed he was taking her back to King's Landing, but he reveals that he is in fact taking her to The Twins, where her mother and brother will shortly be attending her uncle's wedding, and he will ransom her to them. He tells her ruefully that if she wasn't so busy trying to kill him they might make it in time for the wedding. Arya has a small and hidden smile as the Hound spurs the horse to a gallop.\nMelisandre finally arrives back at Dragonstone   with Gendry in tow. Stannis is less than impressed by the sight of the bastard boy who is technically his nephew and is bemused when Melisandre orders him fed, bathed and clothed. He believes it is pointless as they intend to sacrifice him, but Melisandre reveals it is merely a sham to keep Gendry feeling secure, in much the same way as keeping a sacrificial lamb from seeing the blade of the knife.\nMeanwhile, Davos Seaworth, still languishing in his cell, is paid a visit by Stannis; Davos is told of the impending sacrifice of Gendry. Davos protests this saying that unlike Renly who was a rebel against his rightful king, Gendry is an innocent who has never done him any wrong. Stannis argues that the sacrifice of one bastard boy will usher in his victory, which Stannis believes is the only way to save every man, woman and child in Westeros from the coming darkness that will devour everything in its path. He asks how Davos can doubt the power of Melisandre's God  when Stannis has seen visions of \"a great battle in the snow\" and Davos saw the creature she gave birth to. Davos speculates that the real reason Stannis came is because deep down, a part of him knows what he's about to do is wrong and he knew Davos would tell him the truth he needs to hear, regardless of how it would be taken. After extracting a promise from Davos that he won't act against Melisandre again, Stannis has him released.\n\n    Stannis naming the 3 usurpers.  \nIn Gendry's quarters, Melisandre seduces Gendry long enough to distract him, then promptly ties him to the bed and places leeches on his body. She explains as Stannis and Davos enter the room that Davos wanted a demonstration of the power in king's blood, then removes the leeches and lights a fire in a nearby brazier. As part of the magical ritual that follows, Stannis throws the leeches into the flames at Melisandre's direction, and recites the names of three people he wants dead as they burn: \"The usurper Robb Stark, the usurper Balon Greyjoy, the usurper Joffrey Baratheon.\"\nAt King's Landing, Tyrion speaks with Sansa before their wedding at the Great Sept of Baelor; though he knows the girl is not thrilled at the prospect of marrying him. Tyrion promises Sansa that he will not mistreat her, and Sansa agrees there are worse Lannisters she could be wed to. Prior to the wedding, Margaery Tyrell tries to ingratiate herself to Cersei, commenting they will technically be sisters soon; Cersei responds by telling Margaery the story behind the \"Rains of Castamere,\" relating how it refers to the destruction of House Reyne of Castamere after their failed rebellion against House Lannister (inferring similarities between the ambitions and position of Houses Reyne and Tyrell and that the same fate may fall upon House Tyrell if they plot against the Lannisters) and concludes by threatening to have Margaery strangled in her sleep if she ever dares call Cersei sister again. The ceremony is a grim affair; Joffrey smugly escorts Sansa to the altar in place of her father and petulantly removes the stool upon which Tyrion was to stand on to cloak Sansa in Lannister colors as part of the ceremony, eliciting snickers from the congregation (though the scowl of Lord Tywin quickly silences them). Tyrion in the face of humiliation asks Sansa to kneel and he places the cloak around her shoulders. The new High Septon begins the ceremony. Later as man and wife they have their reception dinner, which also proves a grim and miserable affair.\n\n    Tyrions threatens Joffrey.  \nTyrion spends the wedding feast mostly by getting deeply drunk and making light of his father's insistence that his inebriated state will render him unfit to impregnate his wife. Tyrion, drunkenly proclaiming himself \"the god of tits and wine,\" reminds his father that Tywin has long called him \"a drunken little lust-filled beast,\" so doing his duty in the marriage bed will not pose a problem. At the same time, Joffrey is himself drinking too much wine, and losing what few inhibitions he has, his behavior becomes increasingly offensive to both Sansa and Tyrion. Against Cersei's ineffectual protests, Joffrey gets up and, flanked by his Kingsguard, taunts Sansa that she's still found a way to marry a Lannister. Joffrey then ponders that it doesn't matter which Lannister gets her pregnant, and openly says he might want to rape her after Tyrion is done with her, while the Kingsguard hold her down.\nJoffrey then declares it time for the bedding ceremony (which involves the men at the wedding stripping the bride and the women stripping the groom before carrying them off to the marriage bed) but Tyrion angrily insists there will be no bedding ceremony. When Joffrey keeps pushing the matter, Tyrion slams his dagger into the table and threatens that Joffrey will \"be fucking [his] own bride with a wooden cock\" if he doesn't let it drop. As the court stands in shocked silence, Joffrey seethes with outrage and Tyrion defiantly glares at his nephew with pure hatred. After a tense moment, Tywin defuses the situation by agreeing that there will be no bedding ceremony, and placates Joffrey by claiming Tyrion's outburst is merely the result of his being extremely drunk. Taking the hint, Tyrion visibly swallows his anger and begins to act far more drunk than he actually is, intentionally humiliating himself, and says he only made a bad joke. It isn't clear if anyone in the room, including Tywin or Joffrey, think that Tyrion's outburst was simply due to being very drunk, but everyone plays along anyway to help the tension pass. Tyrion, while pretending to be so drunk he can barely stand, escorts Sansa to their bedchamber.\nOnce they are alone in their quarters, a tense moment passes as Sansa nervously and slowly undresses. Tyrion ultimately tells her to stop, deciding that he will not consummate the marriage if she does not want to, and only will if she changes her mind. When Sansa questions what he will do if she never does, Tyrion sarcastically jokes \"And so my watch begins\" - implying that his marriage will be celibate for all time like a brother of the Night's Watch - and then abruptly passes out on a nearby couch. The following morning, Shae notices with a hint of a smile that Sansa's bed sheets are not stained with blood and Tyrion's virgin bride is still a virgin."}],"firsts":["Daario Naharis","Mero","Prendahl na Ghezn","High Septon"],"deaths":["Mero, killed by Daario Naharis","Prendahl na Ghezn, killed by Daario Naharis","White Walker, stabbed with dragonglass by Samwell Tarly"],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Lena Headey","character":"Queen Cersei Lannister"},{"actor":"Emilia Clarke","character":"Queen Daenerys Targaryen"},{"actor":"Iain Glen","character":"Ser Jorah Mormont"},{"actor":"Charles Dance","character":"Lord Tywin Lannister"},{"actor":"Liam Cunningham","character":"Ser Davos Seaworth"},{"actor":"Stephen Dillane","character":"King Stannis Baratheon"},{"actor":"Carice van Houten","character":"Lady Melisandre"},{"actor":"Natalie Dormer","character":"Lady Margaery Tyrell"},{"actor":"Jack Gleeson","character":"King Joffrey Baratheon"},{"actor":"Sophie Turner","character":"Princess Sansa Stark"},{"actor":"Maisie Williams","character":"Princess Arya Stark"},{"actor":"John Bradley","character":"Samwell Tarly"},{"actor":"Joe Dempsie","character":"Gendry"},{"actor":"Sibel Kekilli","character":"Shae"},{"actor":"Rory McCann","character":"Sandor Clegane"},{"actor":"Conleth Hill","character":"Lord Varys"},{"actor":"Jerome Flynn","character":"Ser Bronn"},{"actor":"Diana Rigg","character":"Lady Olenna Tyrell"},{"actor":"Julian Glover","character":"Grand Maester Pycelle"},{"actor":"Ian McElhinney","character":"Ser Barristan Selmy"},{"actor":"Hannah Murray","character":"Gilly"},{"actor":"Finn Jones","character":"Ser Loras Tyrell"},{"actor":"Ed Skrein","character":"Daario Naharis"},{"actor":"Jacob Anderson","character":"Grey Worm"},{"actor":"Nathalie Emmanuel","character":"Missandei"},{"actor":"Mark Killeen","character":"Mero"},{"actor":"Ramon Tikaram","character":"Prendahl na Ghezn"},{"actor":"Daniel Portman","character":"Podrick Payne"},{"actor":"Ian Beattie","character":"Ser Meryn Trant"},{"actor":"Paul Bentley","character":"the High Septon"},{"actor":"Talitha Luke-Eardley","character":"a Yunkai'i whore"},{"actor":"Ross Mullan","character":"a White Walker"}]}
