{"title":"The Rains of Castamere","season":"3","episode":"9","date":"Sun Jun 02 2013","authors":["David Benioff","D.B. Weiss"],"directors":["David Nutter"],"info":"\"The Rains of Castamere\" is the ninth episode of the third season of Game of Thrones. It is the twenty-ninth episode of the series overall. It premiered on June 2, 2013. It was written by executive producers David Benioff & D.B. Weiss and directed by David Nutter.","plot":"Robb presents himself to Walder Frey, and Edmure meets his bride. Jon faces his harshest test yet. Bran discovers a new gift. Daario and Jorah debate how to take Yunkai. House Frey joins with House Tully.","summary":[{"location":"Across the Narrow Sea","content":"Outside the walls of Yunkai, Daenerys Targaryen and her commanders plan an attack on the city. Her newest captain, Daario Naharis, suggests a plan using a lightly defended back gate, a small group can infiltrate the city and open the main gates for the rest of the army to invade. Though Jorah Mormont is skeptical of both the plan and Daario's loyalty, Daenerys is convinced to try it when she asks Grey Worm if he trusts Daario. Upon being encouraged to speak his mind, he says he does. Daario also touches her on her hand, flirting for her favor to him. As the captains depart, Ser Barristan asks to go along, but Jorah reminds him that a Queensguard's place is at the Queen's side, regardless of his pride.\nThat night Ser Jorah, Daario, and Grey Worm sneak into the city and fight their way through the slave soldiers guarding Yunkai. There are far more soldiers than Daario anticipated, much to Jorah's irritation, but it seems that the three are evenly matched - barely.\nA few hours later, an impatient Daenerys paces in her tent, asking Barristan how long a sacking of a city usually takes. Jorah and Grey Worm finally enter, covered in dust and gore but grinning widely: Yunkai is defeated. Daenerys is elated, but asks after Daario, who is still absent. After a suspenseful pause by Jorah, Daario strides into the room and kneels before the Queen. He presents Yunkai's torn flag and triumphantly says the city is hers.\n\nA"},{"location":"At the Wall","content":"North of the Wall, Samwell Tarly and Gilly continue their march south, after barely escaping an encounter with a White Walker during which Sam actually managed to kill the creature using a dragonglass dagger. \n\n    Sam tells Gilly about a way to get through the wall.  \nSam tells Gilly that they are a considerable distance west of Castle Black, but this isn't a problem, because this means they are close to the Nightfort, the original headquarters of the Night's Watch, which was abandoned centuries ago as the organization's numbers dwindled. Sam explains that he plans to get them across the Wall using a secret sally-port which leads right into the Nightfort. Gilly is amazed that Sam knows so much history just from reading books, insisting that he is a wizard (much to Sam's delight) and is awestruck when she finally catches a glimpse of the Wall.\nMeanwhile, Bran Stark and his group have passed far enough north that they have left the Seven Kingdoms proper, and entered into the Gift: a stretch of land south of the Wall which was gifted to the Night's Watch thousands of years ago by Brandon the Builder, from which the Watch draws support for its material needs. The Reeds are puzzled, because the Gift possesses good arable land but the countryside is empty. Bran explains, to Osha's discomfort, that wildling attacks coming over or around the Wall caused most of the smallfolk to flee the Gift over the centuries. Meanwhile, the Watch's diminishing numbers mean they don't really need that much support from the Gift anymore, explaining why they haven't encountered any brothers of the Watch working the lands either. Bran's group takes shelter in an abandoned mill to get out of a thunderstorm.\nNearby in the Gift, Jon Snow and the wildling party encounter an old man who lives alone at a small farm where he breeds horses for the Night's Watch. They plan to attack him to steal his horses and gold, but Jon insists that the old man is no threat to them. Orell and Tormund Giantsbane intend to kill the man so as to stop him from alerting the Night's Watch to their presence. However, when the party attacks the farmstead, Jon surreptitiously hits a rock with his sword, alerting the old man who flees; Jon also distracts Ygritte  when she tries to shoot the fleeing man with an arrow. While in the mill, Bran and Jojen Reed discuss how they plan to cross the Wall, before Meera spots the old horse breeder riding nearby. After the old man is captured by the wildlings, Hodor — scared by the thunder — begins yelling, which threatens to give away their location to the wildlings. Bran uses his warg abilities to enter Hodor's mind and cause him to pass out.\n\n    Summer attacks a Wildling.  \nOutside, Tormund moves to kill the old man, but Orell tells him to have Jon do it instead to prove his loyalty. Jon is ultimately unable to kill the innocent man, and instead Ygritte kills the man with an arrow. Realizing that Jon is still loyal to the Night's Watch, Tormund orders his men to kill Jon; Tormund restrains Ygritte to stop her trying to help Jon, and soon after Jon battles with Orell. At the urging of Jojen, Bran enters the mind of Summer, his direwolf, to aid Jon. Summer and Shaggydog kill two wildlings threatening Jon as he battles to the death with Orell and finally kills him. With the last of his strength Orell wargs into the mind of his pet eagle, which swoops down and attacks Jon, clawing him badly about the face before he beats the bird off. Jon then jumps to mount a nearby horse and escapes, leaving Ygritte and heading back to the Wall. \n\n    Jon kills Orell.  \nThat night Bran asks Osha to take Rickon (who would be heir to Winterfell if anything were to happen to Bran or Robb) to Last Hearth, the home of House Umber, while he, Meera and Jojen head through the Wall in search of the Three-eyed raven. Osha promises to look after Rickon and orders the Reed siblings to do the same with Bran before she, Rickon, and Shaggydog depart in the dead of night.\n\nA"},{"location":"At the Twins","content":"Robb Stark's army arrives at the Twins, the castle seat of House Frey, for his uncle Edmure's wedding. Enduring Lord Walder Frey's insults directed at him and his wife, Robb makes a public apology to Lord Frey's daughters and granddaughters for breaking his promise to marry one of them. Frey accepts the apology and offers the Starks and their men his hospitality.\nThat night Edmure is introduced to his bride Roslin Frey, discovering much to his relief that she is a beauty. The wedding and the feast that follows it are quite celebratory and lively affairs, with all the participants in high spirits. \n\n    Edmure and his new bride.  \nEdmure is clearly in love and his attentions are focused solely on his bride. As the celebrations reach their heights Lord Walder calls for the bedding ceremony. Robb agrees and the bride and groom are carried off to their wedding bed, Roslin carried off by the male guests and followed closely by Edmure, who is collected by the Frey women. Brynden Tully, having drunk too much wine, excuses himself from the celebration to \"find a tree to piss on.\"\nAfter they leave and the festivities begin to wind down, Catelyn becomes suspicious when she notices Black Walder Rivers close the banquet hall doors and the musicians in the gallery begin playing \"The Rains of Castamere\" – the song commemorating House Lannister's decisive and brutal victory against the rebellious House Reyne of Castamere years ago. Walder rises to make a toast to Robb, and Catelyn, seated beside Lord Roose Bolton, notices that the latter is wearing mail under his clothing. Realizing they are in a trap, Catelyn slaps Roose across the face and screams a warning to Robb, but by then it is too late. Lord Walder signals his men to attack. \n\n    Talisa is stabbed by Lame Lothar.  \nIn what becomes known as the infamous Red Wedding, Lothar draws a knife and repeatedly stabs the pregnant Talisa in the stomach, killing her unborn child. Talisa collapses to the ground as chaos surrounds. Before he can react, Robb is shot by the musicians with crossbows several times and falls to the ground. Numerous other Stark men are killed by the crossbow bolts or set upon by Frey soldiers. Catelyn is shot by one of the musicians in the back and falls to the ground.\nOutside, Arya Stark and the Hound, having arrived at the Twins in disguise, are turned away by Frey guards at the time the massacre begins. Arya gives Sandor the slip and sneaks past the gate guards, only to witness Frey men kill Stark soldiers and Grey Wind, Robb's direwolf. She makes a desperate run for the castle, but is stopped by the Hound, who tells her that it is too late. When Arya won't stop, Sandor knocks her unconscious before carrying her out of the castle to safety.\n\n    Grey Wind is shot dead by Frey crossbowman.  \nA wounded Catelyn crawls to safety beneath a table as Walder motions the soldiers to cease. Walder mocks Robb as he limps to his dying wife. He holds Talisa in his arms as she dies. Catelyn sees an opportunity and limps out from under the table to seize out from under Walder's table his cowering young wife, Joyeuse. Catelyn holds a knife to the girl's throat and threatens to kill her if Walder does not negotiate an end to the attack. Walder refuses her, recalling the previous betrayed oath made that Robb would marry his daughter. She begs they take her hostage and that Robb, who merely lingers despondent and heartbroken beside his wife's corpse, be allowed to leave. \n\n    Catelyn kills Walder Frey's wife, the Lady Joyeuse, moments before being killed herself.  \nHe questions why he should agree to such terms to which Catelyn responds by swearing on her honor as both a Tully and a Stark that if he does not let Robb go she will kill his wife. Walder chuckles and nonchalantly responds, \"I'll find another.\" Robb stands and utters, \"Mother\" as ​Roose Bolton, who had fled the hall when the massacre began, seizes Robb, whispering \"The Lannisters send their regards,\" before stabbing him in the heart. Robb maintains eye contact with Catelyn as he collapses to the floor. Mad with grief at the death of her firstborn son, Catelyn cries out in anguish and kills Walder's wife, fulfilling her promise. Now catatonic with grief, she stands there and accepts her fate, allowing Black Walder to slip up behind her and viciously cut her throat. She falls to the floor with a thud."}],"firsts":["Walda Frey","Arwaya Frey (first identified)","Derwa Frey","Waldra Frey","Janeya Frey","Neyela Frey","Serra Frey","Sarra Frey","Marianne Frey","Freya Frey","Merry Frey","Shirei Frey","Frey guard","Hog farmer","Old man","Wendel Manderly","Roslin Frey","Drummer"],"deaths":["Old man, killed by Ygritte","Orell, killed by Jon Snow","Queen Talisa Stark, stabbed repeatedly by Lothar Frey","Wendel Manderly, killed by a Frey soldier","Grey Wind, shot by Frey crossbowmen","King Robb Stark, stabbed in the heart by Roose Bolton","Lady Joyeuse Erenford, throat slit by Catelyn Stark","Lady Catelyn Stark, throat slit by Black Walder Rivers"],"cast":[{"actor":"Emilia Clarke","character":"Queen Daenerys Targaryen"},{"actor":"Kit Harington","character":"Jon Snow"},{"actor":"Richard Madden","character":"King Robb Stark"},{"actor":"Iain Glen","character":"Ser Jorah Mormont"},{"actor":"Michelle Fairley","character":"Lady Catelyn Stark"},{"actor":"John Bradley","character":"Samwell Tarly"},{"actor":"Isaac Hempstead-Wright","character":"Prince Bran Stark"},{"actor":"Maisie Williams","character":"Princess Arya Stark"},{"actor":"Oona Chaplin","character":"Queen Talisa Stark"},{"actor":"Rose Leslie","character":"Ygritte"},{"actor":"Rory McCann","character":"Sandor Clegane"},{"actor":"David Bradley","character":"Lord Walder Frey"},{"actor":"Mackenzie Crook","character":"Orell"},{"actor":"Michael McElhatton","character":"Lord Roose Bolton"},{"actor":"Ian McElhinney","character":"Ser Barristan Selmy"},{"actor":"Clive Russell","character":"Ser Brynden Tully"},{"actor":"Tobias Menzies","character":"Lord Edmure Tully"},{"actor":"Kristofer Hivju","character":"Tormund Giantsbane"},{"actor":"Natalia Tena","character":"Osha"},{"actor":"Thomas Brodie-Sangster","character":"Jojen Reed"},{"actor":"Ellie Kendrick","character":"Meera Reed"},{"actor":"Hannah Murray","character":"Gilly"},{"actor":"Ed Skrein","character":"Daario Naharis"},{"actor":"Jacob Anderson","character":"Grey Worm"},{"actor":"Nathalie Emmanuel","character":"Missandei"},{"actor":"Kristian Nairn","character":"Hodor"},{"actor":"Tom Brooke","character":"Lothar Frey"},{"actor":"Tim Plester","character":"Black Walder Rivers"},{"actor":"Kenneth Hadley","character":"a septon"},{"actor":"Art Parkinson","character":"Prince Rickon Stark"},{"actor":"Alexra Dowling","character":"Roslin Frey"},{"actor":"Sean Buckley","character":"a Old man"},{"actor":"A.J Kennedy","character":"a Frey guard"},{"actor":"Grace Hendy","character":"Merry Frey[1]"},{"actor":"Pat McGrath","character":"a hog farmer"},{"actor":"Kelly Long","character":"Lady Joyeuse Erenford"},{"actor":"Oddie Braddell","character":"Wendel Manderly"},{"actor":"Will Champion","character":"a drummer"},{"actor":"Katie Creaven","character":"Marianne Frey"},{"actor":"James Bleakney","character":"Frey Guard"},{"actor":"Laurence Doherty","character":"Frey Wedding Guest"},{"actor":"Darragh O'Connor","character":"Frey Wedding Guest"},{"actor":"Darran Watt","character":"Soldier"}]}
