{"title":"The Bear and the Maiden Fair","season":"3","episode":"7","date":"Sun May 12 2013","authors":["George R.R. Martin"],"directors":["Michelle MacLaren"],"info":"\"The Bear and the Maiden Fair\" is the seventh episode of the third season of Game of Thrones. It is the twenty-seventh episode of the series overall. It premiered on May 12, 2013. It was written by series creator George R.R. Martin and directed by Michelle MacLaren.","plot":"Dany exchanges gifts with a slave lord outside of Yunkai. As Sansa frets about her prospects, Shae chafes at Tyrion's new situation. Tywin counsels the king, and Melisandre reveals a secret to Gendry. Brienne faces a formidable foe in Harrenhal.","summary":[{"location":"At the Wall","content":"After surviving the perilous climb of the Wall, Jon Snow, Ygritte, and the wildlings led by Tormund Giantsbane make their way towards Castle Black  to await Mance Rayder's signal to begin the attack on the Night's Watch. Afterwards Jon confronts Orell about cutting his and Ygritte's rope loose on The Wall, nearly killing the both of them in the process. Orell tells Jon that he doesn't see Ygritte complaining about what happened because she is a wildling and understood what needed to be done in a pressure situation, also telling Jon that this is the reason he will never be able to keep her. During the journey through the woods, a clearly jealous Orell confronts Ygritte and says that he would be a better man for her than Jon Snow, while continuing to express his distrust in Jon. Jon also tries to persuade Ygritte that the wildlings' cause is doomed to failure, but she refuses to listen and points out that Jon is technically one of them; if it fails, so does he. She renews her passion for him and tells him bluntly that if they die, they die, but before they die they will live in each other.\n\nA"},{"location":"Across the Narrow Sea","content":"Daenerys Targaryen's army marches on to the next great city of Slaver's Bay, Yunkai. She and Barristan Selmy are confident they can take the city, given that Yunkai are famous for training bed slaves rather than soldiers.  Ser Jorah notes with wisdom however that Yunkai's defenders won't fight them in open battle, being more likely to hole up behind their walls and chip away at the Targaryen army with guerrilla tactics. He also advises Daenerys that conquering Yunkai does not help them with their main goal of pressing on to retake Westeros. Dany however is adamant on freeing the slaves of Yunkai, who number in the hundreds of thousands. She orders Grey Worm to send a messenger to the city and inform Yunkai's slaver rulers that they must either surrender or suffer the same fate as Astapor.\nThe Yunkish herald is carried into Daenerys's camp on a litter carried by slaves, along a road flanked by Unsullied. Missandei announces the newcomer as Razdal mo Eraz, one of the ruling \"Wise Masters\" of Yunkai. Daenerys meets the man in her pavilion, flanked by her dragons who vie for her attention and fight over the pieces of meat she tosses to them; they also snarl at Razdal when he gets too close. Razdal declares that Yunkai was an ancient civilization long before the rise of Valyria and that numerous armies throughout history have tried and failed to conquer it. However Daenerys is not threatened, commenting that a hard-fought battle would give her Unsullied much needed practice. Razdal tries a different tact, asserting there is no need for their factions to fight, that Yunkai is willing to overlook her attack on Astapor and will even provide her with the gold and ships needed to transport her army to Westeros. In exchange, they ask that Daenerys leave Yunkai in peace.\nDaenerys makes a counter-offer: she will spare the lives of Razdal and the slave-masters of Yunkai if every slave (men, women and children) in the city is set free, and given as much food, clothing and property as they can carry in payment for their services. She warns that if her offer is rejected, Yunkai will be shown no mercy. Razdal takes offense, promising that Yunkai will be more of a challenge for her than Astapor or Qarth, and threatens her with the retribution of Yunkai's \"powerful friends\" who he claims will take great pleasure in destroying her army and enslaving the survivors. At that, Drogon and his siblings roar in anger; Razdal protests that he was promised safe conduct, to which Daenerys counters that her dragons made no such promise and take offense to him threatening their mother. After the dragons prevent his slaves from reclaiming the chests of gold he brought with him, Razdal storms out of the pavilion, muttering curses. Daenerys tells Jorah to find out more about Yunkai's \"powerful friends\" before she commits herself to an attack on the city.\n\nI"},{"location":"In the Seven Kingdoms","content":"Traveling back from the Riverlands, a ship carrying Melisandre and Gendry leaves King's Landing and passes through Blackwater Bay. Melisandre stares at the broken wrecks of Stannis's fleet destroyed by the wildfire, asserting that her presence might have turned the tide of battle. She questions Gendry and is surprised to learn he is unaware of his father's real identity. As they pass by the Red Keep, Melisandre reveals to Gendry that he is King Robert Baratheon's bastard son.\nIn The North, on their way to the Wall, Bran Stark's party makes camp. Osha remains distrustful of Meera and Jojen Reed and reacts with horror when they mention they intend to go beyond the Wall. Osha bluntly refuses to go, explaining that she lost her husband, who then rose from the dead and tried to kill her. She rages that none of them understand what lies beyond the Wall and that there is nothing left for men there.\nAt the camp of the Brotherhood Without Banners, Arya, disillusioned with the Brotherhood for selling Gendry, takes an opportunity to escape and runs off into the night. Before she gets too far, however, she is snatched up by Sandor Clegane, who was lying in wait for her.\nIn the Riverlands, en route to The Twins, Robb Stark's army is forced to make camp, their progress delayed by heavy rain. Catelyn warns them that the prickly Lord Walder Frey will take the delay as a deliberate insult to him, but Edmure Tully points out that Frey is getting the wedding he wanted; his sister counters that he is getting a wedding, but not the one he wanted, glaring at her son and his wife as she says so, pointing out that Frey wanted one of his daughters wed to a king. Robb retorts that Edmure is the best match House Frey has been offered in its history. Later that night, as Robb and Talisa prepare for bed, she tells him she is pregnant with his child. Robb is gladdened by the news.\nAt his prison, Theon Greyjoy is released from the cross to which he is chained by two beautiful girls. The women lay Theon down on a bed and then proceed to dramatically seduce him. They say repeatedly that they have heard that the heir to Pyke is well endowed and are hoping to get first hand experience. Theon is distrustful at first, fearing that this is another of his tormenter's tricks. Theon cannot help himself but be aroused when one of the women who has become naked straddles him and begins a rocking motion. Suddenly, the familiar horn sounds and the boy enters. Theon is terrified and tries to escape, but is struck hard on the head and is flung to the ground. The boy claims he too has heard about Theon's famous body part and announces it must very well be his favorite body part. When the sadistic youth brandishes an odd knife, Theon realizes the boy means to remove his penis. Horrified, Theon begs for mercy, but the boy quips that this is mercy as he's not killing Theon, merely altering him. Two large men hold a screaming Theon down while the boy moves in to castrate him.\nAt King's Landing, neither Sansa or Tyrion are particularly happy about their impending marriage. Margaery Tyrell consoles Sansa, reminding her that Tyrion is far from the worst Lannister and that Tyrion might be able to make her happy, given his skill as a lover. Bronn, meanwhile, points out to Tyrion that he can easily wed Sansa and get a son and heir from her to placate his father and keep having sex with Shae in private, thereby getting two women and a kingdom to rule for himself. However, Tyrion is concerned his mistress isn't going to be so willing to go along with that plan and is less than enthusiastic about having a wife, a mistress and the entire North despising him. Bronn points out that Tyrion is wasting his time trying to be universally loved. Tyrion's fears prove accurate as Shae bluntly tells him that she will no longer sleep with him after he weds Sansa.\nMeanwhile, Tywin Lannister enters the throne room to answer a summons from King Joffrey. After exchanging some false courtesy Tywin asks why his grandson wished to see him. Joffrey wants an update on what the Small Council has been doing. Tywin informs Joffrey that the king can attend any Small Council meeting should he desire it. The boy king claims that he is too busy to attend said meetings and demands to know why the location of the council meetings has changed. Tywin says that he is holding the meeting in the Tower of the Hand to save time. When Joffrey complains that he would have to climb too many steps should he wish to sit in on a small council meeting, Tywin silently ascends the steps to stand next to the throne, silently glares down at Joffrey, and then sardonically says he could arrange to have Joffrey carried. A disconcerted Joffrey changes the subject to Daenerys Targaryen; Tywin is surprised that Joffrey even knows about the exiled princess. Tywin admits the reports are apparently true that the last Targaryen is not only alive, but has successfully hatched the first live dragons the world has seen in almost two centuries. Joffrey is puzzled at why Tywin doesn't think they should do anything about her, but Tywin reminds Joffrey that the last Targaryen dragons were stunted inbred creatures who weren't a threat to anyone, and Daenerys' dragons are probably just curiosities at best, not grand weapons of war. Moreover, Tywin says that even if Daenerys' dragons do turn out to be as strong as the dragons of centuries long ago, they are on the far side of the world and no threat to Joffrey's rule. Tywin also warns his grandson that he should heed his advisor's council on matters he does not comprehend. When Joffrey protests that he hasn't been counseled on anything, Tywin says he is being advised at this very moment and says that he will inform Joffrey should he deem it necessary. Before taking his leave Tywin smiles slightly with an even slighter bow leaving a browbeaten Joffrey squirming on the Iron Throne. Their exchange leaves no doubt as to who is really ruling the kingdom.\nAt Harrenhal, Jaime speaks one last time to Brienne before he leaves. Jaime remarks that he owes Brienne a debt for both keeping him alive on their journey and for giving him a reason to live to rouse him from his suicidal depression after losing his hand. Brienne tells Jaime to repay his debt by keeping his pledge. Jaime promises that he will keep his word to return Catelyn Stark's daughters to her.\nThe next day, Jaime leaves Harrenhal in the company of Qyburn (who is to accompany Jaime to continue treating his arm in the hopes of getting his Maester's chain restored through Lord Tywin's influence- Jaime jokes that his father will make Qyburn Grand Maester if he grows Jaime a new hand) and a number of Bolton soldiers under the command of Steelshanks, one of Lord Bolton's captains. Lord Roose Bolton, who is also about to depart Harrenhal for the Twins, under orders from Robb Stark, requests that Jaime pass on his regards to Tywin; Jaime asks that Bolton do the same for him with Robb. Locke, who has been left in charge of the castle in Bolton's absence, can't resist poking fun at the departing Jaime and sneers that he will 'take good care' of Brienne, though Jaime doesn't rise to the bait.\nWhen their party makes camp, as Qyburn checks Jaime's stump, Jaime questions how the former Maester lost his chain. Qyburn explains that he lost it for performing vivisections on the sick and dying in a bid to better understand illness. Jaime is disgusted by this revelation, but Qyburn counters what he learned has saved numerous more lives and questions Jaime on how many he has killed compared to how many he's saved. Jaime responds that he has probably killed thousands, but he saved half a million lives when he killed the Mad King to save the population of King's Landing, much to Qyburn's surprise.\nJaime then asks about Brienne; Qyburn confirms that they sent a raven to her father, Lord Selwyn Tarth, and he offered a ransom of 300 Gold Dragons for his daughter's safe return. However, Locke refused the offer; still under the misapprehension that Tarth owns every sapphire mine in Westeros, Locke is convinced Lord Selwyn is trying to cheat him. When Qyburn mentions that most of the men would rather get some meager entertainment out of killing Brienne before they die in battle or winter, Jaime, feeling guilty because his lie to protect Brienne has invertantly placed her in greater danger, urges Steelshanks to return to Harrenhal. Though the man initially refuses, Jaime uses the promise of a reward and the threat of Tywin Lannister's retribution to convince him to go back.\nUpon arriving at Harrenhal, Jaime is shocked and furious to find Locke and his cronies have thrown Brienne into a bear pit, facing an angry bear with only a wooden sword to defend herself, as they all mockingly sing The Bear and the Maiden Fair. Jaime orders Locke to pull her out and offers to pay whatever ransom he wants, but Locke dismisses the offer, getting more satisfaction out of the spectacle of Brienne being torn apart. In desperation, Jaime leaps into the pit to help her; before the bear can harm either of them, Steelshanks shoots it with a crossbow, distracting the beast long enough for Jaime and Brienne to be pulled out of the pit. Locke tries to stop them from leaving, but Jaime angrily tells him that Lord Bolton cares more about getting him back to King's Landing alive than keeping one of his pet thugs happy, and backed up by Steelshanks and his men, Locke is unable to stop them. Jaime then departs Harrenhal with his escort and Brienne in tow."}],"firsts":["Razdal mo Eraz","Myranda","Violet","Steelshanks","Ser Balon Swann"],"deaths":[],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Nikolaj Coster-Waldau","character":"Ser Jaime Lannister"},{"actor":"Emilia Clarke","character":"Queen Daenerys Targaryen"},{"actor":"Kit Harington","character":"Jon Snow"},{"actor":"Richard Madden","character":"King Robb Stark"},{"actor":"Iain Glen","character":"Ser Jorah Mormont"},{"actor":"Michelle Fairley","character":"Lady Catelyn Stark"},{"actor":"Charles Dance","character":"Lord Tywin Lannister"},{"actor":"Natalie Dormer","character":"Lady Margaery Tyrell"},{"actor":"Carice van Houten","character":"Melisandre"},{"actor":"Isaac Hempstead-Wright","character":"Prince Bran Stark"},{"actor":"Sophie Turner","character":"Princess Sansa Stark"},{"actor":"Maisie Williams","character":"Princess Arya Stark"},{"actor":"Alfie Allen","character":"Prince Theon Greyjoy"},{"actor":"Oona Chaplin","character":"Queen Talisa Stark"},{"actor":"Jack Gleeson","character":"King Joffrey Baratheon"},{"actor":"Joe Dempsie","character":"Gendry"},{"actor":"Sibel Kekilli","character":"Shae"},{"actor":"Rose Leslie","character":"Ygritte"},{"actor":"Jerome Flynn","character":"Ser Bronn"},{"actor":"Rory McCann","character":"Sandor Clegane"},{"actor":"Mackenzie Crook","character":"Orell"},{"actor":"Gwendoline Christie","character":"Brienne of Tarth"},{"actor":"Richard Dormer","character":"Lord Beric Dondarrion"},{"actor":"Paul Kaye","character":"Thoros of Myr"},{"actor":"Noah Taylor","character":"Locke"},{"actor":"Natalia Tena","character":"Osha"},{"actor":"Anton Lesser","character":"Qyburn"},{"actor":"Michael McElhatton","character":"Lord Roose Bolton"},{"actor":"Clive Russell","character":"Ser Brynden Tully"},{"actor":"Tobias Menzies","character":"Lord Edmure Tully"},{"actor":"Ian McElhinney","character":"Ser Barristan Selmy"},{"actor":"Iwan Rheon","character":"Ramsay Snow"},{"actor":"Kristofer Hivju","character":"Tormund Giantsbane"},{"actor":"Thomas Brodie-Sangster","character":"Jojen Reed"},{"actor":"Ellie Kendrick","character":"Meera Reed"},{"actor":"Nathalie Emmanuel","character":"Missandei"},{"actor":"Jacob Anderson","character":"Grey Worm"},{"actor":"Kristian Nairn","character":"Hodor"},{"actor":"Philip McGinley","character":"Anguy"},{"actor":"George Georgiou","character":"Razdal mo Eraz"},{"actor":"Jamie Michie","character":"Steelshanks"},{"actor":"Charlotte Hope","character":"Myranda"},{"actor":"Stephanie Blacker","character":"Violet"},{"actor":"Art Parkinson","character":"Prince Rickon Stark"},{"actor":"Bart the Bear","character":"the eponymous bear."},{"actor":"Michael Stuart","character":"Bolton Guard"}]}
