{"title":"Walk of Punishment","season":"3","episode":"3","date":"Sun Apr 14 2013","authors":["David Benioff","D.B. Weiss"],"directors":["David Benioff "," D.B. Weiss"],"info":"\"Walk of Punishment\" is the third episode of the third season of Game of Thrones. It is the twenty-third episode of the series overall. It premiered on April 14, 2013. It was written and directed by executive producers David Benioff & D.B. Weiss, marking their directorial debut for the series.","plot":"Tyrion gains new responsibilities; Jon is taken to the Fist of the First Men; Daenerys meets with the slavers; Jaime strikes a deal with his captors.","summary":[{"location":"Across the Narrow Sea","content":"In Astapor, Daenerys, accompanied by Ser Jorah Mormont and Ser Barristan Selmy, walks along a sea wall known as the \"Walk of Punishment.\" Here, any slave who showed insubordination of any type is strapped to a cross and left to die out in public, as a warning to all other slaves. Daenerys offers a condemned man water, but he refuses to drink, saying he just wants to die quickly.\nJorah and Barristan continue to disagree on whether or not Daenerys should purchase the Unsullied. Jorah insists that it is their only chance to get an army, but Barristan believes this is not the honorable way, as slavery is illegal and abhorred in the Seven Kingdoms. Jorah claims that not only will the slave soldiers be treated better in her service, but innocent people will also be spared in war because the Unsullied only do as they are ordered. They have no human or masculine urges in their bodies, and therefore will not kill civilians or rape innocent women, unlike most male soldiers who would succumb to those urges in the heat of battle. Barristan retorts that when her older brother Rhaegar led his army in the Battle of the Trident, men fought and died for Rhaegar because they believed in him, because they loved him - not because they were slave soldiers whose free will had been stripped away. Jorah responds that Rhaegar indeed fought honorably and nobly, but that in the end Rhaegar died. Daenerys was born months after Robert Baratheon killed Rhaegar at the Battle of the Trident, and only knew her cruel and half-mad brother Viserys, so she asks Ser Barristan if he knew Rhaegar. Selmy was a member of the Targaryen Kingsguard and thus knew Rhaegar well: he fought beside him and bled beside him at the Trident. Barristan says that Rhaegar was the finest man he ever met, the last dragon. Daenerys grows quiet and says she wishes she'd known her older brother, but that Rhaegar was not the last dragon (she is).\nDaenerys speaks with Kraznys mo Nakloz, as he shows her his slave soldiers, the Unsullied. He repeatedly insults and mocks Daenerys in his native tongue, leaving his slave translator Missandei of Naath to clean up his crude and very insulting words into more respectful language. At one point, she pauses, wondering how to twist a particularly coarse insult from Kraznys, and Daenerys notices her reluctance to directly translate.\nDaenerys says she will take all 8,000 Unsullied soldiers, including those in training. Kraznys laughs and retorts that she can barely afford 100 Unsullied. Daenerys surprises him by telling him she has dragons, and is willing to trade one. This offer stops Kraznys in his tracks, yet Daenerys repeatedly affirms that he may only have one of her dragons. They strike a deal that she may have all the Unsullied soldiers in exchange for her biggest dragon. Both Jorah and Selmy strongly object, and plead to Daenerys that while soldiers are valuable, it is dragons that will ultimately win her the Iron Throne. She ignores them, and concludes the deal with Kraznys, and also demands Missandei as a token of faith. Upon leaving the room, she scolds Jorah and Selmy, telling them that while she values their advice, they should never again question her in public.\nDaenerys speaks with Missandei and asks her if she has a family; she says no. Daenerys tells her of the man who turned down her offer of water, and asks why he would simply say, \"Let me die.\" Missandei replies that in the afterlife, there is no master. Thus, the man would rather be dead than alive in the Slavers Bay. Daenerys proceeds to explain the dangers Missandei will be facing in Daenerys's service and asks if that will be a problem. Missandei simply replies, \"Valar morghulis\" (\"all men must die\"). Daenerys acknowledges the truth of the words, but quips, \"We are not men.\"\n\nB"},{"location":"Beyond the Wall","content":"Horses' remains specially arranged by the White Walkers  \nThe Free Folk army of King-Beyond-the-Wall, Mance Rayder, including Jon Snow, arrive at the Fist of the First Men. They survey the bloody aftermath of assault on the Night's Watch by the White Walkers and their army of undead wights. Mance grimly remarks that the White Walkers are \"always the artists\": the severed corpses of all of the Watch's horses have been carefully arranged into a large-scale, ceremonial spiral pattern. However, there is no sign of any human corpses - which Orell insists were there when he scouted ahead earlier by warging into his eagle, but have now vanished. Jon says that there were three hundred men of the Night's Watch at the Fist, and asks Mance if Mormont could still be alive. Mance says that with Mormont, it's possible he was able to escape, but that even if he did he and his men took quite a beating and are trapped miles away from the Wall with the White Walkers in close pursuit. Mance warns Jon that all of the missing corpses from the Fist are no longer his friends and brothers from the Night's Watch, but have been resurrected as undead monsters who serve the White Walkers.\nMance orders Tormund to take a force of twenty men to scale The Wall to attack Castle Black from its exposed rear. The fortresses of the Night's Watch were purposefully built to only defend from attack over the Wall, without defenses on their southern sides, so they wouldn't be a threat to the lords of the Seven Kingdoms. Mance's plan is for Tormund's small band to distract Castle Black by attacking their exposed southern side, at which point Mance's main army will assault it from the north. Tormund will know that Mance is in position when his army makes a massive signal fire; Mance boasts that \"I'm going to make the biggest fire the North has ever seen!\" Mance orders Tormund to take Jon with him, as Jon knows the layout of Castle Black, and it will prove a key test of his loyalty: if it turns out that he won't really betray the Night's Watch, Tormund can easily throw him off the Wall to his death.\nFarther south, Lord Commander Jeor Mormont leads the ragged survivors of the Night's Watch expedition to Craster's Keep. Craster mocks the survivors of the Battle of the Fist of the First Men when they reach his Keep. He initially wants to refuse them shelter until he notices some of them stroking their weapons. Fearful that in desperation they might try to rush him, he relents. As the black brothers warm by his hearth, Craster mocks them. Craster insists that the black brothers should be grateful for his generosity, and that he is a \"godly man\" for helping them. Mormont tensely questions Craster's claim to be a godly man, but Craster insists that he is - to the \"real gods,\" the White Walkers, who consume entire armies on their way to the Wall but will spare Craster for his loyalty. He admits that he's feeding his pigs better than them - as pigs are valuable to him - and half-seriously suggests to his guests that they should eat the fat Samwell Tarly. He is also annoyed by Gilly's loud wailing from birthing pains. Sam leaves the main house to a birthing hut where he witnesses Gilly giving birth with the aid of a few other women. To her horror, the baby is a boy. Sam and Gilly wordlessly realize that Craster will want to sacrifice him to the White Walkers.\n\nI"},{"location":"In the Seven Kingdoms","content":"Brynden takes aim  \nAt Riverrun in the Riverlands, the castle-seat of House Tully, the funeral of the recently deceased Lord Hoster Tully is held on the banks of the Red Fork of the Trident River. King Robb Stark has arrived with the main force of the Northern army, and he helps launch his maternal grandfather's funeral boat, along with Hoster's younger brother Brynden \"The Blackfish\" Tully. Catelyn and Robb's new wife Queen Talisa look on with the assembled crowd of bannermen on the dock. Hoster's youngest child, Catelyn's younger brother Edmure Tully, attempts to light the funeral boat on fire with a flaming arrow but fails three times. Just as the boat is about to disappear around a bend of the river, Brynden pushes his nephew out of the way and skillfully makes the shot. Knowing his accuracy was true and the shot would hit the boat, the Blackfish turns around to walk away (dismissively showing up Edmure at the same time) as soon as he releases the arrow.\nIn Catelyn's old chamber in the castle, she mourns with her uncle Brynden over her father's death. She asks him if he made peace with his older brother, with whom he had been fighting for the past thirty years. Brynden explains that he did: on his deathbed Hoster told him to stop calling himself \"the Blackfish\" as it was a stupid joke created over thirty years ago by Brynden to symbolize his bad relationship with his older brother, and it wasn't very funny to begin with. Brynden emotionally joked back to his dying brother that people had been calling him \"Blackfish\" for so long that they'd practically forgotten his real name. Catelyn is happy that her uncle was able to make peace with her father before he passed, and is upset that she couldn't have been there. She reminisces that she watched from this window in her childhood whenever her father left, but now he won't be coming back. She tearfully wonders if her sons Bran and Rickon similarly watched at Winterfell for her return when she failed to arrive to save them. Brynden insists that neither he nor Robb have given up hope that the boys may be alive and in hiding, and urges her to be strong for Robb.\n\n    Tyrion is fascinated at Pod's ability to pleasure women.  \nKing Robb, Brynden, and Edmure confer in Riverrun's meeting room. The war is not going well for them. The Lannisters have defeated their enemies in the south and secured King's Landing from attack, as well as a marriage-alliance with House Tyrell. They have superior numbers, wealth, and strategic position. Edmure begins to speak of his recent victory at the Battle of Stone Mill, which pushed the Lannister army under Ser Gregor Clegane from the Riverlands. Robb and Brynden, however, are furious with Edmure: their grand strategy was to lure Tywin and Gregor's armies into the Westerlands, where they would be vulnerable, out of position, and unable to defend the capital against the Baratheons. Edmure's role in this was to offer token defense as a feint to lure the Lannisters back west across the Red Fork of the Trident. Instead, by successfully attacking the Lannisters at Stone Mill, Edmure kept them penned in the Riverlands, and thus close enough to King's Landing that Tywin was able to rush to the defense of the city at the Battle of the Blackwater. The Starks' strategic position in the war has been ruined. Edmure insists that they took valuable captives in the battle, Willem and Martyn Lannister, but Robb angrily points out that he didn't stop fighting because his sisters are held captive. Considering that Tywin didn't stop to negotiate when his own eldest son was captured, taking his younger nephews hostage will have no impact on the war. Edmure tries to at least point out that they lost only two hundred men at Stone Mill and multiple Lannister soldiers died for every man they lost, at which Robb cuts him off and shouts that they need their men more than Tywin Lannister needs his (who already outnumber the Starks significantly). At this point, the Lannisters are in such a good strategic position that they can afford to be patient, and grind down Robb's forces through simple attrition.\nIn the prison cells at Riverrun, Queen Talisa bandages the minor wounds of Willem and Martyn Lannister. They are boys, only 14 and 15 years old. One of them asks if Robb really transforms into a wolf eats the flesh of his enemies. Talisa says yes - but that he does not eat the flesh of children, except during the full moon. She asks a guard if it's currently a full moon, and reassures the now terrified child that he is safe.\n\n    Wolf Bread  \nAt King's Landing, Tywin Lannister calls the first meeting of the Small Council since he arrived in the city and assumed his position as Hand of the King. He has the meeting place changed to a room next to his own quarters in the Tower of the Hand, asserting his dominance. Tywin arrives early and has all of the council members called in at once. All of the seats are on one side of the table, as a non-verbal test to see how each of them reacts around him. Petyr Baelish ambitiously pushes his way past everyone else to be the one who sits closest to Tywin. Varys rolls his eyes at Littlefinger's naked ambition and lets him pass, content to sit in the second-closest seat (for now). Grand Maester Pycelle, who is most focused on survival by avoiding direct conflict, doesn't try to fight over a better seat with either of them, instead quietly taking the third seat away from Tywin. Tywin's daughter Cersei arrives to find the seats are all occupied, but not wanting to play that game and be relegated to a lowly position, she pulls up a chair so she is sitting at Tywin's right hand, opposite Littlefinger. Tyrion is the only one who even mildly stands up to Tywin's posturing, by not even trying to sit closest to Tywin: instead he takes a new chair and makes a point of noisily dragging it across the ground until it is positioned at the exact opposite end of the table from his father.\nTywin is upset with the three advisors, noting that between them, they possess the greatest number of spies in the world, yet none of them can locate his son Jaime, even though the entire Northern army has heard of his escape. Tywin asks what news there is of the war, and Varys reports that Robb has taken the bulk of his army to Riverrun for his grandfather's funeral, while leaving Lord Roose Bolton in command of Harrenhal. Varys makes a jab at Littlefinger's recent, titular promotion as Lord of Harrenhal, noting that this makes Roose Bolton the current Lord of Harrenhal in practice if not in name. However, Tywin says that Roose can keep it, because the title alone is enough to give Littlefinger the social standing to be a suitor to Lady Lysa Arryn. Littlefinger states that they have known each other since childhood, and Lysa has always adored him, and thus she will soon remarry to him. Pycelle notes that this will make Littlefinger the acting Lord Paramount of the Vale, an even more important position (Baelish is even wearing a more expensive tunic than usual, laced with gold, to reflect his new status). \n\n    Theon is nearly raped by his torturer.  \nTywin states that this will confirm that the Vale of Arryn, which has been neutral in the war up to now, will not support Robb Stark, who is increasingly being hemmed in by enemies (other marriage alliances, with House Tyrell of the Reach and House Martell of Dorne, combined with the crushing of the Baratheons, have in turn secured the rest of southern Westeros under Lannister control). Tyrion points out that if Baelish departs for the Vale that leaves a vacancy on the Small Council, and Tywin reveals that he has appointed Tyrion as the new Master of Coin to replace him. While this may seem like giving Tyrion a position of relative power again, Tyrion quickly points out that he has no prior experience in finance. With backhanded compliments, Cersei makes it clear that this promotion is really intended to give him an opportunity to make mistakes he will be blamed for.\nAfter the meeting, Tyrion, Podrick Payne, and Ser Bronn drop by Littlefinger's office in his brothel, where he keeps his ledgers. Pod loads them all into a cart as Ros flirts with him. Littlefinger says it was the safest place to keep such records, but Tyrion notes that his brothel hasn't been the safest place for bastards. Baelish says he hopes Tyrion does well in the position, as he owes him for securing the release of Ros (after Cersei arrested her, mistaking her for Shae) but Tyrion says it was just a misunderstanding. Tyrion and Bronn then lead Pod into another room of the brothel, where Tyrion says that he wants to reward him for saving his life during the Battle of the Blackwater: he has paid for Podrick (who has never had sex with a woman) to enjoy the services of not one, but three prostitutes: Marei, Genna, and a contortionist named Kayla (one of only four women in the world who can properly perform a \"Meereenese Knot\").\nLater, Tyrion is reading through the financial records, and explains to Bronn that not all is as Baelish would like the court to think. Bronn asks if he thinks Littlefinger has been stealing to obtain the crown's money, but Tyrion says the problem is more that he's been borrowing all of it. Littlefinger always acted like he was a financial genius who could raise money seemingly out of nowhere, but in reality the Iron Throne is heavily in debt, and Littlefinger procured enough money to balance the books every year by borrowing massive sums of money from foreign banks. \n\n    Brienne is beaten down as the captors prepare to rape her.  \nIn particular, much of their debt is owed to the Iron Bank of Braavos, the largest bank in the Free Cities. Tyrion warns Bronn that when debtors to the Iron Bank cannot repay their loans, the Iron Bank will first refuse to give out new loans, and ultimately support rebellions against them. Tyrion fears that if they can't repay the debt, the Iron Bank will eventually cut them off and start supporting Robb Stark or Stannis Baratheon. Podrick then returns, with the money Tyrion gave him to pay the prostitutes. Tyrion is concerned that he lost heart and fled, but Pod innocently says he did \"all sorts of things\" with the prostitutes - they simply refused his offer of payment. Impressed that the women would provide their services for free, Tyrion and Bronn ask Pod to explain in detail what transpired, so they can take \"copious notes.\"\nAt Dragonstone, King Stannis Baratheon speaks with Melisandre as she prepares to depart by boat. He is worried that his enemies think he is defeated and are laughing at him, and that now even she is abandoning him. She assures him that she still thinks he is the Lord's Chosen, but she must travel to the Riverlands to obtain something vital for his cause. Stannis says that he wants her, and that he wants Joffrey and Robb dead, and asks her to make \"a son\" again with him (like the Shadow-creature she conjured to assassinate Renly). Melisandre says that she cannot: creating a shadow-creature drains some of the fire of a man's life-force, and she fears that creating another would kill Stannis. Over his protests, she explains that what she is seeking is even more powerful than a shadow-creature, and will change his fortunes in this war, but she needs a king's blood to do it. Stannis doesn't understand, but Melisandre implies that she needs to burn a human sacrifice who possesses a king's blood as an offering to the Lord of Light. She can't kill Stannis himself to achieve this, but as she points out, \"There are others with your blood in their veins\" - any of his brother King Robert's bastard children who managed to survive the purge.\nAt the Inn at the Crossroads in the Riverlands, Arya Stark, Gendry, and Hot Pie are still in the company of the Brotherhood Without Banners, who are preparing to depart. Gendry has finished fixing a steel breastplate which Thoros puts on, and Arya asks why Gendry is helping them. Thoros says that they're not prisoners, it's just that the war-torn Riverlands aren't a safe place for Ned Stark's daughter. Arya notices that they are loading Sandor \"The Hound\" Clegane into a prisoner cart, so she walks over and angrily asks him if he remembers the last time he was here, but he simply says all poor inns look the same. \n\n    Jaime loses his sword-hand  \nAs they get ready to leave, Hot Pie explains that he isn't going with them: he baked some bread for the innkeeper, and as he was a baker's apprentice when he lived in King's Landing, the innkeeper thought it was the best bread they'd ever had, and offered him a job. This life of fighting and travelling isn't really for him, plus Thoros formally made a deal with the innkeeper to pay for the free meals they enjoyed with Hot Pie's services. Before they go, he gives Arya a present he made for her: a loaf of bread shaped like a direwolf, though Arya implies the tail looks like a head. Arya is a bit brusque but the three wish each other well as they depart, and as they are riding away Arya starts eating the wolf-bread, and turns back to shout to Hot Pie that it is very good.\nAt an undisclosed location, Theon Greyjoy escapes from the dungeon with the help of a young man, who gives him a horse and tells him to ride east. Theon thanks him and says he'll make him a lord of the Iron Islands for this, but the boy says that they aren't in the Iron Islands now. Theon is later hunted down by his captors in a prolonged chase on horseback through the woods. Ultimately his pursuers split into two groups and trap Theon between them, and he is knocked off his horse with a flail. Theon's captors pin him to the ground, and pull down his pants: the leader declares that he intends to rape Theon as punishment for trying to run away. However, Theon's unidentified savior returns and snipes all of the captors from afar using his bow, rescuing him at the last minute.\nSomewhere else in the Riverlands, Jaime Lannister and Brienne of Tarth have been taken captive by Locke and a detachment of men from House Bolton. As they ride along, the men sing a rousing chorus of The Bear and the Maiden Fair. Tied up back to back on one of the horses, Jaime warns Brienne that when they make camp for the night, they will rape her, more than once, and that his honest advice is to give no resistance, and just think of Renly. They were only sent to capture Jaime, therefore Brienne means nothing to them, so at the slightest provocation they will kill her without hesitation. Brienne says she will fight even if they kill her, and Jaime agrees that if he were a woman, he would fight to the death before being raped, too.\nLater that night Locke's men make camp, and do indeed drag Brienne kicking and screaming into the bushes to gang-rape her. Jaime is disgusted by this pointless brutality, so he points out to Locke that Brienne is actually a noblewoman and the sole heir of Lord Selwyn of Tarth, the \"Sapphire Isle,\" and her father will pay them a ransom of her weight in sapphires - provided that she is unharmed. Locke agrees and calls his men back before they are able to rape Brienne, and they tie her up to a tree again. Jaime tries to smooth-talk Locke once again with offers of how his father Tywin will make him extravagantly rich if he lets Jaime go. Tiring of Jaime's frequent attempts to bribe him into turning over to the Lannister side, Locke decides to prove that Jaime's father will never deal with the likes of him. At first Locke has his men untie Jaime on the pretext of letting him go, but then his men hold him down on a chopping block while Locke grabs a carving knife, threatening to stab Jaime in the eye. Locke reasons that maiming Tywin's son will be the ultimate proof that the Lannisters would never deal with Locke, much less bribe him. Locke says that Jaime's father can't help him now, and \"this should help you remember!\" - as he swings down the carving knife and hacks off Jaime's sword-hand. For half a second, Jaime stares at his severed right hand in shock, before what just happened can register in his mind and then he begins to scream in horror."}],"firsts":["Lord Hoster Tully (Deceased)","Ser Brynden \"The Blackfish\" Tully","Lord Edmure Tully","Martyn Lannister","Willem Lannister","Karl Tanner","Craster's wife","Gilly's baby","Tortured slave","Greizhen mo Ullhor","Genna","Kayla"],"deaths":["Master Torturer, shot with an arrow by Ramsay Snow"],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Nikolaj Coster-Waldau","character":"Ser Jaime Lannister"},{"actor":"Lena Headey","character":"Queen Cersei Lannister"},{"actor":"Emilia Clarke","character":"Queen Daenerys Targaryen"},{"actor":"Kit Harington","character":"Jon Snow"},{"actor":"Richard Madden","character":"King Robb Stark"},{"actor":"Iain Glen","character":"Ser Jorah Mormont"},{"actor":"Michelle Fairley","character":"Lady Catelyn Stark"},{"actor":"Aidan Gillen","character":"Lord Petyr Baelish"},{"actor":"Charles Dance","character":"Lord Tywin Lannister"},{"actor":"Stephen Dillane","character":"King Stannis Baratheon"},{"actor":"Carice van Houten","character":"Melisandre"},{"actor":"Alfie Allen","character":"Prince Theon Greyjoy"},{"actor":"John Bradley","character":"Samwell Tarly"},{"actor":"Maisie Williams","character":"Princess Arya Stark"},{"actor":"Oona Chaplin","character":"Queen Talisa Stark"},{"actor":"Joe Dempsie","character":"Gendry"},{"actor":"Rose Leslie","character":"Ygritte"},{"actor":"James Cosmo","character":"Lord Commander Jeor Mormont"},{"actor":"Conleth Hill","character":"Lord Varys"},{"actor":"Jerome Flynn","character":"Ser Bronn"},{"actor":"Rory McCann","character":"Sandor Clegane"},{"actor":"Ciarán Hinds","character":"Mance Rayder"},{"actor":"Robert Pugh","character":"Craster"},{"actor":"Ian McElhinney","character":"Ser Barristan Selmy"},{"actor":"Gwendoline Christie","character":"Brienne of Tarth"},{"actor":"Mackenzie Crook","character":"Orell"},{"actor":"Paul Kaye","character":"Thoros of Myr"},{"actor":"Clive Russell","character":"Ser Brynden Tully"},{"actor":"Tobias Menzies","character":"Lord Edmure Tully"},{"actor":"Kristofer Hivju","character":"Tormund Giantsbane"},{"actor":"Julian Glover","character":"Grand Maester Pycelle"},{"actor":"Iwan Rheon","character":"Ramsay Snow"},{"actor":"Noah Taylor","character":"Locke"},{"actor":"Mark Stanley","character":"Grenn"},{"actor":"Ben Crompton","character":"Eddison Tollett"},{"actor":"Luke Barnes","character":"Rast"},{"actor":"Burn Gorman","character":"Karl Tanner"},{"actor":"Hannah Murray","character":"Gilly"},{"actor":"Ben Hawkey","character":"Hot Pie"},{"actor":"Esme Bianco","character":"Ros"},{"actor":"Daniel Portman","character":"Podrick Payne"},{"actor":"Philip McGinley","character":"Anguy"},{"actor":"Dan Hildebr","character":"Kraznys mo Nakloz"},{"actor":"Nathalie Emmanuel","character":"Missandei"},{"actor":"Michael Shelford","character":"Master Torturer"},{"actor":"Clifford Barry","character":"Greizhen mo Ullhor[1]"},{"actor":"Gary Lightbody","character":"Bolton soldier"},{"actor":"Michelle Costello","character":"Craster's wife"},{"actor":"Lisa Walsh","character":"Craster's younger wife"},{"actor":"Josephine Gillan","character":"Marei"},{"actor":"Kylie Harris","character":"Genna"},{"actor":"Pixie Le Knot","character":"Kayla"},{"actor":"Dean-Charles Chapman","character":"Martyn Lannister"},{"actor":"Timothy Gibbons","character":"Willem Lannister"},{"actor":"Mark Drake","character":"a tortured slave[2]"},{"actor":"Dennis McKeever","character":"Othell Yarwyck"},{"actor":"Christopher Newman","character":"Lord Hoster Tully​"},{"actor":"Matt Butcher","character":"Riverrun Nobleman"},{"actor":"Tyrone Kearns","character":"Brotherhood Member"}]}
