{"title":"Book of the Stranger","season":"6","episode":"4","date":"Sun May 15 2016","authors":["David Benioff","D.B. Weiss"],"directors":["Daniel Sackheim"],"info":"\"Book of the Stranger\" is the fourth episode of the sixth season of Game of Thrones. It is the fifty-fourth episode of the series overall. It premiered on May 15, 2016. It was written by David Benioff and D.B. Weiss, and directed by Daniel Sackheim.","plot":"Tyrion strikes a deal. Jorah and Daario undertake a difficult task. Jaime and Cersei try to improve their situation. Jon and Sansa reunite.","summary":[{"location":"In King's Landing","content":"Underneath the Great Sept of Baelor, Septa Unella enters Queen Margaery Tyrell's cell and leads her to a private meeting with the High Sparrow. The High Sparrow asks her what she would do if he allowed her to leave that day. Margaery replied that she wants to return to her family and her husband Tommen Baratheon. The High Sparrow respects her love for her family but tells her that attachment leads to sin, citing his experience as a cobbler. Margaery manages to impress the Sparrow with her knowledge of The Book of the Stranger, which she admits Septa Unella had read at her. The High Sparrow chuckles and agrees that Unella has a habit of reading at people instead of to them.\nThe High Sparrow recounts how in his youth he was a womanizer and drunkard. He underwent a conversion experience the morning after an orgy, as his drunken guests lay naked all around his house. Tired of what he was now perceiving as a meaningless existence, the High Sparrow then turned his life around and became a devoted member of the Faith of the Seven. He then left his job as a cobbler and devoted his life to the poor and destitute. Believing he has found a way to reach Margaery, the Sparrow allows her to visit her brother Loras Tyrell.\n\n    Margaery remaining in her cell.  \nShe finds a dejected Loras lying on the floor of his cell. Loras has lost the will to continue resisting but Margaery tells him to stay strong because he is the future of House Tyrell. Loras tells them that he only wants his imprisonment to end and pleads with her to help him. Margaery tells Loras that the Sparrow is trying to use them to break each other and again tells him to stay strong.\nAt the Red Keep, Cersei Lannister walks in on Grand Maester Pycelle advising King Tommen to accommodate the High Sparrow and the Faith Militant. Cersei requests that Pycelle leave the room while she talks to her son alone under the pretext of meeting him for updates about the previous Small Council meetings. During their conversation, Tommen proposes that the Iron Throne not antagonize the Sparrows further in order to avoid endangering Margaery's life. Cersei then reminds her son about the humiliation that she endured at their hands and exploits Tommen's love for Margaery. She convinces her son that the High Sparrow has no respect for kings, queens, and society. Tommen then reveals a secret that the High Sparrow shared with him.\nArmed with this new information, Cersei barges into a Small Council meeting between Kevan Lannister, Olenna Tyrell, and Jaime Lannister. While Kevan and Olenna are initially hostile, Cersei convinces them to listen to her. She then informs the Council that the High Sparrow has planned to make Margaery do the walk of atonement. Olenna is horrified that the Sparrows plan to debase her granddaughter. Jaime then urges the Council to allow the Tyrells to march their army into King's Landing, crush the Faith Militant, and bring Margaery and Loras back to the Red Keep into Crown custody. Kevan says that Tommen expressly forbid him to use the Lannister army he commands at the city to make a move against the Great Sept, for fear that the Faith Militant will harm Margaery in retaliation. Jaime suggests that Olenna send House Tyrell's army to the city instead, and points out to his uncle that Tommen only forbade his army from making a move - but he never expressly told him to prevent anyone else from trying, so Kevan wouldn't be breaking any commands if his forces simply stand down when the Tyrell army arrives. The Tyrell army will surround the Great Sept, intimidating the Sparrows into releasing Margaery and Loras, without any blood actually being shed - and by the time Tommen finds out what they've done he will already be happy with the outcome. Kevan's interest is now turned, but he still expresses reluctance should they fail. Cersei is able to make him change his mind by exploiting his hatred towards the Sparrows for taking his last remaining son and heir Lancel Lannister. Olenna agrees that blood will be shed no matter what they do at this point, so it's better if it's the Sparrows' blood and not theirs.\n\nA"},{"location":"At the Wall","content":"At Castle Black, Eddison Tollett helps Jon Snow pack up his things. Edd scolds Jon for leaving the Night's Watch after taking an oath, to which Jon replies that he gave his life for the Night's Watch and can't trust his brothers. At that moment, the horns sound for the arrival of travellers. Sansa Stark, Brienne of Tarth and Podrick Payne ride through the gates and dismount in the courtyard. Jon rushes out and sees Sansa for the first time since the Starks left Winterfell for King's Landing, and they embrace. Later that night, they converse and reminisce on their childhood. Sansa proposes they take Winterfell back from Ramsay Bolton but Jon says he's done fighting, especially after hanging Olly.\n\n    Jon and Sansa are reunited at the Wall.  \nDavos Seaworth asks whether Melisandre will stay at Castle Black and she replies she will do as Jon Snow, The Prince That Was Promised, commands. Davos asks what happened to Stannis and she replies he was defeated in battle. When he asks about Shireen, Melisandre is reluctant to speak. Their conversation is interrupted by Brienne, who recognizes Davos and Melisandre as Stannis' former entourage. Still bitter over the death of King Renly Baratheon, Brienne warns Melisandre that she does not forget or forgive. She also tells them that she executed Stannis after he admitted using blood magic to assassinate Renly.\nSome time later, Jon receives a letter from Ramsay Bolton stating that he has Rickon Stark at Winterfell and if Sansa is not returned, he will slaughter every Wildling at Castle Black, let his men rape Sansa, and feed Jon and Rickon to his dogs. Tormund says he has 2,000 able fighters, far less than the estimated 5,000 Ramsay has. Sansa says that they have to try to retake their home and rescue their brother and that the houses of the North will unite behind Jon as the son of the true Warden of the North. Jon resolves to take Ramsay down.\n\nI"},{"location":"In the Vale","content":"Robin practices his archery.  \nAt Runestone, Robin Arryn trains at his archery in front of Lord Yohn Royce. Petyr Baelish arrives with a retinue of Arryn guards and a pet falcon as a belated name-day gift. Royce reminds Baelish that he told him that he was taking Sansa with him to The Fingers, but he received word that she had been married to Ramsay Bolton. Baelish tells him that on the way to The Fingers they were set upon by a large force of Bolton men. A confrontation ensues, in which Petyr accuses Royce of giving away the information regarding the location of Sansa Stark to House Bolton. When Royce accuses Baelish of slander, Petyr reminds him that Robin is the Lord of the Vale, and asks for his judgment. Robin then asks Baelish if they should throw Lord Royce from the Moon Door, which prompts the surrounding knights, including those loyal to Royce, to muster themselves. Royce swears his loyalty to Robin, and he is let off without punishment on Baelish's recommendation. Royce comes onto the dark realization that Littlefinger has control over Robin. Petyr and Robin decide they have to muster the Vale knights to march North and aid Sansa."},{"location":"In The North","content":"At Winterfell, Osha is brought before Ramsay Bolton, who says that while her fellow captive Rickon Stark has value to Ramsay, he is unsure of her worth. Osha denounces the Starks, saying that her servitude and loyalty to them were forced. She also attempts to seduce Ramsay, climbing onto his lap and kissing him, all the while trying to get the knife he had been using to peel apples. Ramsay seemingly falls for it, saying that it took much longer for him to get Theon Greyjoy over to his side but that Theon told him everything, including how Osha had seduced Theon in order to help Rickon and Bran Stark escape Winterfell. Osha realizes that she has been lured into a trap, and tries to stab Ramsay, only for him to slash her throat. She dies shortly thereafter.\n\nI"},{"location":"In the Iron Islands","content":"Theon returns home.  \nTheon Greyjoy returns home to Pyke, where he learns of the death of his father, Balon Greyjoy. His sister, Yara, is unhappy about his return and his refusal to leave the Dreadfort when she made an attempt to rescue Theon from Ramsay Bolton. Theon explains that Ramsay \"broke him into a thousand pieces,\" which Yara affirms \"yes, he sent us one of those pieces\" referring to the box containing Theon's penis that she and Balon Greyjoy received. Yara then suspects that Theon has come back to declare himself King of the Iron Islands, but he insists that he does not want the crown, instead wishing for Yara to rule, with him helping her in any way that he can.\n\nI"},{"location":"In Meereen","content":"Tyrion Lannister along with Grey Worm, Missandei, and Varys meet with representatives of the Good Masters of Astapor, the Wise Masters of Yunkai, and the slave-trading city of Volantis; who have arrived by sea. As the diplomatic mission enters the harbor, Grey Worm advocates using military force. When Tyrion explains that he is able to empathize with slaves because he spent one day as a slave, Missandei counters that he has not experienced slavery. The emissaries are Tyrion's former slave master Yezzan zo Qaggaz, the Yunkai'i Wise Master Razdal mo Eraz and the Volantene triarch Belicho Paenymion.\n\n    Varys, Tyrion and Missandei converge to prepare for their meeting.  \nIn their meeting chambers, Yezzan marvels at how Tyrion went from being a nearly-worthless slave to the de facto ruler of Meereen. The slave-trading cities offer to give Daenerys Targaryen and her mercenaries a large pot of money if they sail away from Slaver's Bay. When Missandei defends Daenerys's actions in liberating slaves, Razdal contends that slavery has existed for centuries. After hearing their offer, Tyrion proposes a counter-offer. He offers to give them a seven-year grace period to phase out slavery and to compensate slave owners, however they must end all backing for the Sons of the Harpy (regardless of whether they admit this backing or not).  He then cautions them that they will not get a better offer. Tyrion then gives them time to consider his offer, though Grey Worm and Missandei insist on abolishing slavery.\nTyrion and his entourage are later confronted by a crowd of former slaves in the Meereen throne room. A freedman demands to know when Daenerys will return while another is appalled at the idea of Tyrion negotiating with slave traders. Tyrion insists he is doing his best to rule the city in Daenerys's absence. The freedmen do not trust Tyrion, a foreigner and a newcomer, and look to Grey Worm and Missandei for reassurance. Despite their misgivings, they both publicly back Tyrion's diplomacy in front of the freedmen. In private, Grey Worm and Missandei warn Tyrion that the masters will outmaneuver him, despite his best efforts to do the same to them.\n\nI"},{"location":"In Vaes Dothrak","content":"Ser Jorah Mormont and Daario Naharis approach the outskirts of Vaes Dothrak and discard their weapons, as drawing a blade in the city is considered sacrilege. Within the city itself, Jorah and Daario run afoul of Akho and Iggo who see through Jorah's claims to be a wine merchant. Daario takes care of Iggo while Akho tackles Jorah. The knight is nearly undone, but Daario saves him at the last minute with the stiletto he smuggled in. At Jorah's insistence, Daario smashes Aggo's skull with a rock so that no one will think he was killed with a bladed weapon.\n\n    Dany proves to the Dothraki who their true Khaleesi is.  \nMeanwhile, the High Priestess of the Dosh Khaleen gives Daenerys a commentary on the other crones. Some of them hate Daenerys, thinking the Dothraki should not interbreed with other races, but the high priestess dismisses them, saying that the Dothraki have always interbred and have never been concerned with blood purity. To illustrate her point, the high priestess indicates another of the khaleen, a Lhazareen girl (Ornela) taken from her village at the age of twelve. Daenerys asks to relieve herself, and the high priestess sends Ornela with her. As they walk, Daenerys learns that Ornela's khal died when she was only sixteen. The pair are interrupted by Jorah and Daario, who take the Lhazareen hostage. Daenerys, unsurprised to see them, cancels their plans for escape – they have a slim chance of leaving Vaes Dothrak, let alone getting back to Meereen – and tells them that she has a plan of her own. She asks Ornela if she is willing to help them, calling her a Khaleesi (queen) instead of a khaleen (crone). The girl reluctantly agrees.\nDuring the Khalar vezhven, the khals argue about how to deal with Iggo and Akho's deaths; Khal Moro defuses the situation by reminding them that Ahko was a member of his khalasar, and he does not care about finding the killer if he was stupid enough to get himself killed. Daenerys is then brought in by the two priestesses she befriended before. Moro insists that she join the dosh khaleen, but another khal expresses interest in making her his khaleesi, while another suggests giving her to the Wise Masters in exchange for ten thousand horses. Daenerys dismisses all of them; she claims that they are all petty and weak, and reminds them that Khal Drogo was willing to cross the \"poison water\" in \"wooden horses\" for his conquests.\n\n    Jorah and Daario bow down to their queen.  \nStating that none of the khals is fit to lead the Dothraki, Daenerys declares that she will lead them herself. After a pause, Moro and the khals burst into laughter. Dany reminds them that her husband, in the same temple in which they all now sit, declared that he would lead a Dothraki army across the Narrow Sea to retake the Iron Throne for his khaleesi and that all the khals have done since is to raid and plunder villages in lieu of any meaningful conquest. Disgusted with her insolence, Moro declares that she will be raped by each of the khals, then by all of their bloodriders, and then, if she is still alive, by their horses. Daenerys is unfazed by the threats, as she knocks down the braziers in the hut, setting everything aflame. The khals desperately attempt to escape the rapidly-spreading fire, only to find the temple's only door barred, the bodies of the two men guarding it lying dead outside.\nAs the flames climb higher, the dosh khaleen and khalasars gather in confusion. Eventually, the doors collapse and Daenerys emerges, naked and unburned, with the entire leadership present at Vaes Dothrak dead. Many of the assembled bow immediately, with the high priestess and the rest of the dosh khaleen following after a moment. Jorah and Daario move to the front of the crowd and bow last."}],"firsts":["Belicho Paenymion","Ash","Kesh","Iggo","Khal Rhalko","Khal Forzho","Khal Brozho","Khal Qorro"],"deaths":["Iggo","Akho","Osha","Khal Rhalko","Khal Brozho","Khal Qorro","Khal Forzho","Khal Moro","Five Khals","Moro's bloodrider","Moro's bloodrider"],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Nikolaj Coster-Waldau","character":"Ser Jaime Lannister"},{"actor":"Lena Headey","character":"Queen Mother Cersei Lannister"},{"actor":"Emilia Clarke","character":"Queen Daenerys Targaryen"},{"actor":"Kit Harington","character":"Jon Snow"},{"actor":"Natalie Dormer","character":"Queen Margaery Tyrell"},{"actor":"Aidan Gillen","character":"Petyr \"Littlefinger\" Baelish"},{"actor":"Liam Cunningham","character":"Ser Davos Seaworth"},{"actor":"Carice van Houten","character":"Lady Melisandre"},{"actor":"Sophie Turner","character":"Princess Sansa Stark"},{"actor":"Nathalie Emmanuel","character":"Missandei"},{"actor":"Conleth Hill","character":"Varys"},{"actor":"Kristofer Hivju","character":"Tormund Giantsbane"},{"actor":"Jonathan Pryce","character":"the High Sparrow"},{"actor":"Michiel Huisman","character":"Daario Naharis"},{"actor":"Dean-Charles Chapman","character":"King Tommen Baratheon"},{"actor":"Iwan Rheon","character":"Lord Ramsay Bolton"},{"actor":"Gwendoline Christie","character":"Brienne of Tarth"},{"actor":"Alfie Allen","character":"Theon Greyjoy"},{"actor":"Iain Glen","character":"Ser Jorah Mormont"},{"actor":"Diana Rigg","character":"Lady Olenna Tyrell"},{"actor":"Ben Crompton","character":"Eddison Tollett"},{"actor":"Jacob Anderson","character":"Grey Worm"},{"actor":"Natalia Tena","character":"Osha"},{"actor":"Gemma Whelan","character":"Princess Yara Greyjoy"},{"actor":"Finn Jones","character":"Ser Loras Tyrell"},{"actor":"Julian Glover","character":"Grand Maester Pycelle"},{"actor":"Ian Gelder","character":"Ser Kevan Lannister"},{"actor":"Rupert Vansittart","character":"Lord Yohn Royce"},{"actor":"Daniel Portman","character":"Podrick Payne"},{"actor":"Hannah Waddingham","character":"Septa Unella"},{"actor":"Lino Facioli","character":"Lord Robin Arryn"},{"actor":"Enzo Cilenti","character":"Yezzan zo Qaggaz"},{"actor":"George Georgiou","character":"Razdal mo Eraz"},{"actor":"Eddie Jackson","character":"Belicho Paenymion[1]"},{"actor":"Yousef Sweid","character":"Ash"},{"actor":"Michael Heath","character":"Kesh"},{"actor":"Joe Naufahu","character":"Khal Moro"},{"actor":"Tamer Hassan","character":"Khal Forzho"},{"actor":"Souad Faress","character":"a High Priestess of the Dosh khaleen"},{"actor":"Hannah John-Kamen","character":"Ornela"},{"actor":"Chuku Modu","character":"Akho[2]"},{"actor":"Staz Nair","character":"Qhono"},{"actor":"Deon Lee-Williams","character":"Iggo"},{"actor":"Elie Haddad","character":"Khal Brozho"},{"actor":"Andrei Claude","character":"Khal Rhalko"},{"actor":"Darius Dar Khan","character":"Khal Qorro"},{"actor":"Fola Evans-Akingbola","character":"a Moro's wife"},{"actor":"Wuese Houston-Jibo","character":"a Dothraki widow"},{"actor":"Angelique Fernez","character":"a Dothraki widow"},{"actor":"Diogo Sales","character":"a Moro's bloodrider"},{"actor":"Junade Khan","character":"a Moro's bloodrider"},{"actor":"Michael Hooley","character":"a Night's watch man"},{"actor":"Robert Fawsitt","character":"a loyal Night's Watch man"},{"actor":"Portia Victoria","character":"a Dothraki woman having sex"},{"actor":"Oliver Stockwell","character":"a Dothraki man having sex"}]}
