{"title":"Oathbreaker","season":"6","episode":"3","date":"Sun May 08 2016","authors":["David Benioff","D.B. Weiss"],"directors":["Daniel Sackheim"],"info":"\"Oathbreaker\" is the third episode of the sixth season of Game of Thrones. It is the fifty-third episode of the series overall. It premiered on May 8, 2016. It was written by David Benioff and D.B. Weiss, and directed by Daniel Sackheim.","plot":"Daenerys meets her future. Bran meets the past. Tommen confronts the High Sparrow. Arya trains to be No One. Varys finds an answer. Ramsay gets a gift.","summary":[{"location":"At the Wall","content":"As Jon Snow awakens and gasps for air, he slowly sits up and scans the room. He then looks down and is horrified by his stab wounds. Davos Seaworth, having returned to the room, is shocked but relieved and quickly helps Jon as he struggles to walk. Davos asks Jon if he remembers anything. Jon, still shocked, says yes, he remembers getting stabbed by Olly and Alliser Thorne for bringing the Wildlings to Castle Black. Melisandre enters, shocked that the resurrection has worked. She then goes to Jon and asks him where he was after his death. Jon replies he saw nothing, much to Melisandre's disappointment. Seizing on whatever hope she still has, however, she says that the Lord of Light brought Jon back for a reason; that Stannis was not The Prince That Was Promised, but \"someone must be.\" Davos asks Melisandre to leave them alone so Jon can adjust to his revival.\nAfter he has recovered somewhat, Jon dons his Night's Watch armor and the Lord Commander's cape, and walks into the courtyard, seeing many of the fellow Brothers arrive before him. Jon, still struggling to walk properly, comes down and greets the dumbfounded Tormund. Tormund jokes with the resurrected Lord Commander before hugging him tightly which slightly pains Jon due to his stab wounds. Jon then greets the relieved Eddison Tollett and they embrace.\nSome time later, Jon oversees the public hanging of the traitors responsible for the Mutiny at Castle Black: Bowen Marsh, Othell Yarwyck, Alliser Thorne and Olly. Jon asks if any of the men have last words to say. Bowen says Jon shouldn't be alive, stating it's not right. Jon coldly replies, \"Neither was killing me.\" Yarwyck pleads Jon to tell his family in White Harbor that he died fighting the Wildlings. Alliser then says he had a choice: to betray his Commander or the Night's Watch. He then says that Jon bringing the Wildlings was a dangerous problem and had to be stopped, and warns him that Jon will be fighting their battles forever.\nJon then moves on to Olly, who says nothing and glares furiously at Jon. Jon reluctantly cuts down the rope, killing all four traitors. Jon looks at Olly's lifeless body. Afterwards, Jon takes off his cloak and hands it to the confused Edd. Jon then says Edd can do whatever he wants with the cloak, unofficially designating Edd as the 999th Lord Commander of the Night's Watch. Jon then leaves the courtyards and declares his watch has ended, leaving the rest of the Brothers look on in shock.\n\nO"},{"location":"On a ship heading for Oldtown","content":"Samwell Tarly, Gilly, and her baby son Sam are sailing on a ship to Oldtown. Gilly and Sam have never been on a ship before. Samwell is seasick and begins throwing up into a chamber pot. Gilly assures Samwell that it won't be long and says that she can't wait to see Oldtown. Gilly tells Tarly that the ship's captain says that Oldtown is the most beautiful city in Westeros. While Samwell had originally planned to go and study at the Citadel, he changes his plans since he cannot bring Gilly and her child along as the Citadel only allows men within its walls.\nUnwilling to abandon Gilly and Sam to the streets, Samwell decides to take them to his ancestral home of Horn Hill. While he does not get on with his father Randyll Tarly, Samwell assures Gilly that his mother and sister are very kind. Samwell wants to do everything to protect Gilly and her child from harm. Despite some unease, Gilly promises to follow Samwell and let him decide what is best for them.\n\nB"},{"location":"Beyond the Wall","content":"Bran has a vision of the past again. He and the three-eyed raven are at the Tower of Joy in Dorne, shortly after the end of Robert's Rebellion. The last two of the Targaryen Kingsguard stand before the Tower and block the way of a small party of Northmen led by Eddard Stark himself. The three-eyed raven identified one of Ned's companions as Howland Reed, Meera's father. Eddard tells Ser Arthur Dayne and Lord Commander Gerold Hightower to stand down, and asks why they weren't at the Trident. Ser Arthur states that Rhaegar ordered them here to guard the tower, so there they remained, even as Rhaegar and Aerys both died. Eddard asks where his sister Lyanna is, but Dayne simply wishes Stark the best in the wars to come. The two Kingsguard draw their swords, with Ser Arthur saying, \"And now it begins,\" to which Eddard replies \"now it ends.\" The two sides clash, with Dayne making short work of a few of Ned's northmen. Ser Arthur slowly cuts down the number of northmen, but Ser Gerold falls to Ned's blade. Eventually, Ser Arthur duels Eddard one-on-one. Bran expresses his shock at Ser Arthur's skills, with the three-eyed raven confirming that the Sword of the Morning is better than Ned. Dayne easily gains the upper hand and kicks Ned's sword away from him, but is unprepared for Howland stabbing him through the back of the neck. Eddard seems visibly uncomfortable at winning this way, but unhesitatingly delivers the killing blow to the incapacitated Ser Arthur. Bran is shocked, as he had heard tales of this duel and never expected his father to stand for such things.\nEddard runs towards the tower, having heard a woman's scream come from one of its windows towards the end of the duel. Bran runs to follow Eddard, calling out, but he is told it's time to go by the raven. Ned looks back for a second, seemingly hearing Bran, but then runs into the Tower. Bran tries to follow, but he is forced out of the past and back into the cave by the three-eyed raven, saying he had stayed in the past for too long. Bran is both angry and sad at this, but the raven asserts it was for his safety, and again sternly reminds him that the past cannot be changed. The raven further states that he's waited a thousand years for Bran to arrive, and that Bran will not share the raven's destiny. But before he can leave the cave, Bran must learn everything.\n\nA"},{"location":"At King's Landing","content":"The \"Little Bird\" Spies  \nQyburn is in the company of the little birds, children who used to spy for Varys. Qyburn tries to win the favor of the children by attracting them with candied plums from Dorne. Shortly afterwards, Cersei, Jaime Lannister and the reanimated Ser Gregor Clegane enter. Cersei wants Qyburn to gather information from Dorne, Highgarden, the North and wherever people are trying to take advantage of their losses and plotting against them.\nAt the Small Council meeting, Grand Maester Pycelle complains about Qyburn and his experiments. Ser Kevan Lannister, now Hand of the King - is heading the Council – which now consists of himself, Pycelle, and Lord Mace Tyrell – with Lady Olenna Tyrell in attendance to lobby for Margaery and Loras Tyrell's release. Cersei, Jaime and Ser Gregor enter the room, startling Pycelle and Mace. On being questioned about what they are doing at a small council meeting, Cersei replies that she is the Queen, only to be corrected by Olenna that the rightful queen is the one married to the king and that Margaery is the one who fits that description. Jaime then argues that he, as Lord Commander of the Kingsguard, also has a right to attend. Pycelle admits that Ser Gerold Hightower once sat on the council, but dismisses this due to the Mad King's eccentricities. Cersei accuses Kevan of not caring for her daughter Myrcella, while Jaime appeals to the bigger picture and urges Kevan to take action against Ellaria Sand and the Sand Snakes who have taken over Dorne after eliminating House Martell. Displeased with the newcomers, Ser Kevan and the small council leave the hall.\nMeanwhile, an angry King Tommen Baratheon and his Kingsguard visits the High Sparrow to secure permission for Cersei to visit her daughter's resting place in the Great Sept. The High Sparrow replies that Cersei cannot visit because she still has not been cleared for the other sins that she is accused of. Tommen criticizes the High Sparrow for his self-righteous treatment of Cersei after she had atoned for two of her crimes. Despite their differences, the High Sparrow claims admiration for the deep love that Cersei has for her son, Tommen, which he attributes to the divine love of the Mother.\nWhen Tommen asks the High Sparrow why he wants to put his mother through more trials, the Sparrow replies that he is merely carrying out the will of the Seven. He urges the young King to turn to the Seven for wisdom. Before Tommen leaves, less angry and more uncertain, the High Sparrow tells him that the Seven have worked through his grandfather and mother even though they may not acknowledge it. \n\nI"},{"location":"In Meereen","content":"In the Great Pyramid, Varys holds court when the Unsullied bring in Vala, a prostitute who is in league with the Sons of the Harpy. She had seduced and murdered several members of the Second Sons and Unsullied. Vala is defiant and states that she opposes the new regime imposed by the Unsullied and Second Sons as illegitimate. She became a prostitute out of patriotic fervor for the old ways. Varys assures Vala he has no interest in torturing her and decides to strike a deal. In return for revealing who is funding the Sons of the Harpy, he offers her and her son safe passage on a ship bound for Pentos with a bag of silver to start a new life. Varys warns her that if she doesn't agree to the offer, she will be executed for her crimes, leaving her son orphaned.\nMeanwhile, Tyrion passes the time by engaging Missandei and Grey Worm in small talk. Tyrion offers to play games with the pair but they are not interested. Before Tyrion can embark on a drinking game, Varys returns and informs them that the Wise Masters of Yunkai, the Good Masters of Astapor, and the Free City of Volantis have been secretly funding the Sons of the Harpy. While Grey Worm advocates attacking the cities, Missandei advises against it since that would leave Meereen unprotected. Using this information, Tyrion asks Varys to use his little birds to send them a message.\n\nI"},{"location":"In the Dothraki Sea","content":"Daenerys Targaryen walks with the Dothraki towards Vaes Dothrak and is ushered into the the Temple of the Dosh Khaleen by Khal Moro's bloodriders. Upon entering the temple, the High Priestess of the Dosh Khaleen orders the bloodriders to leave and strips her naked, giving her a robe which the dosh khaleen wear. As Daenerys puts on her new clothes, she tells the high priestess that she will soon regret what she has done as she was the wife of a great khal the Queen of Meereen, and the Mother of Dragons. The high priestess retorts that she herself was the wife of a previous Great Khal, Savo. Just as Daenerys thought she would conquer the world at Drogo's side, so did the high priestess think she would conquer the world at Savo's. But Savo was slain, and she joined the dosh khaleen. She is now content, just as Daenerys would be if she is allowed to join them. When Dany expressed confusion, the priestess points out that khaleesi are supposed to return to Vaes Dothrak immediately after their khal's death... but Daenerys went out into the world. She explains that all the khalasars have gathered to decide which cities will be sacked and which tribes will be enslaved, and now they will have to decide what to do with Daenerys for not coming to the dosh khaleen after Khal Drogo died.\n\nI"},{"location":"In Braavos","content":"A blind Arya Stark resumes her training with the Waif and Jaqen H'ghar, the former of whom beats her repeatedly when she lies. Meanwhile, Jaqen has her mixing potions blindly. During her training, Arya continues sparring with the Waif while answering questions about her family and the Hound. Arya admits to leaving the Hound to die instead of killing him, despite wanting his death. The Waif then interrogates Arya about the people on her list: Cersei, Gregor Clegane and Walder Frey. The Waif voices her disbelief that Arya's list is so short, but Arya counters by asking which name she wants added. When Arya insists that she is no one, the Waif does not believe her and tries to hit her. However, Arya is able to deflect her blow and leap out of the way, surprising the Waif. After confirming that Arya has mastered blind sparring, Jaqen approaches Arya and offers to give back her sight if she tells him her name. Arya replies that \"a girl has no name.\" Jaqen then leads Arya to the well where he scoops up a bowl of water, which he offers her. She is reluctant, as others have drunk from it and died, but he says that if she is truly \"no one\" there is nothing to fear. Arya drinks from the bowl and her sight is restored. When Jaqen asks Arya who she is, she replies that she is no one."},{"location":"At Winterfell","content":"The Umbers led by Smalljon Umber travel to Winterfell to meet Ramsay Bolton, the new Lord of Winterfell and Warden of the North. Smalljon and Ramsay chat about their experiences with their fathers. Smalljon mentions that his father Greatjon Umber is dead but admits that he would have killed him if the opportunity arose. Ramsay denies murdering the late Roose Bolton and claims that he was poisoned by his enemies, but Smalljon doesn't bother believing him.\nSmalljon has come to forge an alliance with the Boltons against Jon Snow and the Wildlings. However, he refuses to bow to Ramsay; citing the late Robb Stark's betrayal at the hands of Roose. Smalljon then reveals that he has a \"gift\" for Ramsay, who asks if it is a girl, hoping for Sansa Stark. Smalljon replies otherwise and Umber guards enter the room with two hooded figures. The first turns out to be Osha – the second is Rickon Stark, Ned Stark's youngest child. Osha and Rickon appear uncomfortable to find themselves in Ramsay's presence. When Ramsay asks Smalljon to verify Rickon's identity, an Umber retainer enters the room carrying the severed head of the direwolf Shaggydog, and Rickon's expression of dismay confirms this was his pet. Satisfied, a gleeful Ramsay then issues a sarcastic \"welcome home Lord Stark.\""}],"firsts":["Ser Arthur Dayne (Flashback)","Ser Gerold Hightower (Flashback)","Lord Howland Reed (Flashback)","Lord Smalljon Umber","High Priestess of the Dosh Khaleen"],"deaths":["Ser Arthur Dayne (Flashback)","Ser Gerold Hightower (Flashback)","Four Stark bannermen (Flashback)","Lord Greatjon Umber (Mentioned)","Shaggydog (Off-screen)","First Steward Bowen Marsh","First Builder Othell Yarwyck","First Ranger Ser Alliser Thorne","Olly"],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Nikolaj Coster-Waldau","character":"Ser Jaime Lannister"},{"actor":"Lena Headey","character":"Queen Mother Cersei Lannister"},{"actor":"Emilia Clarke","character":"Queen Daenerys Targaryen"},{"actor":"Kit Harington","character":"Jon Snow"},{"actor":"Liam Cunningham","character":"Ser Davos Seaworth"},{"actor":"Carice van Houten","character":"Lady Melisandre"},{"actor":"Nathalie Emmanuel","character":"Missandei"},{"actor":"Maisie Williams","character":"Arya Stark"},{"actor":"Conleth Hill","character":"Varys"},{"actor":"Kristofer Hivju","character":"Tormund Giantsbane"},{"actor":"Isaac Hempstead-Wright","character":"Bran Stark"},{"actor":"John Bradley","character":"Samwell Tarly"},{"actor":"Iwan Rheon","character":"Lord Ramsay Bolton"},{"actor":"Jonathan Pryce","character":"the High Sparrow"},{"actor":"Dean-Charles Chapman","character":"King Tommen Baratheon"},{"actor":"Hannah Murray","character":"Gilly"},{"actor":"Tom Wlaschiha","character":"Jaqen H'ghar"},{"actor":"Max von Sydow","character":"the Three-eyed raven"},{"actor":"Diana Rigg","character":"Lady Olenna Tyrell"},{"actor":"Owen Teale","character":"Ser Alliser Thorne"},{"actor":"Anton Lesser","character":"Qyburn"},{"actor":"Julian Glover","character":"Grand Maester Pycelle"},{"actor":"Jacob Anderson","character":"Grey Worm"},{"actor":"Natalia Tena","character":"Osha"},{"actor":"Ben Crompton","character":"Eddison Tollett"},{"actor":"Faye Marsay","character":"The Waif"},{"actor":"Roger Ashton-Griffiths","character":"Lord Mace Tyrell"},{"actor":"Ian Gelder","character":"Ser Kevan Lannister"},{"actor":"Hafþór Júlíus Björnsson","character":"Ser Gregor Clegane"},{"actor":"Brenock O'Connor","character":"Olly"},{"actor":"Kae Alexer","character":"Leaf"},{"actor":"Dean S. Jagger","character":"Lord Smalljon Umber"},{"actor":"Paul Rattray","character":"Lord Harald Karstark"},{"actor":"Art Parkinson","character":"Rickon Stark"},{"actor":"Meena Rayann","character":"Vala"},{"actor":"Joe Naufahu","character":"Khal Moro"},{"actor":"Souad Faress","character":"a High Priestess of the Dosh Khaleen"},{"actor":"Staz Nair","character":"Qhono"},{"actor":"Hannah John-Kamen","character":"Ornela"},{"actor":"Angelique Fernez","character":"a Dothraki widow"},{"actor":"Robert Aramayo","character":"Lord Eddard Stark"},{"actor":"Luke Roberts","character":"Ser Arthur Dayne"},{"actor":"Eddie Eyre","character":"Ser Gerold Hightower"},{"actor":"Brian Fortune","character":"First Builder Othell Yarwyck"},{"actor":"Michael Condron","character":"First Steward Bowen Marsh"},{"actor":"Wuese Houston-Jibo","character":"a Dothraki widow"},{"actor":"Diogo Sales","character":"a Moro's bloodrider"},{"actor":"Junade Khan","character":"a Moro's bloodrider"},{"actor":"Annette Hannah","character":"a little bird"},{"actor":"Nathanael Saleh","character":"a Arthur"},{"actor":"Michael Nevin","character":"a little bird"},{"actor":"Jesse Magee","character":"a little bird"},{"actor":"Iona Clarke","character":"a little bird"},{"actor":"Lucy Gallagher","character":"a little bird"},{"actor":"Fionn Kernan","character":"a little bird"},{"actor":"Aisling Franciosi","character":"Lady Lyanna Stark (voice)"},{"actor":"Leo Woodruff","character":"Lord Howland Reed"}]}
