{"title":"Home","season":"6","episode":"2","date":"Sun May 01 2016","authors":["Dave Hill"],"directors":["Jeremy Podeswa"],"info":"\"Home\" is the second episode of the sixth season of Game of Thrones. It is the fifty-second episode of the series overall. It premiered on May 1, 2016. It was written by Dave Hill and directed by Jeremy Podeswa.","plot":"Bran trains with the Three-Eyed Raven. In King's Landing, Jaime advises Tommen. Tyrion demands good news, but has to make his own. At Castle Black, the Night's Watch stands behind Thorne. Ramsay Bolton proposes a plan, and Balon Greyjoy entertains other proposals.","summary":[{"location":"Beyond the Wall","content":"Bran Stark continues his training under the Three-Eyed Raven at the tree. He is shown a scene from Winterfell, watching his father and Uncle Benjen training in the yard as young boys. He also sees his Aunt Lyanna, Old Nan, and Ser Rodrik Cassel. He also sees a stableboy that he realizes is a young Hodor - and is surprised that in his youth he was not a lackwit but was intellectually normal and could talk, and his real name is actually \"Wylis\". Though Bran wants to stay, he is dragged out of the vision by the Three-Eyed Raven, who warns him that it is dangerous to stay too long in such visions. Outside the tree, Bran finds Meera Reed, who still appears to be in mourning over her brother's death. Though Meera questions the point of her presence during Bran's training, Leaf states that Bran will need her when he leaves the tree.\n\nA"},{"location":"At King's Landing","content":"In a tavern, a man drunkenly boasts of having taunted Cersei during her walk of atonement to the great amusement of the other patrons. After he finishes his story, he leaves the tavern to urinate against a wall outside. As he is urinating, he is confronted by Ser Gregor Clegane, who kills him by smashing his head against the wall. Ser Gregor returns to Cersei's side following the murder.\nMyrcella's funeral is held at the Great Sept of Baelor but Cersei cannot attend. Tommen has ordered that Cersei be confined to the Red Keep since he is concerned that the Faith Militant will re-arrest her if she steps inside the sept. In the sept, Jaime and Tommen talk about Myrcella and Prince Trystane. Tommen believes that Cersei is to blame for Prince Trystane's death but tells Jaime that he isn't upset with her. Jaime convinces Tommen to go see his mother and apologize to her as the High Sparrow enters the sept. After Tommen leaves, Jaime begins threatening the High Sparrow and asks him why Cersei is being punished for her sins, but he isn't, considering he murdered the king he vowed to protect. As Jaime is about to kill the High Sparrow, the High Sparrow seems to be unafraid to die, which confuses Jaime. The High Sparrow explains that if Jaime chooses to kill him then many of the sparrows will die fighting him, but it wouldn't really matter since they have no names or individual power. He says that they mean nothing individually, but together they can overthrow an empire.\nTommen visits Cersei in the Red Keep and apologizes for not being more assertive during her imprisonment. He regrets letting the High Sparrow lock her away and says that he should have torn the sept down with the High Sparrow inside of it. He tells her that he needs her help in being a strong ruler. Cersei remains uncharacteristically silent throughout the exchange, but when Tommen is done speaking, she embraces him."},{"location":"In Meereen","content":"Missandei and Grey Worm tell Tyrion that Rhaegal and Viserion have not been eating ever since Daenerys left. Tyrion explains that dragons do not do well in captivity and they will probably start eating again if they are unchained. He also suggests that dragons are intelligent enough to remember their friends, and that they will probably not harm Missandei if they meet her again, since she spent so much time with them when they were little. Tyrion and Varys go down below the pyramid, with Tyrion advancing into the darkness alone. One of the dragons emerges from the shadows and Tyrion maintains eye contact. When the other emerges, Tyrion puts down his torch and gently advances. To calm them, Tyrion speaks gently, explaining that some say that dragons are more intelligent than humans, and tells about about a time when he was little and had asked his uncle for a dragon – not even a large one, just a little one like him. They all laughed, then Tyrion's father told him dragons were extinct, and Tyrion says he cried himself to sleep that night. At this point, Tyrion is finally close enough to release the locking pin on the second dragon's collar. The other advances on him, then gingerly turns his head to the side so Tyrion can free him as well. The dragons retreat, and Tyrion hastily returns to Varys. Tyrion instructs Varys to punch him if he ever suggests doing anything like that again.\n\nI"},{"location":"In Braavos","content":"Still a beggar on the streets, Arya is again approached by the Waif, who asks her name. Arya says she is \"no one\", at which the Waif hits her. The Waif retorts that she doesn't believe that and neither does Arya. She tries to fight back, but the Waif vanishes, replaced with Jaqen H'ghar. He promises that if she says her name, Arya will sleep under a roof that night, that she will eat, and he will restore her eyes. Each time however Arya says she has no name. Satisfied, he tells Arya to follow him, and that she is a beggar no more.\n\nI"},{"location":"In the North","content":"At Winterfell, Ramsay and Roose discuss plans with Harald Karstark regarding what to do about Sansa. After Ramsay suggests storming Castle Black, Roose warns Ramsay that such an action would turn the entire North against House Bolton, adding that if he does not act more sensibly he will be discarded. At that point, Maester Wolkan enters and announces that Roose's wife, Walda, has given birth to a baby boy. Ramsay, realizing that his position is weaker than ever, stabs his father to death and, in his position as the new Lord Bolton, he personally feeds Walda and his half-brother to the hounds.\nIn the woods, Brienne fills Sansa in on her encounter with Arya, whilst Sansa is reluctant to talk about her experiences under Ramsay Bolton's tyranny at Winterfell. She admits that she ought to have accepted her help sooner. Then Theon, wracked with guilt over his betrayal of the Stark family, decides to leave the group and go home. He tells Sansa that Brienne and Pod will do a better job of looking after her, though he tearfully states that he would have gone with her all the way to Castle Black if necessary. He asks to take one of the horses with him, and the two share an embrace.\n\nI"},{"location":"In the Iron Islands","content":"At Pyke, it is a dark and stormy night. Yara Greyjoy reads a letter to King Balon Greyjoy about how Glovers retook Deepwood Motte and killed all of the Ironborn who held the castle. Yara notes that their invasion is now a definite failure since Deepwood Motte was the last stronghold that the Ironborn held in the North. Balon tells her that they will continue fighting, but Yara argues that invading the North is pointless since they are unable to hold the strongholds they conquer against the mainland armies and the strongholds in the mainlands aren't really valuable to the Ironborn because they are so far away from the sea. Balon says that one of the reasons that the invasion wasn't successful was because Yara wasted men when she attempted to rescue Theon, which she says she will not apologize for. Yara continues to try to convince Balon to end the rebellion, saying the only reason they were able to take strongholds in the North in the first place was because the Northerners were in the south fighting a war, and now that war is over. She reminds Balon that the last time they provoked the Northerners too far they were crushed and her two oldest brothers were killed. Balon tells her that when she rules she can be content with their current standing, but for now she needs to obey his commands or he will make another heir who will.\nBalon starts walking on the swinging rope bridge that separates two of the towers of Pyke. Through the storm, he sees a man standing on the bridge who is blocking his way. He tells the man to get out of the way, but the man reveals himself to be Balon's younger brother, Euron Greyjoy. Balon tells him that he's surprised that he's still alive, and Euron mocks the Drowned God, telling Balon that he is the Drowned God. Balon explains that he heard a rumor that Euron lost his senses during a storm and his crew had to tie him to the mast of the ship to prevent him from jumping overboard. Euron doesn't deny the rumor, and explains to Balon that he cut the tongues out of all of his crew members because he wanted silence. Euron then says that Balon is too old to rule and that he's been ruling long enough and it's someone else's turn. Balon tells Euron that he isn't a true Ironborn because he lost his wits during a thunderstorm and tries to stab him, but Euron throws him off the rope bridge to his death.\nAt Balon's funeral, Yara tells the priest, Aeron Greyjoy, Balon's youngest brother, that she will find the person who did this and feed them to sharks while they're still alive. She swears to do this upon the Salt Throne and Aeron explains to her that she isn't the ruler yet, because the law says that the Kingsmoot chooses the next ruler. Yara argues that her father wanted her to rule, but Aeron says that he doesn't make the law."},{"location":"At the Wall","content":"At Castle Black, nightfall has arrived and the band of black brothers loyal to Jon have not yet surrendered. When Davos refuses a final ultimatum from Ser Alliser Thorne, the acting Lord Commander orders the door to be battered down with a sledgehammer. Before the mutineers can break in, however, Edd returns with Tormund Giantsbane and an army of wildlings. Though Thorne demands that the watchmen stand and fight, they are intimidated into surrender by the giant, Wun Wun, enabling an almost bloodless takeover. One archer shoots an arrow into Wun Wun's back, which has no effect upon the giant other than to cause Wun Wun to grab the archer off his perch and smash his skull against a wall. The watchmen, seeing this, quickly throw down their arms and surrender. No wildlings are hurt.\nThorne, plus Olly and the officers who mutinied alongside him, are led away to the Ice Cells. As Tormund inspects Jon's corpse, Davos visits Melisandre, who has donned her normal glamor but is still gripped by a crisis of faith. When he asks her if reviving Jon is possible, she admits to having seen it done, but insists that she cannot do it, having lost faith in the Lord of Light due to the failure of her predictions regarding Stannis Baratheon to come true. After Davos implores her simply to try, she agrees. After washing Jon's wounds clean and burning his hair, she attempts to revive him using murmured High Valyrian incantations, but it seems they have no effect. After a moment, Tormund leaves, and Melisandre offers a final \"please\" in the Common Tongue, but leaves the room, despondent. Edd and finally Davos follow her a moment later. Once the room is empty however, Ghost, who had been sleeping underneath the table upon which Jon was lying, perks up, and Jon suddenly awakens, gasping for air."}],"firsts":["King's Landing boaster","Lyanna Stark","Lord Harald Karstark","Newborn Bolton","Euron Greyjoy","Aeron Greyjoy"],"deaths":["King's Landing boaster","Lord Roose Bolton","Lady Walda Bolton","Newborn Bolton","King Balon Greyjoy"],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Nikolaj Coster-Waldau","character":"Ser Jaime Lannister"},{"actor":"Lena Headey","character":"Queen Mother Cersei Lannister"},{"actor":"Kit Harington","character":"Jon Snow"},{"actor":"Liam Cunningham","character":"Ser Davos Seaworth"},{"actor":"Carice van Houten","character":"Lady Melisandre"},{"actor":"Sophie Turner","character":"Princess Sansa Stark"},{"actor":"Nathalie Emmanuel","character":"Missandei"},{"actor":"Maisie Williams","character":"Arya Stark"},{"actor":"Conleth Hill","character":"Varys"},{"actor":"Jonathan Pryce","character":"the High Sparrow"},{"actor":"Kristofer Hivju","character":"Tormund Giantsbane"},{"actor":"Alfie Allen","character":"Theon Greyjoy"},{"actor":"Tom Wlaschiha","character":"Jaqen H'ghar"},{"actor":"Iwan Rheon","character":"Ramsay Bolton"},{"actor":"Michael McElhatton","character":"Lord Roose Bolton"},{"actor":"Gwendoline Christie","character":"Brienne of Tarth"},{"actor":"Dean-Charles Chapman","character":"King Tommen Baratheon"},{"actor":"Isaac Hempstead-Wright","character":"Bran Stark"},{"actor":"Max von Sydow","character":"the Three-eyed raven"},{"actor":"Patrick Malahide","character":"King Balon Greyjoy"},{"actor":"Owen Teale","character":"Ser Alliser Thorne"},{"actor":"Ben Crompton","character":"Eddison Tollett"},{"actor":"Pilou Asbæk","character":"Euron Greyjoy"},{"actor":"Michael Feast","character":"Aeron Greyjoy"},{"actor":"Jacob Anderson","character":"Grey Worm"},{"actor":"Gemma Whelan","character":"Princess Yara Greyjoy"},{"actor":"Kristian Nairn","character":"Hodor"},{"actor":"Faye Marsay","character":"The Waif"},{"actor":"Ellie Kendrick","character":"Meera Reed"},{"actor":"Daniel Portman","character":"Podrick Payne"},{"actor":"Ian Whyte","character":"Wun Wun"},{"actor":"Kae Alexer","character":"Leaf"},{"actor":"Hafþór Júlíus Björnsson","character":"Ser Gregor Clegane"},{"actor":"Elizabeth Webster","character":"Walda Bolton"},{"actor":"Dylan Edwards","character":"a King's Landing boaster"},{"actor":"Richard Rycroft","character":"Maester Wolkan"},{"actor":"Paul Rattray","character":"Lord Harald Karstark"},{"actor":"Brenock O'Connor","character":"Olly"},{"actor":"Nell Tiger Free","character":"Princess Myrcella Baratheon (corpse)"},{"actor":"Annette Tierney","character":"young Old Nan"},{"actor":"Sam Coleman","character":"Wyllis (young Hodor)"},{"actor":"Fergus Leathem","character":"young Rodrik Cassel"},{"actor":"Richard Laing","character":"Lannister captain"},{"actor":"Sebastian Croft","character":"young Eddard Stark"},{"actor":"Cordelia Hill","character":"young Lyanna Stark"},{"actor":"Matteo Elezi","character":"young Benjen Stark"},{"actor":"Michael Hayes","character":"a Night's Watch man"},{"actor":"Brian Fortune","character":"First Builder Othell Yarwyck"},{"actor":"Michael Condron","character":"First Steward Bowen Marsh"},{"actor":"Tony Flynn","character":"a Night's Watch man"},{"actor":"Robert Fawsitt","character":"a loyal Night's Watch man"},{"actor":"Steve Cash","character":"a loyal Night's Watch man"}]}
