{"title":"The Door","season":"6","episode":"5","date":"Sun May 22 2016","authors":["David Benioff","D.B. Weiss"],"directors":["Jack Bender"],"info":"\"The Door\" is the fifth episode of the sixth season of Game of Thrones. It is the fifty-fifth episode of the series overall. It premiered on May 22, 2016. It was written by David Benioff and D.B. Weiss, and directed by Jack Bender.","plot":"Tyrion seeks a strange ally. Bran learns a great deal. Brienne goes on a mission. Arya is given a chance to prove herself.","summary":[{"location":"At the Wall","content":"Sansa refuses Littlefinger's offer.  \nSansa Stark receives a message bearing the sigil of House Baelish, asking her to a meeting in Mole's Town. Accompanied by Brienne, Sansa furiously confronts Petyr Baelish, asking if he was aware what Ramsay Bolton was capable of. Baelish deflects, saying he has the knights of The Vale waiting at Moat Cailin to aid Sansa. She is mistrustful of him when he claims he had no idea of Ramsay's abusive treatment of her. She doubts Baelish's ability to protect her or even himself, threatening to have Brienne kill him. He says he'll do whatever she asks and Sansa tells him to leave and never come back for her. He obeys, but not before informing that her great-uncle Brynden Tully has recaptured Riverrun and recommending she seek him out and the remaining loyal Tully forces. Sansa says she already has an army, her brother Jon Snow's army of wildlings. \"Half-brother,\" Baelish clarifies as he walks away, reminding her that Jon is only her half brother.\nAt Castle Black, a war council is called, and is attended by Sansa, Brienne, Podrick, Jon, Davos, Melisandre, Tormund and Eddison Tollett, who discuss the need for more men to defend Castle Black, since the Karstarks and Umbers, two major Houses in the North, have declared for Ramsay. Jon points out that they can summon the rest of the minor Houses, such as the Mormonts, Glovers, Cerwyns, and Mazins, to rival their enemies, and Sansa reveals Brynden's successful retaking of Riverrun, though she claims she learned via one of Ramsay's ravens in order to stop Jon from pursuing Littlefinger. Sansa subsequently tasks Brienne and Podrick with securing Brynden's help while the rest of them leave Castle Black to start building their army. Before leaving Castle Black, Sansa presents Jon with a new cloak like their father's, carrying the Stark sigil.\n\nI"},{"location":"In Braavos","content":"The Waif continues to drill Arya, mocking her high-born origins. Jaqen H’ghar explains that the Faceless Men were slaves in Valyria before establishing the Free City of Braavos and the House of Black & White. Handing Arya a vial, Jaqen tells her an actress, Lady Crane, will be the next to receive the Many-Faced God’s “gift.”\n\n    Arya watches The Bloody Hand, a stage-play in Braavos loosely based on the recent civil wars in Westeros.  \nArya enjoys the spectacle of the actors re-enacting the War of the Five Kings, playing Baratheons and Lannisters, but her pleasure ceases when her father, and his execution, are inaccurately caricatured. Eddard is portrayed as a buffoon, and the actress who plays Sansa has her breasts bared to the audience. Arya sneaks into the dressing room after the play to observe her target – the actress playing Cersei – who appears to be a clever, decent woman. Arya later shares with Jaqen her plan to poison Lady Crane’s rum, which no one else in the troupe drinks. Arya suspects that a jealous younger actress, Bianca, has commissioned the kill. Jaqen cuts her off, reminding her a servant does not question."},{"location":"In the Dothraki Sea","content":"Jorah shows his arm to Daenerys.  \nDaenerys is unsure of what to do with Jorah, having banished him twice, seeing him defiantly return twice, and him twice saving her life. Jorah finally confesses his love for Daenerys, but also reveals his spreading greyscale infection, and says that this time, he needs to leave for good. He starts to leave and states his plan to take his own life well before the greyscale envelops him, but Daenerys tearfully commands him to find a cure and come back to her side when she conquers Westeros. Jorah then departs while Daenerys and Daario Naharis lead the Dothraki horde back to Meereen.\n\nI"},{"location":"In Meereen","content":"Kinvara, the High Red Priestess.  \nWhile the rulers of Meereen enjoy a tenuous peace, Tyrion reminds them of the need to convince the Meereenese that everything has been done with Daenerys's blessing, as the Masters could use Tyrion and Varys's foreign status against them to reclaim Slaver's Bay. To that end, Tyrion invites Kinvara, High Priestess of the Red Temple of Volantis, to negotiate spreading the word of Daenerys's accomplishments. To Tyrion's surprise, Kinvara appears to be highly accommodating in supporting Tyrion's goals, as she firmly believes that Daenerys is The Prince That Was Promised. Varys is more skeptical, being suspicious of any practitioners of magic, and points out that Melisandre had already declared Stannis Baratheon to be the Prince, only for him to be defeated twice. Kinvara says that while the Lord of Light has a plan, the humans following him do occasionally make errors. She then unnerves Varys by revealing that she knows Varys was emasculated by a \"second-rate sorcerer\" and offers to repeat the words he heard in the flames, and identify who it was that spoke. Varys is uncharacteristically unsettled by this revelation. Kinvara then assures Tyrion that she will send the preachers and priests best suited to the task at hand.\n\nI"},{"location":"In the Iron Islands","content":"As the Kingsmoot is held, Yara Greyjoy is the first to lay claim to the Salt Throne. Yara argues that raiding the mainland is not enough for their people, and that they need to use military force to teach the mainlanders a lesson. An Ironborn man challenges Yara's candidacy on the grounds that she is a woman and points out that her brother Theon Greyjoy has returned. Theon endorses his older sister and urges the gathering to do the same; stressing that she is a warrior, a reaver, and an Ironborn. Many shout for Yara to be their Queen.\nBefore they can crown Yara, Euron Greyjoy joins the gathering to lay claim to the Salt Throne. He openly mocks Theon for his military failures and emasculation before deriding Yara as a woman. Yara in turn accuses Euron of killing their King and her father Balon. To her surprise, Euron admits killing Balon but then defends his actions on the grounds that Balon was leading them to defeat in the North. When Euron states that his only regret is not killing Balon years earlier, he is met by resounding cheers from the crowd. Theon then counters that Euron had spent years gallivanting overseas while Yara was commanding Ironborn ships and men. Yara then suggests building a massive fleet to attack and make their mark on Westeros.\n\n    Euron Greyjoy, King of the Iron Islands.  \nIn response, Euron announces that he also supports expanding the Ironborn fleet. Revealing a trick up his sleeve, he then proposes to marry Daenerys Targaryen and then carry her army and dragons back to Westeros. The Ironborn support Euron's plan and declare him king. The Drowned Men priest Aeron Greyjoy then leads Euron down to the sea to be drowned and reborn, as is the custom. Knowing that Euron will kill them as soon as he is able, Yara, Theon, and many of their loyalists flee the Iron Islands during Euron's coronation, taking much of the Iron Fleet with them. After Euron revives himself, he is crowned by his brother Aeron. After learning that his niece and nephew have fled with their best ships, Euron calls on his followers to build their own ships so that he may pursue the pair and kill them.\n\nB"},{"location":"Beyond the Wall","content":"The Three-eyed Raven  shows Bran a vision of a heart tree amid spirals of standing stones in a lush green valley. His vision shows Leaf and other Children of the Forest talking amongst themselves, then looking eagerly at a captive bound to the tree. Leaf approaches and forces a Dragonglass dagger into the captive's chest. The captive screams, but does not die, instead becoming the first White Walker.\nBran immediately confronts Leaf about creating the White Walkers in the first place. Leaf tries to explain that they were at war with the First Men and were desperate. Later, Bran is the only one in the cave awake and is anxious to warg back into the Weirwood tree. Bran wargs into the tree by himself and sees the Army of the Dead. He slowly walks through the army until he comes to a space occupied by four White Walkers, including the Night King.  As Bran becomes aware that the The Night King and the dead are now able to see him, the Night King grabs his arm, branding him with an icy mark. He breaks out of the vision with a scream waking the others.  The Three-eyed Raven tells Bran, Meera and Hodor that the Night King is now able to locate Bran and able to bypass the powerful magic keeping the White Walkers and the wights out of the cave.  As a result, they must leave now and Bran must \"become\" the Three-eyed Raven. Bran asks whether he is ready, and the Raven says \"No\" at which point Bran's eyes whiten as he enters another vision.\nAs Meera and Hodor are preparing to leave they notice the air is so cold their breath is visible, indicating the arrival of the Army of the Dead outside of the cave.  The Night King and three White Walkers start marching towards the cave. The Children of the Forest try using magic projectiles to fend the Walkers off, but are overwhelmed. They light a fire around the entrance which prevents the wights from entering but the Walkers extinguish a pathway and walk through.  The wights end up climbing over the Weirwood and dropping through roots at the top of the cave. Meera desperately tries to get Bran out of the vision and attempts to get the frightened Hodor to carry Bran away to no avail. Using a dragonglass-tipped spear, Meera kills the first White Walker that enters, and fights alongside the remaining Children of the Forest to try to fend off the wights until Bran wakes up. Wights begin to swarm the cave, killing all of the Children of the Forest except for Leaf, as Meera starts yelling at Bran to warg into Hodor.\nIn the vision, Bran is at Winterfell watching Ned Stark say goodbye to his father, Rickard Stark, before being sent to the Vale as a ward. While still in the vision, Bran hears Meera's cries to warg into Hodor and the Three-eyed Raven tells him to listen to her. Bran wargs into both the present-day Hodor in the cave AND Wylis, the young version of Hodor in his vision.\n\n    Wylis seizing, as his words \"hold the door\" evolve into \"Hodor\".  \nThe Hodor in the cave puts Bran's body on a sled and starts hauling him down a tunnel leading out of the cave with Leaf and Meera, as Bran's direwolf Summer is killed attacking the wights. As the wights are closing in on them, Leaf sacrifices herself, using magic to cause a huge explosion, buying the other three enough time to get to a door at the end of the tunnel. While the Three-eyed Raven and Bran are still sharing a vision, the Night King kills the Three-Eyed Raven, and his figure within Bran's vision blows away as ashes and rags.\nWith some difficulty Hodor pushes the door open and pulls Bran through, coming back to help Meera close the door just as the wights approach. Meera grabs Bran's sled and tells Hodor to bar the exit, shouting to \"Hold the door!\". Inside Bran's vision, Wylis notices Bran, who links the present Hodor to the past Wylis. Wylis begins to seize when he enters the mind of his future self. As Meera continues to yell \"Hold the door!\" to present-day Hodor, within Bran's vision Wylis falls to the ground convulsing and starts repeating this same sentence in the midst of his seizure. Eventually, \"hold the door\" slurs into \"Hodor,\" as his condition deteriorates and it becomes apparent this is the moment Hodor lost the ability to say any other words, and his destiny was fixed.\nPresent-day Hodor braces himself against the door long enough for Meera to disappear into the snow with Bran's unconscious body on the sled. Inevitably, the wights break through parts of the wood and begin scratching and stabbing a visibly distressed Hodor. With no possibility of escape, all that is shown at the end is young Wylis in the past seizing and crying out \"Hodor.\""}],"firsts":["Izembaro","Clarenzo","Lady Crane","Camello","Bobono","Bianca","Kinvara","Lord Rickard Stark (Flashback)"],"deaths":["White Walker","Summer","Three-eyed raven","Leaf","Hodor"],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Emilia Clarke","character":"Queen Daenerys Targaryen"},{"actor":"Kit Harington","character":"Jon Snow"},{"actor":"Aidan Gillen","character":"Lord Petyr Baelish"},{"actor":"Liam Cunningham","character":"Ser Davos Seaworth"},{"actor":"Carice van Houten","character":"Melisandre"},{"actor":"Sophie Turner","character":"Princess Sansa Stark"},{"actor":"Nathalie Emmanuel","character":"Missandei"},{"actor":"Maisie Williams","character":"Princess Arya Stark"},{"actor":"Conleth Hill","character":"Varys"},{"actor":"Isaac Hempstead-Wright","character":"Prince Bran Stark"},{"actor":"Kristofer Hivju","character":"Tormund Giantsbane"},{"actor":"Alfie Allen","character":"Prince Theon Greyjoy"},{"actor":"Michiel Huisman","character":"Daario Naharis"},{"actor":"Gwendoline Christie","character":"Brienne of Tarth"},{"actor":"Tom Wlaschiha","character":"Jaqen H'ghar"},{"actor":"Iain Glen","character":"Ser Jorah Mormont"},{"actor":"Max von Sydow","character":"the three-eyed raven"},{"actor":"Kristian Nairn","character":"Hodor"},{"actor":"Richard E. Grant","character":"Izembaro"},{"actor":"Essie Davis","character":"Lady Crane"},{"actor":"Pilou Asbæk","character":"King Euron Greyjoy"},{"actor":"Gemma Whelan","character":"Princess Yara Greyjoy"},{"actor":"Ben Crompton","character":"Eddison Tollett"},{"actor":"Ellie Kendrick","character":"Meera Reed"},{"actor":"Faye Marsay","character":"the Waif"},{"actor":"Jacob Anderson","character":"Grey Worm"},{"actor":"Michael Feast","character":"Aeron Greyjoy"},{"actor":"Kae Alexer","character":"Leaf"},{"actor":"Daniel Portman","character":"Podrick Payne"},{"actor":"Darrell D'Silva","character":"an Ironborn"},{"actor":"Kevin Eldon","character":"Camello"},{"actor":"Leigh Gill","character":"Bobono"},{"actor":"Eline Powell","character":"Bianca"},{"actor":"Rob Callender","character":"Clarenzo"},{"actor":"Eva Butterly","character":"the mummer playing Margaery Tyrell"},{"actor":"Vladimir Furdik","character":"the Night King"},{"actor":"Ania Bukstein","character":"Kinvara"},{"actor":"Gerald Lepkowski","character":"Zanrush"},{"actor":"Annette Tierney","character":"Old Nan"},{"actor":"Sam Coleman","character":"young Hodor"},{"actor":"Wayne Foskett","character":"Lord Rickard Stark"},{"actor":"Sebastian Croft","character":"Eddard Stark"},{"actor":"Matteo Elezi","character":"Benjen Stark"},{"actor":"Fergus Leathem","character":"Ser Rodrik Cassel"},{"actor":"Kate Anthony","character":"a Braavosi woman"},{"actor":"Sally Mortemore","character":"a Braavosi woman"},{"actor":"Michael Hooley","character":"a Night's Watch man"},{"actor":"Ruairí Heading","character":"a Night's Watch man"},{"actor":"Robert Render","character":"an Ironborn"},{"actor":"James Lecky","character":"an Ironborn"},{"actor":"Glen Barry","character":"a mummer"},{"actor":"Brendan O'Rourke","character":"a mummer"},{"actor":"Ross Anderson-Doherty","character":"a mummer"},{"actor":"Nanna Bryndís Hilmarsdóttir","character":"a musician"},{"actor":"Ragnar Þórhallsson","character":"a musician"},{"actor":"Arnar Rósenkranz Hilmarsson","character":"a musician"},{"actor":"Brynjar Leifsson","character":"a musician"},{"actor":"Kristján Páll Kristjánsson","character":"a musician"}]}
