{"title":"A Golden Crown","season":"1","episode":"6","date":"Sun May 22 2011","authors":["Jane Espenson","David Benioff","D.B. Weiss"],"directors":["Daniel Minahan"],"info":"\"A Golden Crown\" is the sixth episode of the first season of Game of Thrones. It is the sixth episode of the series overall. It first aired on May 22, 2011. It was written by Jane Espenson, David Benioff & D.B. Weiss and directed by Daniel Minahan.","plot":"In Vaes Dothrak, Viserys' frustrations at the constant delays before he can receive his crown boil over. In King's Landing, while King Robert goes on a hunt, Eddard issues a decree that could splinter the Seven Kingdoms and makes a startling discovery about the heirs to the throne. In the Eyrie, Tyrion Lannister wagers everything on the greed of the sellsword Bronn.","summary":[{"location":"In the Crownlands","content":"Lord Eddard Stark wakes up after a long period of unconsciousness, due to the injuries inflicted on him by Jaime Lannister's men. He finds both King Robert Baratheon and Queen Cersei waiting. \n\n    King Robert's hunting party.  \nCersei is furious with Eddard's acts in having her brother Tyrion arrested and attacking Jaime in the street. She wants Robert to take action against him, but Robert refuses to condemn him without hearing Eddard's side, and tells her to be silent. When Cersei protests further, and calls Robert a woman, he hits her. She says that she will wear the bruise with honor. He tells her to be silent, or he will honor her again, and Cersei leaves in anger. Afterwards, Robert restores Eddard to his position as King's Hand, and tells him not to quit again, or he will give the position to Jaime Lannister. He tells Lord Eddard to end the animosity between House Stark and House Lannister, as strife between these two powerful houses could lead them into war. He is leaving on a hunt and wants the realm at peace by the time he returns.\nArya has another \"dancing\" lesson with Syrio Forel, but isn't in the mood due to Jory's death. Syrio tells her that she may need to fight at any time, not just when she's in the mood. He wisely reminds her that being prepared to fight is more important in times of sadness than in peaceful times of happiness.\nKing Robert is out hunting, accompanied by his brother Renly, Ser Barristan Selmy and Lancel Lannister. Robert, being supplied with wine by Lancel, becomes drunk and nostalgic, longing for the days of young knights trying to make a name for themselves and when enemies stood openly in opposition (instead of being hidden schemers). Robert brags about all the women he has bedded, but Renly becomes irate when he begins to question him about his history with women. Renly calls him a fool and remarks that the past had its share of violence that Robert is conveniently ignoring. Renly storms off, leaving Ser Barristan to look on concerned, as Lancel keeps up King Robert's wine supply.\nIn King's Landing, at a meeting of the small council, a group of refugees come to tell of how their villages have been destroyed. Eddard hears tales of a huge knight ravaging the Riverlands. He realizes that it's Ser Gregor Clegane, \"The Mountain\", who is likely under Lannister orders to punish the Riverlands - which are held by House Tully, the former House of his wife Catelyn, who now holds Tyrion captive. Even though King Robert told him to make peace with the Lannisters, Lord Eddard could not bring himself to let this injustice stand. Eddard strips Gregor Clegane of his knighthood, land, and titles, and sends Lord Beric Dondarrion with a retinue of one hundred knights to arrest and execute him in the king's name. \n\n    Eddard discovers the secret Jon Arryn died for.  \nHe also orders Grand Maester Pycelle to send word to Casterly Rock, demanding Lord Tywin Lannister's presence in court to explain his bannerman's actions or be branded an enemy of the crown and a traitor to the realm. 'Littlefinger' Petyr Baelish, and Grand Maester Pycelle are both concerned with the harshness of these orders and Eddard's actions against the Lannisters, but Eddard wants to see justice done.\nPrince Joffrey comes to apologize to Sansa for the incident on the Kingsroad. He calls her his lady love and gives her a necklace. Sansa forgives him, and they seem reconciled. Sansa is unaware that the Queen put Joffrey up to the apology some time ago.\nEddard decides to send his daughters back to Winterfell. Arya is worried that she must leave Syrio. Sansa protests that no one cares about her trivial dancing instructor, they are talking about breaking her betrothal to Joffrey. Lord Eddard says that he will find someone else for her. Sansa refuses—she is going to marry Joffrey and have lots of golden-haired babies. This gives Eddard pause and sends him back to the book that Jon Arryn was looking at before he died. Consulting the book's entry on House Baratheon, Lord Eddard finds that every time a Baratheon has married, the children have had black hair…right up to Cersei and Robert's children, who are all blond."},{"location":"In the North","content":"Stiv and Osha accost Bran near Winterfell.  \nIn Winterfell, Bran has another dream about the three-eyed raven, in which it flies into the castle's crypts. He wakes up to find that Hodor has brought the finished saddle designed by Tyrion. He goes on a ride with Robb and Theon. They have had word from King's Landing about Eddard's injury, Jory's death and Tyrion's capture. Theon thinks that Robb should prepare the North for war, but Robb is determined to make his own decision for when that time has come, and until then will follow his parents' orders to remain in Winterfell. They discover that Bran has wandered off on his horse and go looking for him. Robb finds a group of wildlings threatening Bran and trying to steal his horse. Robb kills two, but another wildling holds Bran with a knife to the throat. Theon shoots him from behind, angering Robb by endangering Bran. The remaining wildling, a woman named Osha, yields and begs for her life. Robb agrees to take her as a prisoner.\n\n    Theon tells Ros he will miss her as she leaves for King's Landing.  \nRos, the prostitute that Theon frequently sees, is departing Winterfell for King's Landing on the back of a turnip cart. Theon stops her and unsuccessfully tries to persuade her to stay. She explains that war is now imminent and the men (and thus her customer base) of Winterfell are destined to leave soon and probably never return; her departure is thus an economically essential decision. He throws her a coin to get her to raise her skirt one last time. As she rides off he says that he will miss her. She agrees that he will.    Tyrion's verbal skills are wasted on Mord."},{"location":"In the Vale","content":"At the Eyrie, Tyrion almost rolls out of his sky cell in his sleep, to his consternation. He tries to make a bargain with the gaoler, Mord, to no avail.\nTyrion convinces Mord to carry a message to Lady Lysa Arryn and, in exchange, he will give Mord the gold he had with him when he was captured. Lysa summons Tyrion, believing that the sky cell has broken his spirit, but all he confesses to is being a liar, a whoremonger, and a player of practical jokes. He maintains his innocence of the crimes of conspiracy to commit murder.\n\n    Tyrion on trial in the Eyrie.  \nHowever, Tyrion uses the opportunity of his audience in front of Lysa's court to publicly demand his right to justice and a trial, and Lysa is shamed into agreeing. Given that Lysa's son is a young boy and wouldn't make a good judge in a formal trial, Tyrion instead demands a trial by combat, which Lysa also reluctantly agrees is his right. Given that neither Lysa nor her young son can fight in a trial by combat, she asks for a volunteer to be her champion, and Ser Vardis Egen agrees. Egen is unwilling to fight Tyrion however, as killing such an outmatched opponent would be dishonourable. Tyrion names his own champion: his brother Jaime, considered one of the best swordsmen in the realm. At this Lysa does object, as Jaime is not present and she does not want to wait. She demands that he pick a champion from those present. Tyrion desperately asks for volunteers, and after a long pause during which it seems that Tyrion's cause is lost, the sellsword Bronn steps forward and says he will stand for him.    Bronn kicks Ser Vardis Egen's corpse out of the Moon Door.  \nBronn fights defensively, waiting for Vardis to tire, as unlike Bronn he is dressed in full armor. Bronn finally gets his chance; he first wounds and then kills Vardis, sending his body rolling out of the \"Moon Door\" that leads to a thousand-foot drop. Lysa complains that Bronn did not fight with honor. Bronn agrees, but indicates that Vardis did fight with honor. Tyrion has proven his innocence in the eyes of the gods. He retrieves his gold from Ser Rodrik and gives it to Mord. When Robin asks if he can make the little man fly now, Tyrion says, \"This little man is going home.\" Bronn and Tyrion are allowed to depart.\n\nA"},{"location":"Across the Narrow Sea","content":"Daenerys and one of her dragon eggs.  \nIn Vaes Dothrak, Daenerys Targaryen is studying her dragon eggs. Despite Illyrio's claim that they are now only stone, she ponders if they might be hatched by extreme heat, and places an egg on a brazier. Nothing happens, to her disappointment. She is removing the egg from the brazier, when Irri comes in and thinks she will scald herself. Irri takes the egg from her, but Daenerys is completely unharmed, and it is Irri who suffers scalding burns on her own hands.\nDaenerys is summoned by the crones who rule the city, the dosh khaleen, the wives of khals slain in battle. She eats a stallion's heart and the crones read the omens. At first it seems Dany won't keep the raw meat down, but, to both her and Drogo's relief, she is able to compose herself. The crones declare Daenerys and Drogo's son will be \"The Stallion That Mounts The World\", a great conqueror whose coming is long foretold in Dothraki history. Daenerys says his name will be Rhaego, for her brother Rhaegar, slain by the usurper Robert Baratheon. Viserys is not impressed and rather disgusted by it all. He stands with Ser Jorah who explains the ritual to him. It is only when the Dothraki are chanting Rhaego's name, and Drogo lifts Daenerys up and carries her about the room, that Viserys realizes they love her. \n\n    Jorah Mormont prevents Viserys from stealing Dany's eggs.  \nHe storms out of the tent. Viserys is later discovered in Daenerys' tent by Ser Jorah Mormont, trying to steal Dany's dragon eggs, but Jorah won't let him. Viserys tells Ser Jorah that to rule one must be feared or loved, and he has never been loved as the Dothraki love Dany. He says he knows that Jorah wants Daenerys, but he doesn't care. He just wants the eggs so he can hire an army, but he can't get past Ser Jorah and must leave the eggs. Mormont watches him as he leaves.\nDrunk, bitter and angry, Viserys interrupts a feast for Daenerys and Drogo. He angrily demands his payment in return for giving Daenerys to Drogo. Then he draws his sword, which is considered an offense punishable by death in the sacred city, and threatens Dany and the unborn child, while Irri translates to Drogo. \n\n    Khal Drogo gives Viserys a golden crown.  \nDrogo responds that he will give Viserys a golden crown \"that men will tremble to behold\", and Viserys is pleased until Drogo's bloodrider Qotho breaks his arm, making him drop the sword, and kicks him to the floor. Drogo melts his golden belt in a pot, while Viserys begs Daenerys to help him. Ser Jorah tells her to look away, but she won't. She watches as Khal Drogo \"crowns\" Viserys by pouring molten gold over his head, causing Viserys to cry out in pure agony. As Daenerys watches her brother die, she coldly states that, having been killed by fire, Viserys was no true dragon."}],"firsts":["Osha","Stiv","Wallen","Dothraki crone","Knight of House Lynderly","Lord Eon Hunter","Lord Beric Dondarrion","Steffon","Joss"],"deaths":["Wallen, throat ripped open by Robb Stark","Unidentified wildling, stabbed by Robb Stark","Stiv, shot with an arrow by Theon Greyjoy","Ser Vardis Egen, throat slit by Bronn","Prince Viserys Targaryen, crowned with molten gold by Drogo"],"cast":[{"actor":"Sean Bean","character":"Lord Eddard Stark"},{"actor":"Mark Addy","character":"King Robert Baratheon"},{"actor":"Michelle Fairley","character":"Lady Catelyn Stark"},{"actor":"Lena Headey","character":"Queen Cersei Lannister"},{"actor":"Emilia Clarke","character":"Princess Daenerys Targaryen"},{"actor":"Iain Glen","character":"Ser Jorah Mormont"},{"actor":"Aidan Gillen","character":"Petyr Baelish"},{"actor":"Harry Lloyd","character":"Prince Viserys Targaryen"},{"actor":"Richard Madden","character":"Robb Stark"},{"actor":"Sophie Turner","character":"Sansa Stark"},{"actor":"Maisie Williams","character":"Arya Stark"},{"actor":"Alfie Allen","character":"Theon Greyjoy"},{"actor":"Isaac Hempstead-Wright","character":"Bran Stark"},{"actor":"Jack Gleeson","character":"Prince Joffrey Baratheon"},{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Jason Momoa","character":"Khal Drogo"},{"actor":"Jerome Flynn","character":"Bronn"},{"actor":"Ron Donachie","character":"Ser Rodrik Cassel"},{"actor":"Ian McElhinney","character":"Lord Commander Barristan Selmy"},{"actor":"Finn Jones","character":"Ser Loras Tyrell"},{"actor":"Kate Dickie","character":"Lady Lysa Arryn"},{"actor":"Julian Glover","character":"Grand Maester Pycelle"},{"actor":"Gethin Anthony","character":"Lord Renly Baratheon"},{"actor":"Emun Elliott","character":"Marillion"},{"actor":"Miltos Yerolemou","character":"Syrio Forel"},{"actor":"Ciaran Bermingham","character":"Mord"},{"actor":"Susan Brown","character":"Septa Mordane"},{"actor":"Natalia Tena","character":"Osha"},{"actor":"Lino Facioli","character":"Lord Robin Arryn"},{"actor":"Esme Bianco","character":"Ros"},{"actor":"Amrita Acharia","character":"Irri"},{"actor":"Roxanne McKee","character":"Doreah"},{"actor":"Kristian Nairn","character":"Hodor"},{"actor":"Brendan McCormack","character":"Ser Vardis Egen"},{"actor":"Elyes Gabel","character":"Rakharo"},{"actor":"Dar Salim","character":"Qotho"},{"actor":"Eugene Simon","character":"Lancel Lannister"},{"actor":"Amira Ghazella","character":"a Dothraki Crone"},{"actor":"Niall Cusack","character":"Joss"},{"actor":"Stephen Don","character":"Stiv"},{"actor":"Patrick Rocks","character":"Ser Jon Lynderly"},{"actor":"Barrington Cullen","character":"Lord Eon Hunter"},{"actor":"Barry O'Connor","character":"Wallen"},{"actor":"David Michael Scott","character":"Lord Beric Dondarrion"},{"actor":"Unknown","character":"Cohollo"},{"actor":"Unknown","character":"Haggo"}]}
