{"title":"Fire and Blood","season":"1","episode":"10","date":"Sun Jun 19 2011","authors":["David Benioff","D.B. Weiss"],"directors":["Alan Taylor"],"info":"\"Fire and Blood\" is the tenth and final episode of the first season of Game of Thrones. It is the tenth episode of the series overall. It first aired on June 19, 2011. It was written by executive producers David Benioff & D.B. Weiss and directed by Alan Taylor.","plot":"David Benioff &D.B. Weiss","summary":[{"location":"In King's Landing","content":"At the Great Sept of Baelor, Eddard Stark has been executed by beheading; The great sword Ice is covered in blood, and Sandor Clegane standing next to Ser Ilyn Payne, the royal executioner, holds Lord Eddard's head up to the adulation of the baying crowd. Sansa Stark has fainted. In the crowd, Yoren drags Arya away, making a point of calling her \"Boy\". Once he gets her out of the courtyard, he cuts her hair off with a knife. He tells her that he will get her out of King's Landing and to Winterfell as a recruit of the Night's Watch, but he warns her not to trust the other recruits, since apparently half would hand her over to Cersei for a pardon, while the other half would do the same, but only after raping her first.\nJoffrey is holding court and a singer is brought before him, charged with making up an amusing but offensive song about Robert and Cersei. The song says that the boar might have killed King Robert, but the lion in his bed had previously castrated him. The singer turns out to be Marillion, who Catelyn and Ser Rodrik met at the Inn at the Crossroads, and who accompanied them and Tyrion to the Vale of Arryn. Joffrey asks Marillion if he wants to keep his hands or tongue. Marillion fearfully responds that everyone needs hands. Joffrey commands Ilyn Payne to cut out the tongue instead. Joffrey then takes Sansa up to the walls to see her father's head and makes her look at it. He cruelly mocks her, promising he will give her Robb's head next. Sansa quietly retorts that Robb might give her Joffrey's instead. Infuriated, Joffrey orders Ser Meryn Trant to beat her, as Cersei has told him that a king should not hit his queen. Sansa moves up behind Joffrey, apparently preparing to shove him off the walkway to his death, but unexpectedly Sandor Clegane dabs the blood off her lip with a handkerchief and after Joffrey leaves, tells her to give him what he wants.\n\n    Lancel and Cersei.  \nCersei Lannister has taken a new lover, her cousin Lancel who was King Robert's squire. She also receives a letter informing her of Jaime's capture. Lancel is naked in Cersei's bedroom. The thought of being at war is exciting to him, as he has just been made a new young knight. He asks for the news of the war and asks what their next move is, but Cersei tells him to shut up and get back in bed.\nGrand Maester Pycelle takes the prostitute Ros to bed, revealing that he is actually far less frail than he appears. He boasts to Ros of the several great kings he has served, lamenting first how Aerys Targaryen devolved from a charming young man into a paranoid lunatic obsessed with fire, how Robert Baratheon was a great soldier, but perhaps not so ideal a king, before displaying his sycophantic loyalty to Joffrey.\n\n    Yoren and Arya.   Yoren has assembled a band of new recruits for the Night's Watch. Pretending that Arya is a boy called \"Arry\", he has her join the group. Also in the group are Hot Pie, Lommy Greenhands, and Gendry, who unknown to him, is King Robert's bastard son. He had been working for Tobho Mott, but with Robert dead, the secret funds being sent to Mott stopped, so he fired Gendry and told him he had to join the Night's Watch. Hot Pie and Lommy try to bully Arya into giving up Needle, but she angrily draws the sword, warning that she \"has already killed one fat boy\" and will happily do it again. Gendry breaks up the argument by taking Arya's side, threatening the boys with violence to keep them from picking on Arya later. Yoren now has to get them all to the Wall, a thousand leagues away, through the war-torn Riverlands. They set out."},{"location":"In the North","content":"At Winterfell, Bran has another dream of the three-eyed raven. He wakes up and tells Osha about how the dream always ends with the bird flying into the crypts under the castle, and he tells her he thinks his father is in the tombs. Osha takes Bran down there, and Bran tells her about the histories of some of the ancestors entombed there. They are then surprised by Shaggydog, Rickon's direwolf, who leaps out at them from the empty future tomb of Eddard Stark. Rickon calls Shaggydog off, then reveals to Bran that he had the same dream. Making their way out, Osha is still trying to tell Bran that it could be a coincidence, but outside they see Maester Luwin, who holds a letter and looks at them with such sadness that it is obviously the news of Eddard's death."},{"location":"In the Riverlands","content":"Catelyn comforts her son, promising to avenge Eddard's death  At Robb's camp, Catelyn stoically walks through the encampment and receives the condolences and respect of the northern bannermen, who bow to her as she passes. She makes her way into the woods around the camp.  Once she is out of everyone's sight, she breaks down, practically hyperventilating with grief. Hearing something from deeper in the woods, she finds Robb hacking his sword at a tree in anger and grief. Lady Catelyn calls to him and tells him he is ruining his sword. Robb drops the sword and falls into her arms, vowing to kill the Lannisters who murdered his father. Catelyn comforts him and promises him revenge, but only after they rescue Sansa and Arya first.\nAt Robb's camp, Robb and his bannermen debate what to do in the war against King Joffrey. They debate whether to align with Stannis or Renly Baratheon, but there is no agreement as Renly has greater forces, but Stannis is elder and next in line of succession (if Cersei's children are discounted). Jon Umber becomes irritated and questions why the northerners should be told what to do by rulers in the south at all, reminding them that the North was once independent of the other Kingdoms before the Targaryens threatened them with their dragons. With the dragons gone, Umber declares there is only one king worthy of his respect and allegiance and bows before Robb, calling out, \"The King in the North!\" The other northern bannermen take up the cry and bow before the new King in the North, swearing fealty to Robb.\nCatelyn visits the captive Jaime Lannister who taunts her about Ned's death and offers to serve her as a lover. She hits him in the head with a rock. Jaime says that if she keeps hitting him, she can kill him and that he doesn't fear death, though Jaime probably realizes that the Starks won't kill him as long as his sister holds Sansa and Arya hostage. Catelyn tells him he has violated the laws of man and gods, and he asks where Ned's gods were when his head was cut off (he questions the existence of all gods, the Old and the New). She says injustice in the world is because of men like him. Jaime responds, \"There are no men like me, only me\". He admits to pushing Bran from the tower, but doesn't reveal why.\nAt the Lannister camp, Lord Tywin is holding a strategy meeting with his generals, and is furious that Jaime has been captured by the Starks. Both Stannis and Renly have claimed the Iron Throne, meaning the Lannisters are now faced with fighting a two-front war against the Starks to the north and the Baratheons to the south. Tywin's commanders are uncertain what to do, arguing about whether to strike while they still can, fall back and raise reinforcement armies, or sue for peace. Tyrion points out that any chance of negotiating with Robb Stark died when his father Eddard was executed. The Lannister army is now exposed, so Tywin decides to retreat to Harrenhal, the great castle on the northern shores of Gods Eye, and use it as a base of operations. Reluctantly impressed by Tyrion's astute judgment of the situation, Tywin orders his son to go to King's Landing and serve as Acting Hand of the King in Tywin's stead. He is to bring Cersei and Joffrey to heel and prevent the young king from making more idiotic mistakes. Tywin also tells him to deal with Baelish, Varys, and Pycelle if he gets so much as a hint of treachery from any of them. He also orders Tyrion to leave his whore behind. Later on in his tent, Tyrion complains about his father to Shae, then decides to defy Tywin and take Shae to court anyway."},{"location":"At the Wall","content":"Jon Snow learns of his father's death. He saddles a horse and prepares to leave to join Robb's army, ignoring Samwell's pleas to stay and fulfill his oaths. Jon leaves Castle Black, but is pursued. One of his pursuers hits a tree branch and is unhorsed, and Jon realizes it was Sam. He turns back to help him. The other riders are Grenn and Pypar. He tells them to go back or they will get in trouble too, but they say they can't go back without him. They surround him and recite their oath to the Night's Watch, and Jon realizes they are right: leaving would make him a deserter and oathbreaker, something his father would never countenance if he were alive, and Jon doesn't even know if Robb would accept his help or turn him over to the authorities. He agrees to return to the Wall with them.\nLord Commander Jeor Mormont decides to overlook Jon's brief desertion, saying many have fled the Wall, only to think better of it and return. If they executed everyone who did that, they'd have no men left. Mormont tells Jon that the war between the Lannisters and Starks is less important than what they face now, a renewed threat from the wildlings, White Walkers, and wights. Mormont means to lead the Night's Watch in force into the Haunted Forest to learn more of their foe, to prepare to battle against them, and to find the missing Benjen Stark. Jon agrees to commit himself fully to the Night's Watch and all that lies ahead."},{"location":"Across the Narrow Sea","content":"Daenerys regains consciousness.  In the wastelands beyond Lhazar, Daenerys wakes up to terrible news from Ser Jorah Mormont. Her son, Rhaego, is dead. He was born dead and deformed, covered with scales. The majority of the khalasar has also moved on, leaving them behind. However, Drogo lives. Daenerys insists on seeing her husband, and finds him a catatonic vegetable. Daenerys demands to know why, and Mirri Maz Duur explains that when Daenerys \"saved\" her, she had already been raped three times and the temple she served had been burned and defiled by the Dothraki. They had sacked her village, looted all they owned, and those not killed were enslaved. She has now gotten her revenge, not only on Drogo, but on Daenerys' child Rhaego; now her \"Stallion Who Mounts the World\" can burn no cities and slaughter no innocents. Duur agrees that Daenerys saved her life, but she says to ask Drogo what life is worth when all else is gone.\nIt is night, and Daenerys is in their tent tending to Drogo. She baths him, talks to him, even tries to seduce him, but nothing she does reaches him. She realizes he is no longer there, and seeing him in his vegetative state breaks her heart. Crying, Daenerys kisses him goodbye, then smothers him with a pillow.\nDaenerys and her small retinue prepare a funeral pyre for Drogo. She makes a speech to the few who are left saying that if they wish to go they may, but if they stay with her she will lead them into a glorious future. She frees those of them who are slaves and asks that they stay as equals. The maegi smirks as some people begin walking away. At Daenerys' command, Rakharo places the dragon eggs on the pyre, and Mirri Maz Duur is tied to a stake next to the pyre as well. She tells Daenerys that she will not scream while she is burned alive. Daenerys replies that she only wants the maegi's life. Ser Jorah believes that Daenerys intends to kill herself and pleads for her to reconsider, as they can sell the eggs and travel far away. Ignoring Jorah's pleas, she kisses his cheek, and sets the pyre alight. Mirri Maz Duur does indeed scream as she burns, and Daenerys calmly walks into the flames. She stands below the pyre as flames appear to consume her.\nAt dawn, the fire dies down. Jorah and the rest of the khalasar awake to find Daenerys sitting among the still smoldering embers, with three newly-hatched baby dragons crawling over her. Her clothes have burnt away and her body is covered in ash, but she is completely unharmed. One dragon nuzzles in her arm, another climbs her leg, and the third pulls itself up to sit on her shoulder. At the sight of the mythical animals born anew, an amazed Jorah and the few remaining Dothraki kneel and swear their allegiance to the Mother of Dragons. After she slowly stands up from the ashes, the black hatchling on her shoulder rises, spreads its wings and screams, announcing the return of dragons to the world."}],"firsts":["Rickard Karstark","Jonos Bracken","Addam Marbrand","Harys Swyft","Jaqen H'ghar (as extra)","Rorge (as extra)","Biter (as extra)","Hot Pie","Lommy Greenhands","Drogon","Viserion","Rhaegal"],"deaths":["Rhaego, stillborn","Khal Drogo, smothered by Daenerys Targaryen","Mirri Maz Duur, burned alive by Daenerys Targaryen"],"cast":[{"actor":"Sean Bean","character":"Lord Eddard Stark"},{"actor":"Michelle Fairley","character":"Lady Catelyn Stark"},{"actor":"Nikolaj Coster-Waldau","character":"Ser Jaime Lannister"},{"actor":"Lena Headey","character":"Queen Cersei Lannister"},{"actor":"Emilia Clarke","character":"Princess Daenerys Targaryen"},{"actor":"Iain Glen","character":"Ser Jorah Mormont"},{"actor":"Aidan Gillen","character":"Lord Petyr 'Littlefinger' Baelish"},{"actor":"Kit Harington","character":"Jon Snow"},{"actor":"Richard Madden","character":"Robb Stark"},{"actor":"Sophie Turner","character":"Sansa Stark"},{"actor":"Maisie Williams","character":"Arya Stark"},{"actor":"Alfie Allen","character":"Theon Greyjoy"},{"actor":"Isaac Hempstead-Wright","character":"Bran Stark"},{"actor":"Jack Gleeson","character":"King Joffrey Baratheon"},{"actor":"Rory McCann","character":"Sandor Clegane"},{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Jason Momoa","character":"Khal Drogo"},{"actor":"Donald Sumpter","character":"Maester Luwin"},{"actor":"Conleth Hill","character":"Varys"},{"actor":"Jerome Flynn","character":"Bronn "},{"actor":"James Cosmo","character":"Lord Commander Jeor Mormont"},{"actor":"Ron Donachie","character":"Ser Rodrik Cassel"},{"actor":"Charles Dance","character":"Lord Tywin Lannister"},{"actor":"Francis Magee","character":"Yoren"},{"actor":"John Bradley-West","character":"Samwell Tarly"},{"actor":"Julian Glover","character":"Grand Maester Pycelle"},{"actor":"Emun Elliott","character":"Marillion"},{"actor":"Sibel Kekilli","character":"Shae"},{"actor":"Natalia Tena","character":"Osha"},{"actor":"Esme Bianco","character":"Ros"},{"actor":"Clive Mantle","character":"Greatjon Umber"},{"actor":"Wilko Johnson","character":"Ser Ilyn Payne"},{"actor":"Mark Stanley","character":"Grenn"},{"actor":"Josef Altin","character":"Pypar"},{"actor":"Mia Soteriou","character":"Mirri Maz Duur"},{"actor":"Amrita Acharia","character":"Irri"},{"actor":"Elyes Gabel","character":"Rakharo"},{"actor":"Ian Gelder","character":"Ser Kevan Lannister"},{"actor":"Kristian Nairn","character":"Hodor"},{"actor":"Eugene Simon","character":"Lancel Lannister"},{"actor":"Joe Dempsie","character":"Gendry"},{"actor":"Ben Hawkey","character":"Hot Pie"},{"actor":"Eros Vlahos","character":"Lommy Greenhands"},{"actor":"Art Parkinson","character":"Rickon Stark"},{"actor":"Ian Beattie","character":"Ser Meryn Trant"},{"actor":"Steven Blount","character":"Lord Rickard Karstark"},{"actor":"Gerry O'Brien","character":"Lord Jonos Bracken"},{"actor":"Vinnie McCabe","character":"Lord Leo Lefford"},{"actor":"B.J. Hogg","character":"Ser Addam Marbrand"},{"actor":"Faolan Morgan","character":"a Stark guard"},{"actor":"Mark Coney","character":"Galbart Glover"},{"actor":"Elizabeth Barrett","character":"Maege Mormont"},{"actor":"James Tolcher","character":"Lannister Guard"},{"actor":"Unknown","character":"Jaqen H'ghar"},{"actor":"Unknown","character":"Rorge"},{"actor":"Unknown","character":"Biter"},{"actor":"Unknown","character":"Harys Swyft"},{"actor":"Unknown","character":"Gyles Rosby"}]}
