{"title":"Kingsroad","season":"1","episode":"2","date":"Sun Apr 24 2011","authors":["David Benioff","D.B. Weiss"],"directors":["Tim Van Patten"],"info":"\"The Kingsroad\" is the second episode of the first season of Game of Thrones. It is the second episode of the series overall. It first aired on April 24, 2011. It was written by executive producers David Benioff & D.B. Weiss and directed by Tim Van Patten.","plot":"Jon Snow prepares to depart for the Wall.","summary":[{"location":"Across the Narrow Sea","content":"The Dothraki khalasar led by Khal Drogo have departed Pentos and are heading east. They travel away from the Free Cities and into the Dothraki sea, the long-grassed plains that the Dothraki call home. Viserys Targaryen accompanies the khalasar, meaning to stay with Drogo until he fulfills his end of the bargain and provides him with an army with which to invade Westeros, despite Ser Jorah Mormont's suggestion. He tells Viserys that he offended his liege lord, Eddard Stark, by selling poachers into slavery. When he received word that Eddard meant to execute him for the crime (slavery has been illegal in Westeros for centuries), he fled to Essos. Viserys laughs at the notion, saying such trivialities would not be punished under his reign. Daenerys is finding adapting to her new role as khaleesi to be a huge challenge. Only Mormont offers her some solace; saying it will become easier. Daenerys is however fearful of her new husband and it is revealed that their first sexual encounter has left her slightly injured.\nFascinated with her gift from Illyrio, Dany asks her handmaidens if they have ever heard of dragons surviving in the east. They reply no, but Doreah, a former pleasure-girl from Lys, tells her an old story about how there used to be two moons in the sky. One wandered too close to the sun and cracked like an egg, spilling out thousands of dragons into the world. Dany's Dothraki handmaidens Irri and Jhiqui dismiss the story, saying that the moon is a goddess, wife to the sun.\nDaenerys seeks the advice of her handmaid Doreah. Doreah instructs Daenerys on how to please Drogo in bed but also how to use her skills to gain respect from him. Reminding her, \"you are no slave\" and should not have sex like one. Daenerys nervously puts these plans into action and is surprised to find Drogo responsive, particularly once she starts using her body in combination with the Dothraki language to speak to him.\n\nI"},{"location":"In the Seven Kingdoms","content":"Robb Stark says farewell to Jon.  \nIn Winterfell, Bran Stark lies unconscious and badly wounded, his mother by his side. Tyrion Lannister insists that his nephew Joffrey pay his respects to Lord and Lady Stark, since his absence has been noted. When Joffrey refuses, saying the boy means nothing to him, Tyrion slaps him three times until he accepts his uncle's suggestion. Tyrion then breakfasts with his other family members, informing them of his decision to journey north to see the Wall before returning to King's Landing. He also tells them that Bran is expected to live and notes Cersei and Jaime's guarded reactions.\nCersei visits Catelyn Stark, sitting by her son's side, and tells her that her first child, a beautiful, black-haired boy, died of a fever. She and Robert were grief-stricken and her prayers and tears were for naught. She offers to pray for Bran's survival, hoping that this time the gods will listen.\nJon Snow has Winterfell's blacksmith, Mikken, forge a light sword for his sister, Arya. Arya is excited by the gift and names it Needle. Jon also gives her advice on how to best use the weapon: \"Stick them with the pointy end.\" Jon urges Arya to practice every chance she gets. Jon then says goodbye to the comatose Bran, before departing at his stepmother's cold request. Eddard then says his goodbyes to his son and to Catelyn, who is angered at his departure while Bran remains ill.       \n\n    The two parties depart Winterfell.  \nThe parties depart Winterfell: Jon, Tyrion and Benjen Stark to the Wall; and Eddard, Arya, Sansa and the royal party south to King's Landing. At their parting Eddard tells Jon that, though he does not have Eddard's name, he has his blood. He also promises Jon to tell him about his mother the next time they meet.       \n\n    Eddard Stark says goodbye to his bastard son.  \nDays later, on the Kingsroad south to the capital, King Robert Baratheon calls a halt to discuss with Eddard some dire news that has just arrived. Robert's spies have learned of Daenerys Targaryen's marriage to Khal Drogo, whose khalasar is reported to number over one hundred thousand warriors. Eddard points out that the Dothraki cannot cross the Narrow Sea, as they have no ships, but Robert is concerned that the Seven Kingdoms will soon face another war. A curious Robert asks Eddard about Wylla, the mother of his bastard son, but Eddard refuses to enlighten him. Robert reminds him that they were in the middle of a war and no one knew if they would ever return to their families.\nIn Winterfell, Catelyn's refusal to leave Bran's side is starting to cause problems for the smooth running of the castle. Robb offers to work with Maester Luwin to put the castle to rights. There is then a fire in part of the castle, but this proves to be a distraction to allow an assassin to attempt to finish off Bran. Catelyn holds the assassin off long enough for Bran's direwolf to enter the chamber and tear out the assassin's throat.\n\n    Jon and Tyrion discussing matters.  \nTraveling north, Jon and Tyrion talk, and Tyrion reveals that he reads books to sharpen his mind, his greatest asset and weapon. As it travels north, the party is joined by several, new recruits — rapists who chose to \"take the black,\" rather than face the knife. Tyrion tells Jon that the Night's Watch is not a noble institution of glorious knights defending the realm against the horrors lurking beyond the Wall, but a dumping ground for the unwanted and for criminals.\nIn Winterfell, Catelyn goes to the tower from where Bran fell and finds a strand of blonde hair on the floor. She summons Robb, Theon, Luwin and the castle master at arms, Ser Rodrik Cassel and tells them that she suspects that the Lannisters tried to kill Bran because he might have seen something in the tower. Robb and Theon are all for making war, but Luwin schools them to caution. Catelyn decides that Ned must know the truth and resolves to travel south to King's Landing and meet him there. Ser Rodrik will go as escort, while Robb will take charge of the castle in her absence.       \n\n    The Wall, as seen by Jon's party.  \nJon's party crests a rise and sees the Wall before them. Benjen welcomes them, and Tyrion seems impressed by the Wall's sheer size.\nOn the Kingsroad, the royal party reaches the Crossroads Inn, a noted waystop on the way south to the capital. Prince Joffrey's bodyguard, Sandor Clegane, known as \"the Hound,\" a man with half his face burned in a mysterious accident, introduces Sansa to Ser Ilyn Payne, the king's headsman, a frightening-looking man who had his tongue torn out on the orders of the Mad King many years ago. Joffrey saves Sansa from this unpleasantness and takes her for a walk along the riverbank. They find Arya practicing her sword work with the son of the party's butcher, Mycah. Joffrey pretends to take offense at Mycah using a sword on the sister of his betrothed and starts to gleefully cut Mycah's face with his sword, but an outraged Arya hits him on the head with a stick. Joffrey quickly becomes violent and threatens Arya at sword point, but before he can hurt her, Arya's direwolf, Nymeria, attacks Joffrey, biting at his arm. Mycah runs off, and Arya throws Joffrey's sword in the river before running off herself. Sansa tries to help Joffrey, but he spitefully tells her to leave him alone and go for help.\nArya, knowing that Nymeria will be punished for injuring the prince, forces the direwolf to flee by throwing a rock at her. She is then taken before the King, who is angered that a minor fracas has become a major incident, with his wife and new Hand blaming one another's children. He decides to let Ned discipline Arya while he will do the same to Joffrey, but Cersei demands that the direwolf be executed. When Nymeria cannot be found, Cersei spitefully requests that Sansa's direwolf Lady be killed instead, and Robert acquiesces, upsetting Sansa and angering Arya.\nFurious, Eddard attends to the matter himself, passing the Hound arriving with Mycah's bloodied corpse. Eddard is shocked and disgusted, and when he asks if the Hound ran Mycah down, the Hound responds \"He ran, but not very fast.\" Eddard kills Lady with a dagger, and hundreds of miles away, Bran awakens."}],"firsts":["Doreah","Irri","Jhiqui","Rast","Catspaw assassin","Ser Ilyn Payne","Mycah","Lannister guardsman"],"deaths":["Catspaw assassin, throat ripped open by Summer","Mycah, ran over and butchered by Sandor Clegane","Lady, stabbed by Eddard Stark"],"cast":[{"actor":"Sean Bean","character":"Lord Eddard Stark"},{"actor":"Mark Addy","character":"King Robert Baratheon"},{"actor":"Nikolaj Coster-Waldau","character":"Ser Jaime Lannister"},{"actor":"Michelle Fairley","character":"Lady Catelyn Stark"},{"actor":"Lena Headey","character":"Queen Cersei Lannister"},{"actor":"Emilia Clarke","character":"Princess Daenerys Targaryen"},{"actor":"Iain Glen","character":"Ser Jorah Mormont"},{"actor":"Harry Lloyd","character":"Prince Viserys Targaryen"},{"actor":"Kit Harington","character":"Jon Snow"},{"actor":"Sophie Turner","character":"Sansa Stark"},{"actor":"Maisie Williams","character":"Arya Stark"},{"actor":"Richard Madden","character":"Robb Stark"},{"actor":"Alfie Allen","character":"Theon Greyjoy"},{"actor":"Isaac Hempstead Wright","character":"Bran Stark"},{"actor":"Jack Gleeson","character":"Prince Joffrey Baratheon"},{"actor":"Rory McCann","character":"Sandor Clegane"},{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Jason Momoa","character":"Khal Drogo"},{"actor":"Donald Sumpter","character":"Maester Luwin"},{"actor":"Jamie Sives","character":"Jory Cassel"},{"actor":"Ron Donachie","character":"Ser Rodrik Cassel"},{"actor":"Joseph Mawle","character":"Benjen Stark"},{"actor":"Roxanne McKee","character":"Doreah"},{"actor":"Dar Salim","character":"Qotho"},{"actor":"Amrita Acharia","character":"Irri"},{"actor":"Sarita Piotrowski","character":"Jhiqui"},{"actor":"Wilko Johnson","character":"Ser Ilyn Payne"},{"actor":"Rhodri Hosking","character":"Mycah"},{"actor":"Luke McEwan","character":"Rast"},{"actor":"Lalor Roddy","character":"the Catspaw assassin"},{"actor":"Conor Delaney","character":"a Lannister guardsman"},{"actor":"Callum Wharry","character":"Prince Tommen Baratheon"},{"actor":"Aimee Richardson","character":"Princess Myrcella Baratheon"},{"actor":"Boyd Rankin","character":"Mikken"},{"actor":"Phil Barnhill","character":"Baratheon Guard"},{"actor":"Robert Render","character":"Northern Bannerman"},{"actor":"Unknown","character":"Preston Greenfield"}]}
