{"title":"Lord Snow","season":"1","episode":"3","date":"Sun May 01 2011","authors":["David Benioff","D.B. Weiss"],"directors":["Brian Kirk"],"info":"\"Lord Snow\" is the third episode of the first season of Game of Thrones. It is the third episode of the series overall. It first aired on May 1, 2011. It was written by executive producers David Benioff & D.B. Weiss and directed by Brian Kirk.","plot":"Jon Snow attempts to find his footing at Castle Black amidst hostility and suspicion from his fellow members of the Night's Watch. Eddard Stark and his daughters arrive at King's Landing. Catelyn renews an old friendship with a member of the court, while Daenerys and Viserys journey onwards to the Dothraki capital of Vaes Dothrak.","summary":[{"location":"In King's Landing","content":"The Stark party arrives in King's Landing.  \nThe royal party reaches King's Landing. Almost immediately, Lord Eddard Stark is asked to attend a meeting of the king's small council and to change his clothes, but he refuses to the latter. Before that he encounters Jaime Lannister in the throne room. Jaime is still unhappy that Eddard judged him dishonorable for killing the Mad King, the murderer of Eddard's father and brother. Jaime is unrepentant about it. Eddard meets the council members: Lord Petyr \"Littlefinger\" Baelish, the king's Master of Coin and a friend of Eddard's wife from childhood; Grand Maester Pycelle, the king's adviser in all matters scientific and academic; Lord Renly Baratheon, the youngest of the king's two brothers and Master of Laws; and Varys, a eunuch and the Master of Whisperers (the head of the king's intelligence network).\nVarys tells Eddard that the council members heard about his \"troubles on the Kingsroad\" and that they pray for Joffrey's recovery. Eddard grimly responds \"It's a shame no one prayed for the butcher's boy\", which visibly upsets Varys.\nEddard is stunned to learn that the crown is six million Gold Dragons in debt, half of which is to Lord Tywin Lannister. To make matters worse, King Robert has just ordered a lavish tournament to celebrate Eddard's appointment. He resolves to advise Robert to cancel the tournament, but the council is doubtful that the King will listen.\n\n    Cersei and her son Joffrey.  \nQueen Cersei talks to Joffrey about the incident on the river. She tells him that when he is king, the truth will be whatever he decides it will be. Joffrey thinks there will be trouble with the Starks, and promises that when he is king, he will double their taxes, force them to contribute to a standing army and, should they object, crush them and install someone loyal, such as his great-uncle Kevan, as Warden of the North. Cersei points out that the North is too vast and wild to be militarily conquered by outsiders, and a king needs to be more clever. She also advises him to be kind to his betrothed Sansa Stark to avoid stirring up trouble for later, and concludes that \"Anyone who isn't us is an enemy.\"\nArya and Sansa are still at odds over the incident with Joffrey and her direwolf. Eddard explains that Sansa was put in a difficult position by the king and queen, and while she shouldn't have lied, winning the long-term approval of Joffrey, her future husband, was important. Arya is unhappy with the situation, but Eddard mollifies her by allowing her to practice with her sword, Needle.\n\n    Catelyn and Rodrik arrive in King's Landing.  Catelyn Stark and Ser Rodrik arrive at King's Landing and attempt to sneak into the city, but are spotted by one of Littlefinger's men. They are taken to meet Littlefinger at a brothel he owns, where Lord Varys is also waiting: one of his 'little birds' told him they were coming. Catelyn is angered by the way they've been treated, but asks Littlefinger for aid in finding the people who tried to have Bran killed. Littlefinger is able to answer this quickly: the elaborate dagger wielded by the assassin used to be his, but he lost it in a gamble with Tyrion Lannister.\n    Eddard threatens Lord Baelish.  \nLittlefinger fetches Eddard to meet his wife, but Eddard suspects a trick and pushes Littlefinger up against a wall outside the brothel wanting to know what his game is. Catelyn then appears, and Eddard is pacified. After hearing her news, he vows to find the truth and expose the Lannisters to Robert. Littlefinger agrees to be his ally in this, for the affection he once bore Catelyn as a youngster.\nRavens arrive at King's Landing with news of Bran's recovery. Cersei fears he will expose their secret, but Jaime comforts her.\n\n    Jaime comforts Cersei.  \nElsewhere, Robert swaps old war stories with Ser Barristan Selmy, a distinguished and famous knight and the commander of the Kingsguard. Summoning Jaime Lannister, Robert jokingly questions him about Aerys Targaryen's death, wondering if the Mad King died begging for mercy, but Jaime rather coldly replies that the master he betrayed died screaming the same words he'd been saying since the siege of King's Landing began: \"Burn them all\".\nEddard has contracted a swordmaster, Syrio Forel, the former First Sword of Braavos, to teach Arya how to use her sword properly. Arya is thrilled, and 'the dance' begins. As Eddard watches them practice, his pleasure at seeing Arya happy sours when he realizes that a conflict between the Starks and Lannisters may be inevitable; his daughter may well be training herself for war."},{"location":"In the North","content":"Old Nan tells Bran of winter and the Long Night.  \nAt Winterfell, Bran has awoken but has no memory of his accident. His injuries have left him bedridden and unlikely to walk again. Old Nan, the oldest servant in the castle, tells Bran stories to pass the time, but he doesn't want her usual heroic stories about the likes of Ser Duncan the Tall. She instead speaks of the White Walkers and the coming of a vast winter that will blanket the world. When Robb pays a visit, Bran asks his brother if it is true that his legs are crushed and that he will never walk again. Robb reluctantly says this is so. Bran remarks that he would rather be dead."},{"location":"At the Wall","content":"At Castle Black, the primary redoubt of the Night's Watch in the shadow of the Wall, Jon Snow shows his worth to the trainer, Ser Alliser Thorne, by besting several fellow members of the Watch in the practice yard. Thorne is disgusted at the poor performance of the others but has no praise for Jon either, dubbing him Lord Snow and describing him as \"the least useless person here\". Watching over the new recruits with Lord Commander Jeor Mormont, Tyrion notes Thorne's stern and unusual ways, but Jeor doesn't care as he only requires Thorne to turn the \"thieves and runaways\" into men of the Night's Watch. Later on, several of the other recruits gang up on Jon, but the situation is defused by Tyrion. Tyrion points out to Jon that none of the other recruits had the benefit of a skilled master-at-arms to train them, and that Jon is alienating them through his standoffish attitude and superior combat skills.\n\n    Benjen talks with Jon on the Wall.  \nBenjen Stark meets Jon atop the Wall and tells him he is going on a ranging in the Haunted Forest. He refuses to take Jon with him, telling him he isn't ready, and that here rank and nobility mean nothing: every man must earn everything he gets. Before departing, Benjen stops by the eating area to farewell Yoren, a fellow Night's Watchman who scouts for new recruits in the capital. Benjen also scolds Tyrion for his naivety regarding what is north of the Wall and states that Tyrion has no authority to say what is or isn't beyond the Wall as he hasn't been out there himself.\nLater, Tyrion discusses north of the Wall with Jeor Mormont and his chief adviser, the ancient and blind Maester Aemon. Jeor asks for Tyrion to intercede at court and get the Watch more men as they are dangerously undermanned. Aemon warns that the Stark words are right: a terrible winter is coming and more dangerous things than just wildlings might come with it; after all, one of their number swore that the White Walkers had returned ... right up to the moment Ned Stark cut his head off. Tyrion admits his skepticism that supernatural creatures might exist, but he agrees to bring word to his queen.\nBefore departing for King's Landing, Tyrion fulfils an old ambition by climbing to the top of the Wall and urinating off the edge of it. He and Jon share a moment of fellowship before Tyrion departs for the capital in the company of Yoren.\n\nA"},{"location":"Across the Narrow Sea","content":"Daenerys rides with the khalasar.  \nDaenerys commands the khalasar to halt on a whim, exercising her growing authority and power. Viserys does not take well to being commanded and threatens his sister. He is strangled by Rakharo, a Dothraki warrior wielding a whip. Daenerys calms the situation and Viserys is forced to walk, a sign of shame amongst the horse-riding Dothraki. Later, Irri reveals to Daenerys that Daenerys is pregnant. Daenerys relays the news to Khal Drogo and tells him she thinks it will be a boy as they lie naked in each other's arms. Ser Jorah Mormont and Rakharo compare the Westerosi and Dothraki ways of battle; the heavily-armored but slow knights versus the lightly-armored but fast-moving horse-warriors. Jorah has heard of Rakharo's father, a great warrior, but admits that he disgraced his own father, a man of great honor. When he learns that Daenerys is pregnant, he announces he must split off from the column to ride to the Free City of Qohor, but will rejoin them before they reach Vaes Dothrak."}],"firsts":["Royal Steward","Lord Petyr Baelish","Lord Varys","Lord Renly Baratheon","Grand Maester Pycelle","Old Nan","Goldcloak 1","Goldcloak 2","Drunk man","King's Landing whore","Lord Commander Jeor Mormont","Pypar","Ser Alliser Thorne","Grenn","Lancel Lannister","Lord Commander Barristan Selmy","Rakharo","Yoren","Maester Aemon","Syrio Forel"],"deaths":[],"cast":[{"actor":"Sean Bean","character":"Lord Eddard Stark"},{"actor":"Mark Addy","character":"King Robert Baratheon"},{"actor":"Nikolaj Coster-Waldau","character":"Ser Jaime Lannister"},{"actor":"Michelle Fairley","character":"Lady Catelyn Stark"},{"actor":"Lena Headey","character":"Queen Cersei Lannister"},{"actor":"Emilia Clarke","character":"Princess Daenerys Targaryen"},{"actor":"Iain Glen","character":"Ser Jorah Mormont"},{"actor":"Aidan Gillen","character":"Lord Petyr 'Littlefinger' Baelish"},{"actor":"Harry Lloyd","character":"Prince Viserys Targaryen"},{"actor":"Kit Harington","character":"Jon Snow"},{"actor":"Sophie Turner","character":"Sansa Stark"},{"actor":"Maisie Williams","character":"Arya Stark"},{"actor":"Isaac Hempstead-Wright","character":"Bran Stark"},{"actor":"Richard Madden","character":"Robb Stark"},{"actor":"Jack Gleeson","character":"Prince Joffrey Baratheon"},{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Jason Momoa","character":"Khal Drogo"},{"actor":"Conleth Hill","character":"Varys"},{"actor":"James Cosmo","character":"Lord Commander Jeor Mormont"},{"actor":"Owen Teale","character":"Ser Alliser Thorne"},{"actor":"Jamie Sives","character":"Jory Cassel"},{"actor":"Ian McElhinney","character":"Lord Commander Barristan Selmy"},{"actor":"Ron Donachie","character":"Ser Rodrik Cassel"},{"actor":"Joseph Mawle","character":"Benjen Stark"},{"actor":"Francis Magee","character":"Yoren"},{"actor":"Julian Glover","character":"Grand Maester Pycelle"},{"actor":"Gethin Anthony","character":"Lord Renly Baratheon"},{"actor":"Peter Vaughan","character":"Maester Aemon"},{"actor":"Miltos Yerolemou","character":"Syrio Forel"},{"actor":"Margaret John","character":"Old Nan"},{"actor":"Susan Brown","character":"Septa Mordane"},{"actor":"Robert Sterne","character":"Royal Steward"},{"actor":"Mark Stanley","character":"Grenn"},{"actor":"Josef Altin","character":"Pypar"},{"actor":"Luke McEwan","character":"Rast"},{"actor":"Elyes Gabel","character":"Rakharo"},{"actor":"Amrita Acharia","character":"Irri"},{"actor":"Eugene Simon","character":"Lancel Lannister"},{"actor":"Paul Portelli","character":"a Drunk Man"},{"actor":"Nickovich Sammut","character":"Goldcloak 1"},{"actor":"Seamus Kelly","character":"Goldcloak 2"},{"actor":"Emily Diamond","character":"a King's Landing whore"}]}
