{"title":"You Win or You Die","season":"1","episode":"7","date":"Sun May 29 2011","authors":["David Benioff","D.B. Weiss"],"directors":["Daniel Minahan"],"info":"\"You Win or You Die\" is the seventh episode of the first season of Game of Thrones. It is the seventh episode of the series overall. It first aired on 29 May 2011, but some HBO subscribers were able to see it a week early on the HBO Go digital platform. It was written by executive producers David Benioff & D.B. Weiss and directed by Daniel Minahan.","plot":"The Lannister army, poised to invade the Riverlands.","summary":[{"location":"At the Lannister Camp","content":"On the borders of the Riverlands, Lord Tywin Lannister has assembled an army of sixty thousand men, with which he plans to oppose the Starks and punish Catelyn's capture of his son Tyrion Lannister. \n\n    Tywin discusses the future of House Lannister with his son Jaime.  \nAs he stands in his tent skinning a dead stag, he tells his elder son, Jaime, that this conflict will decide the fate of their family; they will either forge a dynasty that will last a thousand years or cease to exist, as the Targaryens had done. He orders Jaime to become the man he was meant to be, and to take thirty thousand men and besiege Riverrun, Catelyn's childhood home and the seat of House Tully. Jaime ponders why Tywin would risk so much for the ugly, stunted son that he hates, but to Tywin a Lannister is a Lannister - even though he considers Tyrion the least worthy member of their family, any affront to their family must be punished or it makes them look weak."},{"location":"In the North","content":"Theon attempts to intimidate Osha.  \nIn Winterfell, Theon Greyjoy attempts to bully Osha, the wildling woman captured in the recent raid. He insists that she refer to him as \"My Lord\", but she is unimpressed with his antics. She points out that he is not entitled to this, as his father is still alive. Maester Luwin dismisses Theon and questions Osha about why her band crossed the Wall and were fleeing \"as far south as south goes\". She claims that the White Walkers have awoken after a millennia asleep and are coming south, to Luwin's skepticism."},{"location":"At the Wall","content":"Jon Snow and Samwell Tarly are standing watch atop the Wall when Benjen's horse is spotted returning, but, to Jon's horror, there is no sign of Benjen himself.        \nLater on, Lord Commander Jeor Mormont names the trainees as men of the Night's Watch. He hands out assignments, but to Jon's disgust he is being sent to the stewards, not the rangers. He will work directly for the Lord Commander as his personal steward. His attempts to plead his case to Maester Aemon (who has selected Samwell as his own steward) are met with indifference. However, Sam suggests to Jon that while this move was possibly orchestrated by Ser Alliser Thorne to punish Jon, it is also an opportunity for the Lord Commander to groom Jon directly for command. Both are then surprised when Pypar admits that he was sent to the Watch for refusing to give sexual favors to a lord, not for stealing a wheel of cheese to feed his sister as he had previously claimed. Nothing about being sent to the Wall is fair.        \n\n    Jon Snow and Samwell Tarly swear their oaths to the Night's Watch.  \nConvinced, Jon, along with Sam, say their oath of fealty to the Night's Watch in front of a heart tree just inside the eaves of the Haunted Forest and are acknowledged as men of the Watch. Sam decided to take the oath with Jon to the Old Gods of the Forest, as the Seven gods his father worshiped have never seemed to answer him. After they take their oaths, Ghost finds a severed hand in the woods and brings it back to Jon and a horrified Sam."},{"location":"Across the Narrow Sea","content":"Daenerys tries to convince Drogo to invade Westeros.  \n    The wine seller is captured after trying to poison Daenerys.  In Vaes Dothrak, Daenerys attempts to convince Khal Drogo about the benefits of an invasion of the Seven Kingdoms, but Drogo is reluctant to cross the Narrow Sea, despite the thousands of ships they could find in the Free Cities to do the job. He says that a man doesn't need an \"iron chair\" but only a horse. Daenerys travels to the marketplace with Ser Jorah Mormont and her handmaidens. She asks Jorah to help convince her husband since the Seven Kingdoms are hers by birthright but he reminds her that her ancestor Aegon the Conqueror took six of the Seven Kingdoms, because he was capable of doing so (due to his dragons), nothing more. Jorah is delivered a message from Varys, a royal pardon for his crimes; he quickly realizes that this news would only come if he was no longer needed as a spy. Seeing Daenerys with a wineseller who is keen for her to try a particular vintage from the Arbor, Jorah realizes that the wine has been poisoned; this is the assassination attempt. Having second thoughts, he steps in and stops Daenerys from drinking it. The wineseller attempts to flee, but Rakharo brings him down with a bolo tangling his ankles.\nWith the wine seller captured, Ser Jorah tells Daenerys that Robert Baratheon will never stop trying to kill her and her future children. Drogo quickly arrives in the tent. He glares at the seller and then goes to Daenerys to ensure she is okay, before offering Jorah the reward of any horse he chooses for foiling the assassination. Angered, he begins to yell out in Dothraki that his army will cross the \"poison water\" as no khalasar has done before and take the Iron Throne for his son. Drogo's khalasar departs Vaes Dothrak the next morning, with the wine seller tied naked to the saddle of Daenerys' horse, forced to walk until he eventually falls of exhaustion and is dragged to his death."},{"location":"In King's Landing","content":"Lord Eddard Stark meets with Cersei Lannister. He tells her that he knows the secret that Jon Arryn died for: that Cersei's three children are not Robert's, but the product of incest between her and Jaime. Cersei does not deny the charge and in fact is proud of it, comparing their love to the old Targaryen practice of marrying brother to sister; she also admits to having despised Robert ever since their wedding night, when Robert drunkenly stumbled into Cersei's bed and called her \"Lyanna\". Eddard angrily tells her to take her children and leave the city immediately. When Robert returns from his hunt, he will tell him the truth of the matter and Cersei should run as far as she can before that happens, lest Robert's wrath find her. \nCersei icily calls Ned a fool for turning down the throne himself after the sack of King's Landing. Eddard tells her that he has regrets, but that isn't one of them. Cersei departs with a chilling warning: \"When you play the game of thrones, you win or you die. There is no middle ground.\"\nIn one of his brothels, Littlefinger instructs the newly-arrived Ros and another prostitute, Armeca, on how to please their customers and make them happy. When they ask him to join them, he refuses, saying that he only ever had eyes for one woman. He tells them about his past, how he loved and fought a duel for a woman. He lost and subsequently realized that he could never beat those in power by honorable means, as they would never let him compete on equal terms. When Ros asks him what he wants, he says, \"Oh, everything.\"        \n\n    Robert Baratheon signs a document confirming Eddard Stark as Protector of the Realm.  Renly finds Eddard and tells him that Robert has been badly mauled by a boar and is not expected to survive. Eddard finds Robert telling Joffrey that he wishes he could have been a better father to him. Eddard chooses not to tell Robert about his discoveries to spare his final hours from pain. Robert instructs Eddard to take a letter naming him as the Lord Protector of the Realm, to rule until Joffrey comes of age. Eddard does not write Joffrey's name, instead saying \"the rightful heir\". Robert also asks him to cancel the attempt on Daenerys Targaryen's life. Leaving the chamber, Eddard talks to Varys, who slyly points out that Lancel Lannister ensured the King kept \"refreshed\" with alcohol during the hunt, meaning his reactions were slowed and unreliable. Varys also says it is far too late to stop the attempt on Daenerys' life.        \n    The letter Ned sends to Stannis Baratheon, informing him of his findings.  \nAt King's Landing, Renly confronts Eddard and offers him a hundred swords to take the queen and her children into custody, but Eddard refuses to dishonor Robert's last hours by shedding blood in the Red Keep and taking frightened children hostage. Renly suggests that he could make a good king, but Eddard angrily points out that Stannis is Renly's older brother and the true heir. In his study he writes a letter laying out his findings to Lord Stannis and instructs a courier to take the message to Dragonstone, Stannis's island fortress. Littlefinger then arrives and talks to Eddard, who tells him the truth about Joffrey's parentage. Littlefinger suggests that they keep quiet, acknowledge Joffrey as king and make him their puppet. If he proves intractable, they can reveal the truth and crown the more malleable Renly instead. Eddard considers this treason. Littlefinger realizes that even though Lord Eddard has Robert's edict naming him Regent and Protector of the Realm, he doesn't have the men he needs to seize control from Cersei. He needs the loyalty of the City Watch. Littlefinger understands that the honorable Eddard Stark can't come right out and ask him to bribe them, but agrees to do what needs to be done.     \n    Eddard Stark confronts King Joffrey in the throne room.  \nIn King's Landing, Eddard is summoned to the throne room by \"King Joffrey\"; Robert has died. He arrives to find Littlefinger and Varys waiting for him, along with Commander Janos Slynt and a detachment of the City Watch. Varys tells him that Renly has fled the city, along with Ser Loras Tyrell and a number of retainers. They were last seen heading south. The party enters the throne room, where Joffrey sits on the Iron Throne. He demands oaths of fealty from his councilors and subjects. Instead, Eddard gives Ser Barristan Selmy the proclamation naming him as Lord Protector of the Realm. To Barristan's shock, Cersei takes the \"paper shield\" and tears it up. Instead, she suggests that Eddard bend the knee and swear allegiance. In return he will be allowed to return to Winterfell. Eddard responds that Joffrey has no claim to the Iron Throne and commands Slynt to take the Queen and her son into custody. Instead, the City Watch kill Eddard's bodyguards and Littlefinger holds a knife to his throat, saying, \"I did warn you not to trust me.\""}],"firsts":["Lord Tywin Lannister","Armeca","Tomard","Little Bird","Wineseller","Dareon","Allo","Balian","Echiel","Escan","Gordo","Joby","Halder","Luke","Matthar","Mink","Nelugo","Niko","Rancer","Toad","Vorkoy","Jaremy Rykker","Othell Yarwyck","Night's Watch Officer 2","Ser Mandon Moore","Clydas","Varly"],"deaths":["King Robert Baratheon, dies of wounds inflicted by a boar","Varly, speared by a goldcloak"],"cast":[{"actor":"Sean Bean","character":"Lord Eddard Stark"},{"actor":"Mark Addy","character":"King Robert Baratheon"},{"actor":"Nikolaj Coster-Waldau","character":"Ser Jaime Lannister"},{"actor":"Lena Headey","character":"Queen Cersei Lannister"},{"actor":"Emilia Clarke","character":"Princess Daenerys Targaryen"},{"actor":"Iain Glen","character":"Ser Jorah Mormont"},{"actor":"Aidan Gillen","character":"Petyr 'Littlefinger' Baelish"},{"actor":"Kit Harington","character":"Jon Snow"},{"actor":"Alfie Allen","character":"Theon Greyjoy"},{"actor":"Jack Gleeson","character":"Prince Joffrey Baratheon"},{"actor":"Rory McCann","character":"Sandor Clegane"},{"actor":"Jason Momoa","character":"Khal Drogo"},{"actor":"Donald Sumpter","character":"Maester Luwin"},{"actor":"Conleth Hill","character":"Varys"},{"actor":"James Cosmo","character":"Lord Commander Jeor Mormont"},{"actor":"Owen Teale","character":"Ser Alliser Thorne"},{"actor":"Charles Dance","character":"Lord Tywin Lannister"},{"actor":"Ian McElhinney","character":"Lord Commander Barristan Selmy"},{"actor":"John Bradley-West","character":"Samwell Tarly"},{"actor":"Peter Vaughan","character":"Maester Aemon"},{"actor":"Julian Glover","character":"Grand Maester Pycelle"},{"actor":"Gethin Anthony","character":"Lord Renly Baratheon"},{"actor":"Dominic Carter","character":"Commander Janos Slynt"},{"actor":"Natalia Tena","character":"Osha"},{"actor":"Esme Bianco","character":"Ros"},{"actor":"Mark Stanley","character":"Grenn"},{"actor":"Josef Altin","character":"Pypar"},{"actor":"Luke McEwan","character":"Rast"},{"actor":"Amrita Acharia","character":"Irri"},{"actor":"Roxanne McKee","character":"Doreah"},{"actor":"Elyes Gabel","character":"Rakharo"},{"actor":"Dar Salim","character":"Qotho"},{"actor":"Robert Sterne","character":"Royal Steward"},{"actor":"Simon Lowe","character":"Wineseller"},{"actor":"Sahara Knite","character":"Armeca"},{"actor":"Graham Charles","character":"Varly"},{"actor":"Brian Fortune","character":"Othell Yarwyck"},{"actor":"Jeffrey O'Brien","character":"Jaremy Rykker"},{"actor":"Dennis McKeever","character":"Night's Watch Officer 2"},{"actor":"Phil Dixon","character":"Tomard"},{"actor":"Tristan Mercieca","character":"Little Bird"},{"actor":"Unknown","character":"Preston Greenfield"},{"actor":"Unknown","character":"Arys Oakheart"},{"actor":"Unknown","character":"Boros Blount"},{"actor":"Unknown","character":"Mandon Moore"}]}
