{"title":"The Wolf and the Lion","season":"1","episode":"5","date":"Sun May 15 2011","authors":["David Benioff","D.B. Weiss"],"directors":["Brian Kirk"],"info":"\"The Wolf and the Lion\" is the fifth episode of the first season of Game of Thrones  and the fifth episode of the series overall. It first aired on May 15, 2011. It was written by executive producers David Benioff & D.B. Weiss and directed by Brian Kirk.","plot":"Tyrion's predicament becomes common knowledge in King's Landing, making life difficult for Eddard Stark. Ned's position is already precarious due to a disagreement with King Robert Baratheon over plans to assassinate Daenerys before she can rally the Dothraki to invade Westeros. In the Eyrie, Catelyn is shocked by her sister Lysa's paranoia and distrust.","summary":[{"location":"In the Vale","content":"Tyrion Lannister and his escorts in the hills of the Vale.  \nTyrion Lannister has his blindfold removed and finds that their party - augmented by several knights and the sellsword Bronn from the Crossroads Inn - is on the Eastern Road en route to the Vale of Arryn. Catelyn notes that she said they were riding for Winterfell often and loudly. Tyrion congratulates her on her cunning, while pointing out that his father will give out a handsome reward for his safe return (a point that clearly piques Bronn's interest). He also says that Lady Lysa Arryn has gone mad since her husband's death and will try to kill him in the Eyrie. Tyrion also protests his innocence in the attempt on Bran's life and points out he'd have to be an idiot to give the assassin his own blade. Before Catelyn can answer, the party comes under attack from one of the hill tribes. Despite taking several losses, the party is able to drive off the attackers. Despite having the opportunity to escape, Tyrion fights, killing his first man during the skirmish, and in doing so saves Catelyn's life. Afterwards, they resume their trek to the Eyrie.\n\n    Tyrion and Catelyn in the Eyrie's High Hall.  \nIn the High Hall of the Eyrie, Lady Lysa Arryn holds court on behalf of her young son, Robin. Lysa is furious that Cat has endangered them all by bringing Tyrion to the Vale. Tyrion points out that if he is harmed, there will be war with House Lannister, but Lysa is unconcerned about his threats, as the Vale is strongly-defended and the Eyrie is impregnable. She orders him sent to the sky cells, three-sided cells with the fourth open to a sheer drop down the mountainside, forcing Tyrion to huddle in a corner and try not to roll out to his death in his sleep."},{"location":"In the North","content":"In Winterfell, Bran is angry about his mother's absence. Maester Luwin tries to set his mind at rest about the matter, to no avail. However, when Bran gets frustrated at not being able to practice his archery, Luwin suggests that he could learn to use a shortbow, of the kind used in mounted combat by the Dothraki, a notion which pleases Bran. \n\n    Bran and Maester Luwin discuss geography.  \nElsewhere in the castle, Theon Greyjoy enjoys the attentions of his favorite whore, Ros, but becomes annoyed when she compares his prowess unfavorably to that of Tyrion Lannister."},{"location":"In King's Landing","content":"Lord Eddard Stark arrives at the tourney ground to speak to Lord Commander Barristan Selmy about the death of Ser Hugh of the Vale. Barristan notes that he had no family or friends so he stood the knight's vigil himself for Ser Hugh. Eddard is suspicious of Ser Hugh's death, wanting to know how he could afford a new set of armor so soon after being made a knight. Barristan reflects on the irony of them being on opposite sides of the war during Robert's Rebellion and now they are working together. \n\n    Ser Barristan Selmy and Lord Eddard Stark discuss the death of Ser Hugh.  \nHe also tells Eddard that King Robert is planning to joust during the day's activities. Eddard finds King Robert tormenting his squire, Lancel Lannister, finally sending him off on a snipe hunt in amused disgust. Robert is adamant about fighting in the joust but Eddard tells him that he is too fat for his armor and the other knights would let him win. Robert is forced to admit that he's right but they can at least watch the joust from the stands. \nThe first tilt of the day is between the fearsome Ser Gregor Clegane, the Mountain, and the popular 'Knight of the Flowers', Ser Loras Tyrell. Loras gives a beautiful flower to Sansa Stark, while Littlefinger and Lord Renly make a wager on who will win with Renly betting on Loras. Loras is riding a mare that is in-heat, which confuses the Mountain's horse, causing him to throw his rider. \n\n    King Robert Baratheon is dismayed to find he no longer fits his armor.  \nEnraged at having lost, Gregor first decapitates his horse and then attacks Ser Loras. Sandor Clegane comes to Loras' defense, preventing his brother from killing him. They exchange several blows, until King Robert orders them to cease. Sandor immediately bows to the king, while Gregor storms off the field. Ser Loras declares Sandor the victor of the match to the Hound's discomfort.\nIn the Red Keep, Lord Varys meets with Eddard. Varys tells him that the king is a fool and will soon be dead unless Eddard can save him. Eddard wants to know why Varys is telling him this now. Varys tells him he had to be sure Eddard could be trusted. \nHe calls Eddard an honorable and true man, maybe the only one in the city. He also confirms that Jon Arryn was assassinated with a poison called the Tears of Lys because he \"started asking questions\". Arya is chasing cats in accordance with her sword training. She chases one into the dungeons under the castle, where she finds the great dragon skulls of the Targaryens in storage. She hears two men - Varys and Magister Illyrio Mopatis of Pentos - talking. Varys says that events have been set in motion and the lion and the wolf will soon be at each other's throats. War is almost upon the Seven Kingdoms, as they planned, but it has come too soon. Khal Drogo will not invade Westeros until his son is born and pronounced healthy, which is still many months away. Illyrio suggests assassinating Eddard to forestall the war, but Varys refuses.\n\n    Sandor, Ser Gregor and Ser Loras at the tournament.  \nAfterwards, Varys finds Littlefinger in the Great Hall staring at the Iron Throne. Varys reveals that he knows about Littlefinger's assistance in Eddard's investigation of Jon Arryn's death and reminds Littlefinger of the consequences that may befall him should the Lannisters discover his involvement. In response, Littlefinger reveals that he already knows about Varys having met with both Eddard and Illyrio just earlier that day, implying he knows of Varys' allegiances across the Narrow Sea. Their conversation is interrupted by Renly, who informs them that Robert will be joining them at their small council meeting.\nArya escapes from the dungeon and tries to warn her father about what she overheard but she gets the words muddled up. They are interrupted by Yoren, who has ridden non-stop from the Crossroads Inn to bring Eddard forewarning of Catelyn's arrest of Tyrion Lannister. Eddard keeps the information to himself, while Arya asks Jory Cassel about the state of her father's household guard. Jory tells her she does not have to worry about her father's safety.\nAt the meeting of the small council, King Robert tells Eddard that Daenerys Targaryen is pregnant and her son will have a claim to the Iron Throne. He wants Daenerys, the unborn child, and Viserys dead as soon as possible. \n\n    Varys secretly meets Illyrio under the Red Keep.  \nEddard states that this act would be dishonorable, cowardly, and beneath their dignity. The other members of the council - Pycelle, Renly, Littlefinger and Varys - all concur that Daenerys must die for the good of the realm. King Robert orders Eddard to enact the order. He refuses and resigns as the Hand of the King, to Robert's utter disbelief and fury.\nEddard orders his household to begin packing. As Eddard is packing, Littlefinger arrives and offers to take Eddard to the last place Jon Arryn went before he \"fell ill\". Eddard agrees.          \nSer Loras and Lord Renly, who are lovers, meet in a bedchamber. Renly complains as Robert is organizing a hunt in the Kingswood, which will no doubt involve traipsing around the forest for a couple of weeks in the cold and rain waiting to kill some animal. Loras urges Renly to claim the crown himself, offering him the allegiance of his rich and powerful family. Renly dismisses the notion, since he is fourth in line to the Iron Throne. Loras points out that Joffrey is a monster, that Tommen is only eight and laughs at the notion of Robert and Renly's other brother, Lord Stannis, ever becoming king, as he has the charisma and personality of a lobster. He also asserts that the people love Renly and want to serve him because he is kind and doesn't revel in violence as his brothers do.\nQueen Cersei and Robert share a rare drink and discussion about the Targaryen threat. Surprisingly, Cersei takes Eddard's side, pointing out that the Dothraki cannot cross the Narrow Sea as they have no ships. \n\n    Ser Loras urges Renly to consider his place in the line of succession.  \nRobert agrees, but if they land and the knights of Westeros take shelter behind their castle walls, the Dothraki could simply burn and pillage their way up and down the continent until the smallfolk accept Viserys as their king regardless. Cersei suggests that the unified armies of the Seven Kingdoms could defeat them but Robert says she underestimates the skill and ability of one army with one leader and one purpose as compared to that of the scattered and patchwork armies of Westeros. Their discussion moves to Lyanna Stark, which surprises Robert, as in seventeen years Cersei has never asked about her. He tells her that Lyanna's death left in him a void that seven kingdoms could not fill. He also tells her that their marriage never had a chance of success because of the hold Lyanna's memory has on him, and bitterly adds he can barely remember what she looked like. Cersei says that she felt something for Robert once, even after they lost their first boy, for quite a while. She asks Robert if there was ever any chance for their marriage and he answers \"No\".\nLittlefinger brings Eddard Stark to the last place Jon Arryn went before falling ill, which is one of Littefinger's brothels. There Eddard meets another one of Robert's bastards, this time a girl, and her mother, a blond whore named Mhaegen. Mhaegen remarks that her child has Robert's nose and \"black\" hair. Eddard asks Littlefinger why Jon Arryn was searching for Robert's bastards but he says he doesn't know, offering the half-hearted guess that maybe Robert suddenly took paternal interest in them. Eddard looks skeptical of that reason.\nLeaving the brothel, Eddard, Jory Cassel, and the two guards that accompanied them are confronted by a large group of Lannister guardsmen led by Ser Jaime Lannister. Jaime has heard of Tyrion's arrest and demands an explanation. Eddard says that Tyrion was arrested on his orders. \n\n    Eddard is stabbed through the leg by a Lannister guardsman.  \nJaime threatens to kill Eddard but Eddard points out that if he does, Tyrion will die as well. Jaime acknowledges that this is true, so he says he will settle for killing Eddard's men instead. There is a brief engagement in which Eddard's two guards, Heward and Wyl, are killed by Lannister spearmen. In response, Ned and Jory fight and kill five of the Lannister soldiers. Jory engages Jaime but is quickly killed when Jaime stabs him through the eye with a dagger. Furious, Eddard crosses swords with Jaime. Jaime is shocked and then exhilarated when the older Ned is not as easily defeated as he expected. However, Jaime gradually starts to grow worried as Ned's high level of skill becomes apparent. Just as they are ready to clash again, a Lannister guardsman steps in and stabs Eddard through the leg with a spear, disabling him. Jaime is annoyed at the dishonorable interruption and knocks out the guardsman. He departs, telling Eddard he wants his brother back."}],"firsts":["Loras Tyrell","Ser Vardis Egen","Barra","Mhaegen","Lysa Arryn","Robin Arryn","Wyl","Heward","Mord"],"deaths":["Kurleket, killed by mountain clansmen","Ser Willis Wode, killed by mountain clansmen","Jory Cassel, stabbed through the eye by Jaime Lannister","Wyl, speared by a Lannister man-at-arms","Heward, speared by a Lannister man-at-arms"],"cast":[{"actor":"Sean Bean","character":"Lord Eddard Stark"},{"actor":"Mark Addy","character":"King Robert Baratheon"},{"actor":"Nikolaj Coster-Waldau","character":"Ser Jaime Lannister"},{"actor":"Michelle Fairley","character":"Lady Catelyn Stark"},{"actor":"Lena Headey","character":"Queen Cersei Lannister"},{"actor":"Aidan Gillen","character":"Lord Petyr Baelish"},{"actor":"Sophie Turner","character":"Sansa Stark"},{"actor":"Maisie Williams","character":"Arya Stark"},{"actor":"Alfie Allen","character":"Theon Greyjoy"},{"actor":"Isaac Hempstead-Wright","character":"Bran Stark"},{"actor":"Jack Gleeson","character":"Prince Joffrey Baratheon"},{"actor":"Rory McCann","character":"Sandor Clegane"},{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Donald Sumpter","character":"Maester Luwin"},{"actor":"Conleth Hill","character":"Lord Varys"},{"actor":"Jamie Sives","character":"Jory Cassel"},{"actor":"Ron Donachie","character":"Ser Rodrik Cassel"},{"actor":"Jerome Flynn","character":"Bronn"},{"actor":"Francis Magee","character":"Yoren"},{"actor":"Ian McElhinney","character":"Lord Commander Barristan Selmy"},{"actor":"Kate Dickie","character":"Lady Lysa Arryn"},{"actor":"Julian Glover","character":"Grand Maester Pycelle"},{"actor":"Gethin Anthony","character":"Lord Renly Baratheon"},{"actor":"Roger Allam","character":"Magister Illyrio Mopatis"},{"actor":"Emun Elliott","character":"Marillion"},{"actor":"Finn Jones","character":"Ser Loras Tyrell"},{"actor":"Conan Stevens","character":"Ser Gregor Clegane"},{"actor":"Ciaran Bermingham","character":"Mord"},{"actor":"Susan Brown","character":"Septa Mordane"},{"actor":"Esme Bianco","character":"Ros"},{"actor":"Jefferson Hall","character":"Ser Hugh of the Vale"},{"actor":"Lino Facioli","character":"Lord Robin Arryn"},{"actor":"Brendan McCormack","character":"Ser Vardis Egen"},{"actor":"Robert Sterne","character":"the Royal Steward"},{"actor":"Alan Paris","character":"a Goldcloak"},{"actor":"Kevin Keenan","character":"Kurleket"},{"actor":"Ryan McKenna","character":"Ser Willis Wode"},{"actor":"Eugene Simon","character":"Lancel Lannister"},{"actor":"Antonia Christophers","character":"Mhaegen"},{"actor":"Emily Diamond","character":"a King's Landing Whore"},{"actor":"Callum Wharry","character":"Prince Tommen Baratheon"},{"actor":"Aimee Richardson","character":"Princess Myrcella Baratheon"},{"actor":"Melissa Reid","character":"Peasant"},{"actor":"Unknown","character":"a Goldcloak"},{"actor":"Unknown","character":"Barra"},{"actor":"Unknown","character":"Preston Greenfield"},{"actor":"Unknown","character":"Joss Stilwood"},{"actor":"Unknown","character":"Wyl"},{"actor":"Unknown","character":"Heward"}]}
