{"title":"Winter is Coming","season":"1","episode":"1","date":"Sun Apr 17 2011","authors":["David Benioff","D.B. Weiss"],"directors":["Tim Van Patten"],"info":"\"Winter is Coming\" is the first episode of the first season of Game of Thrones, preceded only by an unaired pilot episode. It first aired on 17 April 2011. A 15-minute preview of the first episode was shown on 3 April 2011. The episode was written by executive producers David Benioff & D.B. Weiss and directed by Tim Van Patten.","plot":"King Robert Baratheon majestically arrives in Winterfell, the home of his old and trusted friend, Eddard Stark, Warden of the North, with an important offer.","summary":[{"location":"Beyond the Wall","content":"Three rangers of the Night's Watch: Ser Waymar Royce, Will, and Gared depart from the Wall to investigate reports of wildlings in the Haunted Forest which lies to the north, Beyond the Wall. Will, the best scout in the group, discovers a number of wildling corpses dismembered and arranged in a strange, ritualistic fashion on the ground.\n\n    Wight of wildling girl.  He also finds a dead wildling girl pinned to a tree. He reports back to the others. Ser Waymar overrides the older Gared's advice that they return to Castle Black to report the situation to their superiors and instead insists on seeing the corpses for himself, to determine what killed them. When they reach the site, the bodies have disappeared. Will scouts around for clues, but Gared finds a bloody piece of clothing buried under the snow. Further investigations are curtailed when a tall, humanoid figure with glowing blue eyes, a White Walker, arrives and kills Ser Waymar with ease. Gared attempts to escape but is caught and killed. Will, in extreme horror, sees the dead wildling girl from earlier now walking with blue eyes, and also witnesses Gared's death, with the White Walker tossing his severed head at Will's feet.\nI"},{"location":"In the Seven Kingdoms","content":"Ned Stark draws his sword.  \nSome time later, Will has fled south of the Wall in terror, rather than return to warn Castle Black of the White Walker threat. He is apprehended by outriders loyal to House Stark, the wardens of the North, and is taken to Lord Eddard Stark. Lord Eddard, in the courtyard watching his son, Bran Stark at archery training, decrees that as a deserter from the Watch, Will is an oathbreaker and must die. Will accepts his fate, but tells Eddard about the Walkers first and asks that word be sent back to his mother. Eddard carries out the execution himself, using the ancestral Valyrian blade of their house, Ice. Two of Eddard's trueborn sons, 17-year-old Robb and 10-year-old Bran, accompany him to the execution along with his bastard son Jon Snow, his ward, Theon Greyjoy, the master-at-arms Rodrik Cassel and his leading guard Jory Cassel. Young Bran witnesses an execution for the first time without flinching, earning praise from Jon. Eddard explains to Bran that the reason he was made to execute Will was because the man who passes the sentence should swing the sword. When Bran asks his father about Will's talk of White Walkers, Eddard dismisses it as a madman's ramblings, insisting that the Walkers have been gone for centuries. The party sets out to return to Winterfell.\n\n    The Starks come across the Direwolves.  \nOn the way back to the castle, the party finds a stag dead in the road, partially disemboweled. Looking for what killed it, they find a dead female direwolf, killed with a stag antler piece broken off in her throat. The female died after giving birth, and her five pups huddle by the corpse for warmth. Theon advocates killing the pups, but Jon Snow convinces his father that this is an omen: the direwolf is the symbol of House Stark, and Eddard has five trueborn children. With Bran looking on beseechingly, Eddard agrees that his children should have the pups, but only if they raise them themselves with no help from the servants. Just as the party leaves, Jon finds a sixth pup, an albino runt of the litter. Theon mockingly points out that this one belongs to Jon.\nIn King's Landing, the capital city of the Seven Kingdoms, the bells ring out to commemorate the death of Lord Jon Arryn, the Hand of the King. As the Silent Sisters prepare his body for burial, Queen Cersei Lannister looks on. She is worried that Jon discovered something he shouldn't have, and may have told someone. She confesses her fears to her twin brother, Ser Jaime Lannister of the Kingsguard, but he tells her not to worry, since if the King knew the truth they'd be dead already. She tells him he should be the new Hand of the King, but he doesn't want the job. He considers it too much work. Cersei accuses him of taking nothing seriously.\nA raven bears news of Jon Arryn's death to Winterfell, where Lady Catelyn Stark informs Eddard. He is particularly stricken because Arryn served as a father-figure to him, when he was fostered at the Eyrie. She also tells him that King Robert Baratheon and much of the royal court rides for Winterfell. Eddard realizes that King Robert means to name him as the Hand to replace Jon Arryn. He ponders refusing, feeling his place is at Winterfell.\nOver the next few weeks the Stark children grow used to their rapidly-growing direwolves: Robb names his Grey Wind, Sansa calls hers Lady, and Arya names hers Nymeria after a great warrior-queen. Jon names his Ghost, for his white color and uncanny silence. Bran calls his Summer and six-year-old Rickon names his wolf Shaggydog. Bran's mother catches him climbing on the rooftops of the castle, just as the royal party comes into view. He promises to stop, but his mother knows he is lying. Winterfell prepares for guests. Catelyn Stark wants to make sure that Tyrion Lannister, a great reader, has enough candles, and the young men of the house get groomed, as they gossip about the queen, a reportedly great beauty.\n\n    Winterfell gathers to greet the royal party.  \nAll of Winterfell gathers in the courtyard as the royal party approaches. Arya is late and annoys Sansa by not being silent and respectful when they arrive. King Robert rides in with his knights, while Queen Cersei is in a large wheelhouse. Lord Eddard presents his household to King Robert. Eddard and Robert greet each other warmly, and then Robert demands to see the crypts and pay his respects to Eddard's deceased sister, Lyanna, much to Queen Cersei's impatience. After Robert and Eddard depart, Cersei sends Jaime to find their younger brother Tyrion, who is a dwarf. \"The Imp\" has found his way to the brothel in the town outside Winterfell, where he enjoys the attentions of a prostitute named Ros. Jaime tells Tyrion, a man of limited height but with immense appetites, that he will be needed at the feast that night. Jaime has hired three more prostitutes for Tyrion, to hurry things along.\n\n    Lyanna's statue in the crypts of Winterfell.  \nIn the crypts Robert offers up his prayers at the tomb of Lyanna Stark, Eddard's younger sister, whom Robert was betrothed to before she was kidnapped by Prince Rhaegar Targaryen and died shortly after being rescued. He tells Eddard that in his dreams he kills Rhaegar every night anew. Eddard reminds him that House Targaryen was destroyed, but Robert replies: \"not all of them.\"\nRobert formally offers Eddard the role of Hand, and Eddard asks for time to consider. Robert agrees, but offers a sweetener: the hand of his son, Joffrey, in marriage to Eddard's daughter, Sansa. A great feast is held and Cersei and Catelyn exchange cordial words. Cersei seems more impressed by Sansa, thinking that she will be a great hit at court. Outside the feast, Jon Snow works at his sword practice, angry that Catelyn thought it would be inappropriate that a bastard should attend. His uncle Benjen Stark, First Ranger of the Night's Watch, arrives to join the feast, and Jon asks him to take him back to the Wall with him. Benjen agrees to consider it. Tyrion Lannister then arrives and talks to Jon, suggesting that he is too pricklish and quick to take offense when his illegitimacy is pointed out. He should take the insult and wear it like armor, so that no one can hurt him with it. When Jon angrily asks Tyrion what he knows about it, Tyrion replies that \"all dwarfs are bastards in their father's eyes.\"\nEddard and Catelyn receive a letter in the night, delivered to Maester Luwin by a messenger from the Eyrie. The letter is from Catelyn's sister, Lady Lysa Arryn, the widow of Jon Arryn. In the letter, Lysa says that Jon Arryn was murdered by the Lannisters and that they plan to conspire against King Robert. Luwin counsels that Eddard should accept Robert's offer to be Hand, so he can investigate the truth of the matter and protect the King. Eddard, while he would prefer to stay at Winterfell, agrees with Luwin and accepts the offer.\nThe next morning Eddard and Robert go hunting, leaving the castle largely empty. Bran indulges in some climbing but, while climbing a broken tower, he hears someone moaning. He peers through a window and finds the queen and her brother engaged in a sexual act. Cersei spots him and warns Jaime, who grabs Bran. Jaime looks out the window to make sure nobody else is watching and only sees Summer. He turns to Bran and asks how old he is. When Bran replies \"ten,\" Jaime remarks with a sigh, \"The things I do for love.\" With that, he pushes Bran out of the window.\n\nA"},{"location":"Across the Narrow Sea","content":"In the Free City of Pentos, across the Narrow Sea, Viserys and Daenerys Targaryen enjoy the hospitality of Magister Illyrio Mopatis. Viserys has arranged to wed his sister Daenerys (also called \"Dany\") to Khal Drogo, the warlord of a Dothraki khalasar of forty thousand warriors. In return, Drogo will give Viserys the army he needs to reclaim the Iron Throne. Viserys prepares Daenerys for meeting the Khal. He tells her what a beautiful young woman she has turned into, and slips off her dress and fondles her breast. She is silent and looks away as if pretending it isn't happening. She steps into a hot bath that has just been poured. This greatly distresses her maid who believes the water will scald her. However, Daenerys seems not to notice it and appears to be unharmed.\n\n    Drogo arrives in Pentos and approves of Daenerys.  \nIllyrio and Viserys discuss the quest to sail back to Westoros, and Viserys inquirers when the wedding will take place. Daenerys is not pleased with the arrangement and blurts out that she does not want to marry Drogo. Viserys insists that she will, because in return Drogo will give him the army he needs to retake their father's throne from Robert Baratheon. Viserys adds that he would let her be raped by all forty thousand of Drogo's men and their horses if it meant getting his throne back. A short time later, Drogo arrives at Illyrio's estate. After taking a glance at Daenerys, Drogo rides away without having to dismount from his horse. Viserys is concerned, but Illyrio assures him that, if he did not approve of Daenerys, they would have known.\n\n    Daenerys in her wedding dress  \nLater, Daenerys marries Khal Drogo and a great celebration is held. Several people die in impromptu duels, which Illyrio says is a good sign: a Dothraki wedding without at least three deaths is considered a dull affair. The bride and groom receive many gifts, but for Dany, two are particularly interesting. The first is a box containing three beautiful stones. According to Illyrio, these are dragon eggs from the Shadow Lands beyond Asshai that have turned to stone with the passing of time. Dany appears to feel some connection with the eggs, but brushes it off for the time being. The second is a selection of books containing stories and songs from the Seven Kingdoms, given by Ser Jorah Mormont, an exiled knight of House Mormont. Ser Jorah swears fealty to Viserys as King and offers him his support and advice, which is accepted. For his gift, Drogo gives Daenerys a beautiful white stallion. Viserys asks his sister to make Drogo happy. Drogo and Daenerys ride down to the shore and consummate their marriage on the beach at sunset. Daenerys is visibly upset and terrified."}],"firsts":["Will","Ser Waymar Royce","Gared","Wildling girl","White Walker 1","White Walker 2","Bran Stark","Jon Snow","Robb Stark","Lady Catelyn Stark","Lord Eddard Stark","Rickon Stark","Sansa Stark","Septa Mordane","Arya Stark","Jeyne Poole","Ser Rodrik Cassel","Jory Cassel","Theon Greyjoy","Ser Jaime Lannister","Queen Cersei Lannister","Maester Luwin","Tommy","Prince Joffrey Baratheon","Sandor Clegane","Hodor","Mikken","King Robert Baratheon","Prince Tommen Baratheon","Princess Myrcella Baratheon","Tyrion Lannister","Ros","Princess Daenerys Targaryen","Prince Viserys Targaryen","Pentoshi servant","Magister Illyrio Mopatis","Khal Drogo","Qotho","Cohollo","Haggo","Benjen Stark","Ser Jorah Mormont","Mago"],"deaths":["Ser Waymar Royce, slain by White Walkers","Gared, beheaded by a White Walker","Lord Jon Arryn, causes unknown","Will, beheaded by Eddard Stark","Unidentified Dothraki, throat slit by another Dothraki"],"cast":[{"actor":"Sean Bean","character":"Lord Eddard Stark"},{"actor":"Mark Addy","character":"King Robert Baratheon"},{"actor":"Nikolaj Coster-Waldau","character":"Ser Jaime Lannister"},{"actor":"Michelle Fairley","character":"Lady Catelyn Stark"},{"actor":"Lena Headey","character":"Queen Cersei Lannister"},{"actor":"Emilia Clarke","character":"Princess Daenerys Targaryen"},{"actor":"Iain Glen","character":"Ser Jorah Mormont"},{"actor":"Harry Lloyd","character":"Prince Viserys Targaryen"},{"actor":"Kit Harington","character":"Jon Snow"},{"actor":"Sophie Turner","character":"Sansa Stark"},{"actor":"Maisie Williams","character":"Arya Stark"},{"actor":"Richard Madden","character":"Robb Stark"},{"actor":"Alfie Allen","character":"Theon Greyjoy"},{"actor":"Isaac Hempstead-Wright","character":"Bran Stark"},{"actor":"Jack Gleeson","character":"Prince Joffrey Baratheon"},{"actor":"Rory McCann","character":"Sandor Clegane"},{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Jason Momoa","character":"Khal Drogo"},{"actor":"Donald Sumpter","character":"Maester Luwin"},{"actor":"Jamie Sives","character":"Jory Cassel"},{"actor":"Ron Donachie","character":"Ser Rodrik Cassel"},{"actor":"Joseph Mawle","character":"Benjen Stark"},{"actor":"Roger Allam","character":"Magister Illyrio Mopatis"},{"actor":"Dar Salim","character":"Qotho"},{"actor":"Esme Bianco","character":"Ros"},{"actor":"Susan Brown","character":"Septa Mordane"},{"actor":"Bronson Webb","character":"Will"},{"actor":"Sir John Sting","character":"Lord Jon Arryn"},{"actor":"Rob Ostlere","character":"Ser Waymar Royce"},{"actor":"Dermot Keaney","character":"Gared"},{"actor":"Art Parkinson","character":"Rickon Stark"},{"actor":"Callum Wharry","character":"Prince Tommen Baratheon"},{"actor":"Aimee Richardson","character":"Princess Myrcella Baratheon"},{"actor":"Kristian Nairn","character":"Hodor"},{"actor":"Rania Zouari","character":"a Pentoshi servant"},{"actor":"Ian Whyte","character":"a White Walker"},{"actor":"Spencer Wilding","character":"a White Walker"},{"actor":"Claire Wright","character":"a Wildling girl"},{"actor":"Tommy Dunne","character":"Tommy"},{"actor":"Boyd Rankin","character":"Mikken"},{"actor":"Owen Dickey","character":"Winterfell Beekeeper"},{"actor":"Robert Yates","character":"King's Guard"},{"actor":"Unknown","character":"Jeyne Poole"},{"actor":"Unknown","character":"Cohollo"},{"actor":"Unknown","character":"Haggo"},{"actor":"Unknown","character":"Preston Greenfield"}]}
