{"title":"A Man Without Honor","season":"2","episode":"7","date":"Sun May 13 2012","authors":["David Benioff","D.B. Weiss"],"directors":["David Nutter"],"info":"\"A Man Without Honor\" is the seventh episode of the second season of Game of Thrones. It is the seventeenth episode of the series overall. It premiered on May 13, 2012. It was written by executive producers David Benioff & D.B. Weiss and directed by David Nutter.","plot":"Jaime meets a relative; Theon hunts; Dany receives an invitation.","summary":[{"location":"In the Seven Kingdoms","content":"At Winterfell, now held by the ironborn, Theon Greyjoy awakens to find that Osha is gone and she has escaped with Hodor, Bran Stark, Rickon Stark and their direwolves. Theon berates Lorren for allowing them to escape. When Lorren counters that Theon is also to blame for sleeping with Osha and letting his guard down, Theon furiously beats him. Theon leads the ironborn on horse to hunt down the boys with hounds to track them. The search leads them to a shepherd's farm, but the farmer says that he hasn't seen anyone. Dagmer finds some walnut shells, so they know that Bran and Rickon were there, but the hounds can't get the scent. Theon tells them the hunt is over and to return Maester Luwin to Winterfell: he knows where they are, and his mercy has been exhausted.\n\n    Theon has the burned bodies raised on the walls of Winterfell  \nTheon returns to Winterfell with two children's bodies burned beyond recognition, and he has them hoisted to either side of the main gate. Maester Luwin cries out in grief when he sees them.\nAt Harrenhal, Tywin Lannister is discussing the assassination of Amory Lorch with Ser Gregor Clegane. Tywin is convinced that it was an assassination attempt on himself, unaware that Jaqen H'ghar actually killed Lorch on the request of Arya Stark. Ser Gregor speculates that the Brotherhood Without Banners may have been responsible. Enraged, Tywin orders Gregor to burn out villages and farms in reprisal for this assassination attempt. Tywin later suspects that Arya is highborn, because she doesn't pronounce \"M'Lord\" the way commoners do, instead saying \"My Lord,\" and possesses an educated vocabulary. Arya makes the excuse that her Mother, whom she said was a handmaiden for years to royalty, had taught her to speak properly like them.\nIn King's Landing, Sansa Stark comes to thank Sandor \"The Hound\" Clegane for saving her life during the recent riot in the city and says that he was very brave. Sandor simply says that a dog doesn't need courage to fight off rats. Sansa is perturbed by his \"hateful speech,\" but Sandor cautions that a day will come when his penchant for violence is all that stands between her and her \"beloved\" King Joffrey.\n\n    Sansa and Shae trying to flip the mattress.  \nSansa awakens in her bed from a nightmare, only to find the sheets covered in blood–she has begun menstruating for the first time. Given that Joffrey openly promised to rape Sansa to \"put a son in you\" as soon as she had her blood, she then frantically tries to get rid of the bloody sheets to remove the evidence. Shae tries to help Sansa hide the sheets but Sandor finds them.\nTerrified of being brought to Joffrey, Sansa is instead brought before Queen Regent Cersei Lannister, who awkwardly tries to comfort her. Cersei presents Sansa with warped advice on Joffrey, bizarre counseling based on her bitter marriage with King Robert Baratheon. Blithely waving away her son's torment of Sansa and homicidal outbursts she says that her brother Jaime Lannister stayed by her side the whole time she was giving birth to Joffrey, but Sansa should never expect such devotion from Joffrey. Cersei firmly believes that Sansa and Joffrey not being in love is a good thing; she advises Sansa \"the more people you love, the weaker you are.\" Cersei says that no one expects her to love Joffrey, though she may take comfort in her love for the children they will have.\nPrivately, Cersei meets with Tyrion and expresses regret at having children with her own brother Jaime. She wonders if Joffrey's violent personality is the price of her and Jaime's sins. Tyrion earnestly points out that her other two children, Myrcella and Tommen, are not monsters, and they share an odd moment of sympathy.\n\n    Torrhen Karstark discovers the body of Alton Lannister.  \nAt King Robb Stark's army camp in the Westerlands, close to an unidentified keep, Alton Lannister returns as an envoy giving Queen Cersei's response to Robb's peace terms. Robb is unsurprised that she rejected them and imprisons Alton with his cousin Jaime Lannister. The nurse Talisa Maegyr discusses medical supplies she needs with Robb. Robb suggests she accompany him to the Crag to acquire the supplies she needs. That night, Jaime kills Alton to lure the guard, Torrhen Karstark, into his cell. Jaime strangles Torrhen and escapes, but is soon recaptured. Torrhen was the son of Lord Rickard Karstark, one of the major nobles from the North. Lord Rickard demands Jaime's execution in revenge, regardless of his protected status as both a prisoner of war and a valuable political hostage. Catelyn is forced to argue for Jaime's life. Catelyn confronts Jaime and tells him that he has no honor. Jaime bitterly explains that his vows as a knight required him to defend the innocent and serve the king, but his king was slaughtering the innocent. Jaime considers concepts like \"honor\" and \"loyalty\" naïve at best and hypocritical at worst. Jaime asserts that he has only been with Cersei and begins to ridicule Eddard Stark, Catelyn's late husband, by bringing up the shame of Eddard fathering a bastard. This brings Catelyn to breaking point and she asks for Brienne's sword.\n\nB"},{"location":"Beyond the Wall","content":"Jon Snow is still separated from the Night's Watch scouting group led by Qhorin Halfhand. He attempts to locate them, traveling with his wildling prisoner Ygritte. She argues with Jon, criticizing him for ignoring their common descent from the First Men. She states that the animosity of the southerners to the Wildlings is arbitrary, given that the Wildlings are only distinguished from them by living north of the Wall when it was constructed. She mocks Jon's sexual repression and surmises that he is a virgin. She taunts him by offering to teach him how to have sex. She escapes and leads him into an ambush. Ygritte says that Jon should have taken her when he had the chance.\n\nI"},{"location":"In Qarth","content":"Daenerys Targaryen is desperate to find her stolen dragons. Ser Jorah Mormont returns and she orders him to find them. Xaro Xhoan Daxos claims to be distressed at breaking his promise to protect her, fearing that his word will be publicly seen as worthless. Jorah questions Quaithe of Asshai. Quaithe knows that Jorah once betrayed Daenerys by spying on her. Quaithe warns Jorah that the man who stole the dragons is already with Daenerys. Jorah finds Daenerys, in the company of Kovarro, pleading with the council of The Thirteen to find her dragons. The warlock Pyat Pree confesses to stealing the dragons and declares Xaro the King of Qarth. Doubles of the warlock then magically appear behind the other members of the Thirteen and slit their throats, leaving only Pyat Pree and Xaro. Xaro secretly entered into an alliance with Pyat Pree to become king. Pyat Pree urges Daenerys to find her dragons at the House of the Undying as the three flee."}],"firsts":["Torrhen Karstark","Billy","Jack"],"deaths":["Ser Alton Lannister, beaten to death by Jaime Lannister","Torrhen Karstark, strangled by Jaime Lannister","Eleven of the Thirteen, all their throats slit by Pyat Pree's duplicates","The Spice King throat slit by Pyat Pree's duplicates","The Silk King throat slit by Pyat Pree's duplicates","The Copper King throat slit by Pyat Pree's duplicates","Winterfell shepherd, killed by Dagmer","Billy, killed by Dagmer","Jack, killed by Dagmer"],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Lena Headey","character":"Queen Cersei Lannister"},{"actor":"Nikolaj Coster-Waldau","character":"Ser Jaime Lannister"},{"actor":"Michelle Fairley","character":"Lady Catelyn Stark"},{"actor":"Emilia Clarke","character":"Khaleesi Daenerys Targaryen"},{"actor":"Iain Glen","character":"Ser Jorah Mormont"},{"actor":"Kit Harington","character":"Jon Snow"},{"actor":"Charles Dance","character":"Lord Tywin Lannister"},{"actor":"Isaac Hempstead-Wright","character":"Prince Bran Stark"},{"actor":"Richard Madden","character":"King Robb Stark"},{"actor":"Sophie Turner","character":"Princess Sansa Stark"},{"actor":"Maisie Williams","character":"Princess Arya Stark"},{"actor":"Alfie Allen","character":"Prince Theon Greyjoy"},{"actor":"Sibel Kekilli","character":"Shae"},{"actor":"Rory McCann","character":"Sandor Clegane"},{"actor":"Donald Sumpter","character":"Maester Luwin"},{"actor":"Ian Hanmore","character":"Pyat Pree"},{"actor":"Nicholas Blane","character":"the Spice King"},{"actor":"Nonso Anozie","character":"Xaro Xhoan Daxos"},{"actor":"Natalia Tena","character":"Osha"},{"actor":"Michael McElhatton","character":"Lord Roose Bolton"},{"actor":"Rose Leslie","character":"Ygritte"},{"actor":"Gwendoline Christie","character":"Brienne of Tarth"},{"actor":"Oona Chaplin","character":"Talisa Maegyr"},{"actor":"Ralph Ineson","character":"Dagmer Cleftjaw"},{"actor":"Laura Pradelska","character":"Quaithe"},{"actor":"John Stahl","character":"Lord Rickard Karstark"},{"actor":"Karl Davies","character":"Ser Alton Lannister"},{"actor":"Forbes KB","character":"Black Lorren"},{"actor":"Kristian Nairn","character":"Hodor"},{"actor":"Steven Cole","character":"Kovarro"},{"actor":"Ian Whyte","character":"Ser Gregor Clegane"},{"actor":"Art Parkinson","character":"Prince Rickon Stark"},{"actor":"Donagh Deeney","character":"a Winterfell shepherd"},{"actor":"Sara Dylan","character":"a Handmaid"},{"actor":"Steve Wilson","character":"Theon's master of hounds"},{"actor":"Slavko Juraga","character":"the Thirteen member"},{"actor":"Tyrone McElhennon","character":"Torrhen Karstark"},{"actor":"Neill Fleming","character":"a Karstark soldier"},{"actor":"Peter Ballance","character":"Farlen"},{"actor":"David Coakley","character":"Drennan"},{"actor":"Paul Caddell","character":"Jacks"},{"actor":"Duncan Lacroix","character":"a Karstark soldier"},{"actor":"David Sheenan (sic)","character":"a Stark guard"},{"actor":"Aidan Crowe","character":"Quent"},{"actor":"Reg Wayment","character":"a rioter"},{"actor":"Paul Monahan","character":"Stark Guard"},{"actor":"Unknown","character":"Palla"},{"actor":"Unknown","character":"Billy"},{"actor":"Unknown","character":"Jack"},{"actor":"Unknown","character":"Malakho"},{"actor":"Unknown","character":"a Stark guard"},{"actor":"Unknown","character":"the Silk King"},{"actor":"Unknown","character":"the Copper King"}]}
