{"title":"Blackwater","season":"2","episode":"9","date":"Sun May 27 2012","authors":["George R.R. Martin"],"directors":["Neil Marshall"],"info":"\"Blackwater\" is the ninth episode of the second season of Game of Thrones. It is the nineteenth episode of the series overall. It premiered on May 27, 2012. It was written by co-executive producer and writer of the novels George R.R. Martin and directed by Neil Marshall.","plot":"A massive battle rages for control of King's Landing and the Iron Throne.","summary":[{"location":"In King's Landing","content":"Bronn singing with the Lannister soldiers  \nTyrion Lannister leads the defense of King's Landing against an assault by King Stannis Baratheon in the Battle of the Blackwater. He spends the night before the expected siege in bed with Shae, telling her she can still leave the city. Tyrion has Varys provide him with a map of the tunnel network beneath the city. Varys tells Tyrion that he is all that stands between them and defeat. Bronn drinks with the Lannister men and has a confrontation with the Hound, who is here first beginning to show the emotional and political fluctuations he will experience in the coming battle and which will shape his destiny for the rest of the series. Stannis plans a naval assault aiming to overcome the city's small defensive fleet and land his troops at the walls of the city near the Mud Gate. \n\n    Bronn fires the arrow that triggers the wildfire explosion.  \nFrom the battlements, Joffrey berates Tyrion, demanding to know why his ships are not meeting Stannis's fleet. Tyrion has anticipated his strategy and does not field his fleet. Instead he sends a single ship filled with Wildfire into the heart of Stannis's fleet, leaking the volatile substance over the surface of the water. Bronn has been awaiting Tyrion's signal outside the city on the shores of the bay, and when Tyrion tosses a torch from the battlements, Bronn fires a flaming arrow triggering a massive, massive aquatic explosion. The ensuing conflagration devastates Stannis's fleet and destroys the ship of his high captain, Davos Seaworth, as well as killing Davos's son, Matthos.\n\n    Sandor breaks down.  \nStannis responds by putting his men ashore inside row boats, landing further from the walls to avoid the still burning inner bay. With less protection for his troops he predicts that thousands will die. He leads the assault personally and is the first to reach the walls. Tyrion orders Sandor Clegane to lead a sortie beyond the Mud Gate to repel the attackers. Sandor does as asked but is terrified by the fire and breaks down emotionally. Ser Lancel Lannister accompanies him and is wounded by an arrow. Bronn joins the fight in time to save the Hound's life. The Hound retreats after losing half of his men and refuses to go out again. He demands wine and walks away from the battle and his place in the Kingsguard, after saying in the presence of all, including the king, \"Fuck the kings guard. Fuck the city. Fuck the king.\"\nQueen Regent Cersei Lannister offers protection to the ladies of the court in Maegor's Holdfast. She had earlier obtained Essence of Nightshade (which is deadly unless taken in tiny amounts) from Grand Maester Pycelle and keeps the headsman Ser Ilyn Payne at her side at all times, preparing for the worst. She drinks wine heavily during the assault and seems, to simultaneously torment and mother her captive, Sansa Stark, with a sort of cynical feminism involving dire descriptions of the rapes that will occur if the city falls. She also begins to question Shae, who seems to her perhaps an unlikely handmaiden. When Lancel comes to tell her that Stannis has reached the walls Cersei orders him to bring Joffrey back to the Red Keep, ignoring his protests that it would damage morale.\n\n    Tyrion rallies the troops  \nJoffrey willingly leaves the defensive line with Lancel and charges Ser Mandon Moore and Ser Boros Blount of the Kingsguard to fight in the King's name. The gold cloaks' morale is broken by his departure. Tyrion steels himself to lead a sortie of his own. He rallies his men by telling them to fight for their city, their homes and their women, if not for their king and utters his famous line, \"Those are brave men are knocking at our door. Let's go kill them!\" He leads his men through the tunnels beneath the city and is able to defeat Stannis's troops manning a battering ram at the Mud Gate. Tyrion is betrayed by Ser Mandon while fighting against a group of reinforcements. Mandon slashes Tyrion across the face with his sword. Before he can strike Tyrion again, Tyrion's squire Podrick Payne kills Ser Mandon from behind with his spear. Tyrion, barely conscious and held by Podrick watches a battle that seems lost.\n\n    Lancel wounded by arrow to shoulder  \nLancel returns to Cersei to warn that they are defeated unless Joffrey returns. When Lancel tries to be firm with her, Cersei ignores his counsel, pushes him out of the way (deliberately causing him pain by hitting his injured side), and storms out. Sansa tries to keep up the morale of the other women, frightened by Cersei's sudden departure. Sansa leads them in singing a hymn. Cersei has taken Tommen to the throne room. She sits with him on the Iron Throne, and tells him a story about a young lion and how it did not need to fear other beasts of the forest, the wolf and the stag. As she does this, she readies the poison for herself and for her son. Shae tells Sansa to go to her chambers, lock herself in, and await Stannis, as he would not harm her, but Ser Ilyn might. Sansa finds the Hound waiting in her room. He offers to take her north to Winterfell, but she says she will be safe there when Stannis takes the throne. \n\n    Cersei and Tommen on the Iron Throne as the battle rages.  \nThe Hound scares Sansa, but tells her to look at him, saying that since the world is made up of killers like Stannis, her father, her brother Robb, and he himself, she better get used to looking at them. Though he promises to protect her, she is still too afraid of him to go with him. Cersei sits on the Iron Throne and prepares to poison Tommen in order to prevent him from being taken captive.\n\n    Tywin and Loras lead their victorious forces into the throne room.  \nThe forces of Tywin Lannister and, it is revealed, his new allies in House Tyrell join the battle. Their cavalry charge is led by a warrior dressed in the armor of Renly Baratheon and it decimates Stannis's army. The survivors flee to their ships. Stannis is dragged from the battle by his guards, screaming for his men to stand and fight. Tyrion collapses into unconsciousness as the battle turns in the Crown's favor. Tywin bursts into the throne room and announces their victory, just in time to stop Cersei from killing Tommen. Ser Loras Tyrell reveals himself as the knight wearing Renly's armor."}],"firsts":["Ser Boros Blount (first identified)","Ser Imry Florent","Baratheon Officer"],"deaths":["Matthos Seaworth, killed in the wildfire explosion","Baratheon Officer, hacked to death by Tyrion Lannister","Ser Mandon Moore, speared through the back of the neck by Podrick Payne"],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Lena Headey","character":"Queen Cersei Lannister"},{"actor":"Charles Dance","character":"Lord Tywin Lannister"},{"actor":"Liam Cunningham","character":"Ser Davos Seaworth"},{"actor":"Jack Gleeson","character":"King Joffrey Baratheon"},{"actor":"Sophie Turner","character":"Princess Sansa Stark"},{"actor":"Rory McCann","character":"Sandor Clegane"},{"actor":"Stephen Dillane","character":"King Stannis Baratheon"},{"actor":"Jerome Flynn","character":"Bronn"},{"actor":"Conleth Hill","character":"Lord Varys"},{"actor":"Sibel Kekilli","character":"Shae"},{"actor":"Roy Dotrice","character":"Wisdom Hallyne"},{"actor":"Julian Glover","character":"Grand Maester Pycelle"},{"actor":"Eugene Simon","character":"Ser Lancel Lannister"},{"actor":"Kerr Logan","character":"Matthos Seaworth"},{"actor":"Finn Jones","character":"Ser Loras Tyrell"},{"actor":"Sahara Knite","character":"Armeca"},{"actor":"Tony Way","character":"Dontos Hollard"},{"actor":"Wilko Johnson","character":"Ser Ilyn Payne"},{"actor":"Stephen Swift","character":"Singing Lannister soldier"},{"actor":"Callum Wharry","character":"Tommen Baratheon"},{"actor":"Daniel Portman","character":"Podrick Payne"},{"actor":"Gordan Mahon","character":"Ser Imry Florent"},{"actor":"James Doran","character":"Ser Mandon Moore"},{"actor":"Kieran Cunningham","character":"a Baratheon officer"},{"actor":"Michael Grennell","character":"the Captain of the Archers"},{"actor":"Hugh Irvine","character":"Lannister Archer"},{"actor":"Graeme Peacock","character":"Market Trader"},{"actor":"Darran Watt","character":"Soldier"},{"actor":"Unknown","character":"Ser Boros Blount"}]}
