{"title":"The Ghost of Harrenhal","season":"2","episode":"5","date":"Sun Apr 29 2012","authors":["David Benioff","D.B. Weiss"],"directors":["David Petrarca"],"info":"\"The Ghost of Harrenhal\" is the fifth episode of the second season of Game of Thrones. It is the fifteenth episode of the series overall. It premiered on April 29, 2012. It was written by executive producers David Benioff and D.B. Weiss and directed by David Petrarca.","plot":"Confusion rages in the Stormlands in the wake of a devastating reversal. Catelyn must flee with a new ally, whilst Littlefinger sees an opportunity in the chaos. Theon seeks to prove himself to his father in battle. Arya receives a promise from the enigmatic Jaqen H'ghar. The Night's Watch arrives at the Fist of the First Men. Daenerys Targaryen receives a marriage proposal.","summary":[{"location":"In the Seven Kingdoms","content":"King Renly is assassinated.  \nKing Renly Baratheon is assassinated by the Shadow brought into the world by Melisandre and fathered by Stannis Baratheon just after agreeing to an alliance with King Robb Stark. His kingsguard Brienne is mistakenly blamed for the death and she flees the camp with Catelyn Stark. Brienne later swears fealty to Catelyn. Renly's army disintegrates, with the forces of House Tyrell fleeing to Highgarden and the rest of his bannermen joining his brother King Stannis Baratheon. Lord Petyr Baelish accompanies the Tyrell faction, sensing an opportunity to sway them to Joffrey's side. Ser Davos Seaworth challenges King Stannis on his use of Melisandre's magic and convinces him to leave Melisandre behind when they attack King's Landing to quash rumors of her influence on him. Stannis places Davos in command of his fleet.\nHand of the King Tyrion Lannister brings news of Renly's death to his sister, Queen Regent Cersei Lannister. She is pleased, but Tyrion predicts Stannis's imminent attack. He tries to discuss plans for their defense, but she insists on keeping them secret. From his spy, his cousin Ser Lancel Lannister, Tyrion learns that Cersei has been having extensive meetings with the Alchemists' Guild. \n\n    Brienne kills a Kingsguard  \nHe visits Wisdom Hallyne of the guild and learns that they have stockpiled thousands of jars of Wildfire, a dangerously flammable substance, to use as catapult ammunition. Bronn warns that this strategy could be disastrous, and result in panicking defenders accidentally burning down their own city. Tyrion orders Hallyne to answer to him instead of Cersei. Tyrion also passes a street protest that blames him for the ills of the city, as they believe Tyrion to be manipulating Joffrey.\nTheon Greyjoy takes command of his new ship and finds his crew insubordinate. His first mate Dagmer Cleftjaw tells him that he needs to prove himself to the men and Theon plans to raid Torrhen's Square to draw the remaining forces of House Stark from Winterfell. His plan is successful and Ser Rodrik Cassel leads a force of 200 men to relieve his siege of Torrhen's Square. Bran Stark provides well judged counsel to his subjects but continues to be troubled by his dreams. \n\n    Tyrion discovers the Wildfire.  \nHe discusses dreaming of a three-eyed raven with the wildling woman Osha but she declines to interpret the dream. He also confides dreaming of the sea flooding Winterfell and drowning his people, including Ser Rodrik.\nTywin Lannister hosts a protracted war council to determine a new strategy to deal with Robb. Arya Stark serves as his cupbearer. Though he does not know who she really is, Tywin realizes that she is of northern extraction and questions her about her origins and opinions regarding Robb. She manages to avoid revealing her true identity. She leaves to fetch water and encounters Jaqen H'ghar, now a Lannister man-at-arms. Jaqen says that because she saved his life, and those of his two fellow prisoners, he owes her three deaths and offers to kill three people of her choosing. She targets the Tickler, Ser Gregor Clegane's torturer.\nThe Tickler is soon found dead in the courtyard, his neck twisted 180 degrees. Arya notices Jaqen on the walkway above and he holds a single finger to his face to signify his responsibility.\n\nB"},{"location":"Beyond the Wall","content":"The Night's Watch and Ghost on the Fist of the First Men.  \nLord Commander Jeor Mormont leads his ranging to the ancient Fist of the First Men to rendezvous with the experienced scout Qhorin Halfhand. Qhorin arrives and warns Jeor that they must change their tactics to combat the wildling army under King-Beyond-the-Wall Mance Rayder. He suggests sending a small party ahead to neutralize Mance's lookouts in the Skirling Pass. Jon Snow joins Qhorin's group, while Samwell Tarly takes his task as the steward of Lord Commander Jeor Mormont.\n\nA"},{"location":"Across the Narrow Sea","content":"Drogon, breathing fire for the first time.  \nDaenerys Targaryen has taught her dragons to breathe fire on command and they are now capable of sharing and eating meat on their own. She is enjoying the hospitality of the wealthy noble Xaro Xhoan Daxos in the city of Qarth. He hosts a gathering in her honor in the gardens of his home. She is perturbed by the tricks of the warlock Pyat Pree, who invites her to visit the House of the Undying.\nThe masked woman Quaithe delivers an enigmatic warning to Ser Jorah Mormont about Daenerys's need for protection from those who lust after her dragons. Xaro offers to fund Daenerys's invasion of Westeros in exchange for her hand in marriage. Later, she seeks Jorah's advice about the proposal and he cautions against accepting financial aid. He suggests that she will be able to win her throne should she reach Westeros with just a single ship. He reveals his depth of feeling for her but she does not return his affections."}],"firsts":["Emmon Cuy","Robar Royce","Reginald Lannister","Wisdom Hallyne","Lorren","Drennan","Dagmer","Malakho","Quaithe","Qhorin Halfhand","Harker","Stonesnake","Borba"],"deaths":["King Renly Baratheon, stabbed through the chest by the shadow assassin","Emmon Cuy, cut down by Brienne of Tarth","Robar Royce, cut down by Brienne of Tarth","The Tickler, neck snapped by Jaqen H'ghar"],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Lena Headey","character":"Queen Cersei Lannister"},{"actor":"Michelle Fairley","character":"Lady Catelyn Stark"},{"actor":"Emilia Clarke","character":"Khaleesi Daenerys Targaryen"},{"actor":"Aidan Gillen","character":"Lord Petyr Baelish"},{"actor":"Iain Glen","character":"Ser Jorah Mormont"},{"actor":"Kit Harington","character":"Jon Snow"},{"actor":"Charles Dance","character":"Lord Tywin Lannister"},{"actor":"Liam Cunningham","character":"Ser Davos Seaworth"},{"actor":"Alfie Allen","character":"Theon Greyjoy"},{"actor":"John Bradley","character":"Samwell Tarly"},{"actor":"Isaac Hempstead-Wright","character":"Prince Bran Stark"},{"actor":"Maisie Williams","character":"Princess Arya Stark"},{"actor":"Stephen Dillane","character":"King Stannis Baratheon"},{"actor":"Natalie Dormer","character":"Queen Margaery Tyrell"},{"actor":"James Cosmo","character":"Lord Commander Jeor Mormont"},{"actor":"Jerome Flynn","character":"Bronn"},{"actor":"Donald Sumpter","character":"Maester Luwin"},{"actor":"Roy Dotrice","character":"Wisdom Hallyne"},{"actor":"Ron Donachie","character":"Ser Rodrik Cassel"},{"actor":"Gwendoline Christie","character":"Brienne of Tarth"},{"actor":"Natalia Tena","character":"Osha"},{"actor":"Gethin Anthony","character":"King Renly Baratheon"},{"actor":"Ian Hanmore","character":"Pyat Pree"},{"actor":"Tom Wlaschiha","character":"Jaqen H'ghar"},{"actor":"Joe Dempsie","character":"Gendry"},{"actor":"Eugene Simon","character":"Ser Lancel Lannister"},{"actor":"Simon Armstrong","character":"Qhorin Halfhand"},{"actor":"Mark Stanley","character":"Grenn"},{"actor":"Finn Jones","character":"Ser Loras Tyrell"},{"actor":"Ben Crompton","character":"Eddison Tollett"},{"actor":"Roxanne McKee","character":"Doreah"},{"actor":"Amrita Acharia","character":"Irri"},{"actor":"Steven Cole","character":"Kovarro"},{"actor":"Nonso Anozie","character":"Xaro Xhoan Daxos"},{"actor":"Gemma Whelan","character":"Princess Yara Greyjoy"},{"actor":"Kristian Nairn","character":"Hodor"},{"actor":"Ben Hawkey","character":"Hot Pie"},{"actor":"Ralph Ineson","character":"Dagmer Cleftjaw"},{"actor":"Forbes KB","character":"Black Lorren"},{"actor":"Fintan McKeown","character":"Ser Amory Lorch"},{"actor":"Edward Tudor Pole","character":"a Protestor"},{"actor":"Laura Pradelska","character":"Quaithe"},{"actor":"Patrick Fitzsymons","character":"Reginald Lannister"},{"actor":"Art Parkinson","character":"Prince Rickon Stark"},{"actor":"Aimee Richardson","character":"Princess Myrcella Baratheon"},{"actor":"Anthony Morris","character":"the Tickler"},{"actor":"Donagh Deeney","character":"a Winterfell shepherd"},{"actor":"Kristina Krepela","character":"a Qartheen woman"},{"actor":"Slavko Juraga","character":"a Thirteen member"},{"actor":"David Coakley","character":"Drennan"},{"actor":"Dez McMahon","character":"Baratheon Commander"},{"actor":"Unknown","character":"Ser Emmon Cuy"},{"actor":"Unknown","character":"Ser Robar Royce"},{"actor":"Unknown","character":"Eglantine"},{"actor":"Unknown","character":"Lannister bannerman 1"},{"actor":"Unknown","character":"Lannister bannerman 2"},{"actor":"Unknown","character":"Lannister bannerman 3"},{"actor":"Unknown","character":"Malakho"},{"actor":"Unknown","character":"Stonesnake"},{"actor":"Unknown","character":"Harker"},{"actor":"Unknown","character":"Borba"}]}
