{"title":"The Old Gods and the New","season":"2","episode":"6","date":"Sun May 06 2012","authors":["Vanessa Taylor"],"directors":["David Nutter"],"info":"\"The Old Gods and the New\" is the sixth episode of the second season of Game of Thrones. It is the sixteenth episode of the series overall. It premiered on May 6, 2012. It was written by co-executive producer Vanessa Taylor and directed by David Nutter.","plot":"Arya has a surprise visitor; Dany vows to take what is hers; Joffrey meets his subjects; Qhorin gives Jon a chance to prove himself.","summary":[{"location":"In the North","content":"Theon approaches Bran, then takes over Winterfell.  \nAt Winterfell, Maester Luwin frantically sends off a messenger raven just as a band of raiders from House Greyjoy, led by Theon Greyjoy, take over the undefended castle. Theon had lured the defenders away with a feint at Torrhen's Square and then infiltrated the castle using grappling claws. Theon tells Bran Stark to surrender the castle to him to save his people. Bran submits in front of his assembled people. Ser Rodrik Cassel is captured by Theon's men as he is returning from Torrhen's Square. He spits in Theon's face, and Dagmer Cleftjaw insists that Theon must kill him, or lose face in front of his ironborn raiders. Theon botches the beheading of Ser Rodrik, requiring several hacks and a kick, horrifying the people of Winterfell. Later that night, Osha the wildling has sex with Theon, but then sneaks out of his room while he is asleep. Osha frees Bran, Rickon Stark, Hodor, and their direwolves, Summer and Shaggydog, smuggling them out of the castle and killing one of Theon's guards in the process."},{"location":"In the Westerlands","content":"At King Robb Stark's army camp, Robb chats with Talisa, who has followed his forces on their campaign. Robb introduces Talisa to his mother Catelyn Stark, who has returned from the Stormlands along with Brienne of Tarth. They are interrupted when Lord Roose Bolton arrives with the terrible news sent by Luwin's last messenger raven. Furious at Theon's betrayal, Robb intends to march his army back to the North to repel the invasion. Roose advises that the few hundred soldiers left scattered in the North can be rallied by his bastard son, Ramsay Snow, who is in the North at the Dreadfort. They could overcome the small Ironborn invasion force. Roose warns that retreating the entire Northern army group would lose everything they have gained. Robb agrees, but insists that Bolton's men take Theon alive so Robb can look him in the eyes and ask \"Why?\" before personally executing him."},{"location":"In the Riverlands","content":"At Harrenhal, the main base camp for the House Lannister army in the Riverlands, Tywin Lannister berates Ser Amory Lorch for delivering a letter to their enemies instead of their allies, because he cannot read properly. He discovers that his cupbearer \"Arry\" (secretly Arya Stark) can read. \n\n    Joffrey has excrement thrown on him by rioting peasants.  \nPetyr \"Littlefinger\" Baelish arrives at camp and meets with Tywin. Arya tries to hide her face to prevent Littlefinger from identifying her. Baelish discusses the assassination of Renly Baratheon, and the subsequent rallying of the noble Houses from the Stormlands under the banner of his older brother Stannis Baratheon. However, House Tyrell of the Reach has retreated its large army back to their capital at Highgarden, and has not joined Stannis. Baelish discusses with Tywin the possibility of forming an alliance between House Lannister and House Tyrell.\nLater Tywin questions Arya about her origins. While Tywin is distracted, Arya sees that a letter on his table is about her older brother Robb Stark, so she snatches it. After asking Tywin about his own father, Tywin sends her to fetch more firewood. She takes this opportunity to read the letter, but unfortunately bumps into Amory Lorch who sees that she is carrying the letter and grows suspicious. Arya runs away and Amory heads to tell Tywin. Arya runs to find Jaqen H'ghar, telling him that Amory Lorch is the second name he owes her. Just as Amory Lorch reaches Tywin's quarters, he falls down dead with a poisoned dart lodged in his neck."},{"location":"In King's Landing","content":"The royal court including King Joffrey Baratheon, Queen Regent Cersei Lannister, Prince Tommen Baratheon, and Sansa Stark are at the docks seeing off Princess Myrcella Baratheon as she departs in a ship bound for Dorne. Cersei is heartbroken and warns Tyrion that she will not forgive him for sending away her only daughter. \nAs per Tyrion's plans, Myrcella will stay in Dorne with House Martell until she comes of age to fulfill the marriage alliance to their youngest son, Trystane Martell. The High Septon of the Faith of the Seven offers a blessing for her departure. The streets of the capital city are overflowing with starving refugees from the War of the Five Kings, as Cersei ignored both Tyrion and Janos Slynt's earlier warnings that something had to be done to care for the starving peasants or there would be mounting discontent with her son's rule.\nAs the royal party travels back to the Red Keep through the crowded streets, the starving refugees and commoners of King's Landing plead for bread and hurl insults at King Joffrey, and ultimately, someone throws cow excrement into Joffrey's face. Despite being accompanied by only a few dozen guards facing hundreds of peasants, Joffrey impetuously orders his soldiers to kill the entire crowd. \n\n    Sansa is almost raped.  \nA riot subsequently erupts and spreads throughout the city. The royal party's guards are soon overwhelmed, and Joffrey, Cersei and Tyrion barely make it back to the castle unscathed. The High Septon is literally torn apart by the mob.\nTyrion is enraged by Joffrey's shocking stupidity, for massively overreacting to having cow dung thrown at him, and for not realizing that his orders would cause a riot among the starving peasants and endanger the entire royal party. Joffrey, still manically cursing the mob and demanding they all be killed, shrieks that Tyrion cannot speak to him in that way and petulantly reminds his uncle that he is talking to a king. Tyrion then contemptuously slaps his nephew across the face but Joffrey does not retaliate. The scant two thousand City Watch guards have difficulty containing the riot, and chaos reigns throughout the city. Tyrion realizes to his horror that Sansa Stark was lost in the crowd. Joffrey petulantly refuses to send his men after her, oblivious to her importance as a hostage or the fact that if any harm comes to her, the Starks may retaliate by executing his uncle Jaime. Outside, Sansa is dragged away by a mob of angry men and is about to be raped, when Sandor \"The Hound\" Clegane arrives and slays her assailants. He carries Sansa to the castle and orders handmaids to take care of her. Tyrion thanks him for saving Sansa's life, but Sandor bluntly responds that he didn't do it for him.\n\nB"},{"location":"Beyond the Wall","content":"Jon first lays eyes on Ygritte.  \nThe scouting party of the Night's Watch led by Qhorin Halfhand has left the expeditionary base their main force set up at the Fist of the First Men, and continues searching for the wildlings in the Frostfangs mountain range. They encounter a small group of wildling scouts and engage them in combat, killing all except one: a red-haired young woman named Ygritte. Qhorin orders Jon Snow to execute her while the rest of them continue on up the mountain. Jon hesitates, giving Ygritte enough time to make a run for it. Jon pursues and captures Ygritte, but they have become separated from Qhorin's scouting party. With darkness falling, Jon and his prisoner have to settle in for the night, hoping to link back up with Qhorin when daylight returns.\n\nA"},{"location":"Across the Narrow Sea","content":"Daenerys discovers that her guards have been slain and her dragons are missing.  \nIn Qarth, Daenerys Targaryen tries to negotiate with the Spice King for ships to return to Westeros. However, he considers it to be too risky an investment – considering that she has no army and has no open supporters in Westeros – and she receives nothing. Returning with Xaro Xhoan Daxos to his mansion, Daenerys finds her guards dead, Irri strangled to death, and her dragons missing. A hooded figure carries the dragons in a covered box up steps towards a tower."}],"firsts":["Farlen","Palla","The High Septon","Ygritte","Quent"],"deaths":["Ser Rodrik Cassel, beheaded by Theon Greyjoy","The High Septon, torn apart by rioters","Ser Amory Lorch, poisoned by Jaqen H'ghar","Drennan, throat slit by Osha","Irri, strangled by an unidentified party (later revealed to be killed by Doreah in deleted scene)"],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Lena Headey","character":"Queen Cersei Lannister"},{"actor":"Michelle Fairley","character":"Lady Catelyn Stark"},{"actor":"Emilia Clarke","character":"Khaleesi Daenerys Targaryen"},{"actor":"Aidan Gillen","character":"Lord Petyr Baelish"},{"actor":"Kit Harington","character":"Jon Snow"},{"actor":"Charles Dance","character":"Lord Tywin Lannister"},{"actor":"Isaac Hempstead-Wright","character":"Prince Bran Stark"},{"actor":"Richard Madden","character":"King Robb Stark"},{"actor":"Sophie Turner","character":"Princess Sansa Stark"},{"actor":"Maisie Williams","character":"Princess Arya Stark"},{"actor":"Alfie Allen","character":"Prince Theon Greyjoy"},{"actor":"Jack Gleeson","character":"King Joffrey Baratheon"},{"actor":"Sibel Kekilli","character":"Shae"},{"actor":"Rory McCann","character":"Sandor Clegane"},{"actor":"Donald Sumpter","character":"Maester Luwin"},{"actor":"Ron Donachie","character":"Ser Rodrik Cassel"},{"actor":"Natalia Tena","character":"Osha"},{"actor":"Michael McElhatton","character":"Lord Roose Bolton"},{"actor":"Nonso Anozie","character":"Xaro Xhoan Daxos"},{"actor":"Nicholas Blane","character":"the Spice King"},{"actor":"Tom Wlaschiha","character":"Jaqen H'ghar"},{"actor":"Rose Leslie","character":"Ygritte"},{"actor":"Gwendoline Christie","character":"Brienne of Tarth"},{"actor":"Oona Chaplin","character":"Talisa Maegyr"},{"actor":"Simon Armstrong","character":"Qhorin Halfhand"},{"actor":"Ralph Ineson","character":"Dagmer Cleftjaw"},{"actor":"Ian Beattie","character":"Ser Meryn Trant"},{"actor":"Fintan McKeown","character":"Ser Amory Lorch"},{"actor":"Forbes KB","character":"Black Lorren"},{"actor":"Amrita Acharia","character":"Irri"},{"actor":"Kristian Nairn","character":"Hodor"},{"actor":"Steven Cole","character":"Kovarro"},{"actor":"David Verrey","character":"the High Septon"},{"actor":"Peter Ballance","character":"Farlen"},{"actor":"David Coakley","character":"Drennan"},{"actor":"Aimee Richardson","character":"Princess Myrcella Baratheon"},{"actor":"Art Parkinson","character":"Prince Rickon Stark"},{"actor":"Callum Wharry","character":"Prince Tommen Baratheon"},{"actor":"Reg Wayment","character":"a rioter"},{"actor":"Aiden Condron","character":"a Lannister captain"},{"actor":"Marko Juraga","character":"a rioter"},{"actor":"Rea Separovic","character":"a rioter"},{"actor":"Paul Caddell","character":"Jacks"},{"actor":"Aidan Crowe","character":"Quent"},{"actor":"Unknown","character":"Palla"},{"actor":"Unknown","character":"Malakho"},{"actor":"Unknown","character":"Ser Arys Oakheart"},{"actor":"Unknown","character":"Harker"},{"actor":"Unknown","character":"Stonesnake"},{"actor":"Unknown","character":"Borba"},{"actor":"Unknown","character":"a Stark guard"}]}
