{"title":"The Prince of Winterfell","season":"2","episode":"8","date":"Sun May 20 2012","authors":["David Benioff","D.B. Weiss"],"directors":["Alan Taylor"],"info":"\"The Prince of Winterfell\" is the eighth episode of the second season of Game of Thrones. It is the eighteenth episode of the series overall. It premiered on May 20, 2012. It was written by executive producers David Benioff & D.B. Weiss and directed by co-executive producer Alan Taylor.","plot":"Theon holds the fort; Arya calls in her debt with Jaqen; Robb is betrayed; Stannis and Davos approach their destination. Bran and Rickon Stark are revealed to be alive.","summary":[{"location":"Beyond the Wall","content":"Ygritte brings Jon Snow before the Lord of Bones, who orders him executed, because he has already captured Qhorin Halfhand and doesn't need two \"crows\" for questioning. Ygritte convinces him to spare Jon because of his Stark blood. Qhorin initiates a plan to install Jon as a spy within the wildling ranks.\nGrenn and Samwell Tarly discover a cache of dragonglass weapons at the Fist of the First Men. Jon's absence has been noted, but Sam refuses to believe that he is dead.\n\nA"},{"location":"Across the Narrow Sea","content":"Ser Jorah Mormont advises Daenerys Targaryen to leave her dragons and flee Qarth, as he has recently booked passage to Astapor. She insists on attempting to reclaim them and asks Ser Jorah to lead her to the House of the Undying, without knowing what lies in wait. \n\nI"},{"location":"In the Seven Kingdoms","content":"Theon gives Dagmer a pouch of gold to compensate for the killing of the orphans.  \nYara Greyjoy arrives at Winterfell with a small band of men, but instead of bringing reinforcements she offers Theon only advice. Winterfell is too far from the sea, they can't successfully defend it with so few soldiers, and the North is rising against him. She implores Theon to abandon the castle and return home with her, but he refuses to give up his prize. Dagmer tells Theon that after killing the orphans, he also murdered the farmer and his wife.\n\n    Bran overhears Luwin and Osha.  \nLuwin spots Osha sneaking into the catacombs. He follows her inside, and she explains that after reaching the farm she doubled back, using a stream to mask their scent from the hounds. Luwin urges her not to tell Bran and Rickon about the children Theon had murdered, but Bran is sitting up behind a corner and listening to them.\nStannis Baratheon's fleet is closing in on King's Landing. Stannis tells Davos that he admires him and offers him the Hand of the King role once he takes the throne.  \nTyrion Lannister scours history books seeking inspiration for his plans to defend the city. He takes advice from Bronn and Varys and infers that he has decided to make use of the stocks of wildfire. King Joffrey Baratheon is full of bravado, but his mother is worried about letting him fight. She tries to ensure his safety by kidnapping the prostitute Ros, believing that she is Tyrion's lover. Tyrion is relieved that Shae is safe but vows revenge against his sister. \n\n    Arya gives Jaqen his own name  \nLord Tywin Lannister is torn between needing to defend King's Landing and wanting to drive King Robb Stark from the Westerlands. He decides to march west, leaving Arya Stark at Harrenhal to serve his castellan, Ser Gregor Clegane. Realizing that she has missed her chance to kill Tywin, Arya pressures the assassin Jaqen H'ghar into aiding her escape from Harrenhal. She forces him to help her by giving him his own name as the third death he promised. She will only revoke his name when he agrees to break her and her friends out of the fortress. Arya, Hot Pie, and Gendry walk through the gates at midnight, as Jaqen instructed. They escape Harrenhal, realizing that the guards have been killed.\nRobb is furious when he learns that his mother Catelyn Stark has freed his prized captive Ser Jaime Lannister. He tells her that she has betrayed him and orders her kept under guard. Catelyn has sent Brienne of Tarth to escort Jaime to King's Landing to exchange him for her daughters, Sansa and Arya. Brienne uses a canoe to evade pursuit. Robb plans to relieve Winterfell by turning Theon's men against him with an offer of mercy, issuing his orders to the bastard of the Dreadfort through Roose Bolton. Robb seeks solace in the arms of Lady Talisa Maegyr, ignoring his betrothal to House Frey."}],"firsts":["The Lord of Bones"],"deaths":["Borba, killed off-screen by the Lord of Bones' warband","Harker, killed off-screen by the Lord of Bones' warband","Stonesnake, killed off-screen by the Lord of Bones' warband"],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Lena Headey","character":"Queen Cersei Lannister"},{"actor":"Nikolaj Coster-Waldau","character":"Ser Jaime Lannister"},{"actor":"Michelle Fairley","character":"Lady Catelyn Stark"},{"actor":"Emilia Clarke","character":"Khaleesi Daenerys Targaryen"},{"actor":"Iain Glen","character":"Ser Jorah Mormont"},{"actor":"Kit Harington","character":"Jon Snow"},{"actor":"Charles Dance","character":"Lord Tywin Lannister"},{"actor":"Liam Cunningham","character":"Ser Davos Seaworth"},{"actor":"Jack Gleeson","character":"King Joffrey Baratheon"},{"actor":"Isaac Hempstead-Wright","character":"Prince Bran Stark"},{"actor":"Richard Madden","character":"King Robb Stark"},{"actor":"Maisie Williams","character":"Princess Arya Stark"},{"actor":"Alfie Allen","character":"Prince Theon Greyjoy"},{"actor":"John Bradley","character":"Samwell Tarly"},{"actor":"Stephen Dillane","character":"King Stannis Baratheon"},{"actor":"Sibel Kekilli","character":"Shae"},{"actor":"Jerome Flynn","character":"Bronn"},{"actor":"Conleth Hill","character":"Lord Varys"},{"actor":"Donald Sumpter","character":"Maester Luwin"},{"actor":"Natalia Tena","character":"Osha"},{"actor":"Oona Chaplin","character":"Lady Talisa Maegyr"},{"actor":"Michael McElhatton","character":"Lord Roose Bolton"},{"actor":"Tom Wlaschiha","character":"Jaqen H'ghar"},{"actor":"Rose Leslie","character":"Ygritte"},{"actor":"Simon Armstrong","character":"Qhorin Halfhand"},{"actor":"Gemma Whelan","character":"Princess Yara Greyjoy"},{"actor":"Joe Dempsie","character":"Gendry"},{"actor":"Gwendoline Christie","character":"Brienne of Tarth"},{"actor":"Ralph Ineson","character":"Dagmer Cleftjaw"},{"actor":"Ian Gelder","character":"Ser Kevan Lannister"},{"actor":"John Stahl","character":"Lord Rickard Karstark"},{"actor":"Mark Stanley","character":"Grenn"},{"actor":"Ben Crompton","character":"Eddison Tollett"},{"actor":"Ben Hawkey","character":"Hot Pie"},{"actor":"Esme Bianco","character":"Ros"},{"actor":"Andy Beckwith","character":"Rorge"},{"actor":"Steven Cole","character":"Kovarro"},{"actor":"Edward Dogliani","character":"Lord of Bones"},{"actor":"Kristian Nairn","character":"Hodor"},{"actor":"Gerard Jordan","character":"Biter"},{"actor":"Art Parkinson","character":"Prince Rickon Stark"},{"actor":"Daniel Portman","character":"Podrick Payne"},{"actor":"Ian Whyte","character":"Ser Gregor Clegane"},{"actor":"Kerr Logan","character":"Matthos Seaworth"},{"actor":"Moe Dunford","character":"a Stark messenger"},{"actor":"Mark Byatt","character":"a Lannister torturer"},{"actor":"David Sheenan (sic)","character":"a Stark guard"},{"actor":"Aiden Condron","character":"a Lannister captain"},{"actor":"Ciaran McMahon","character":"a Lannister soldier"},{"actor":"Unknown","character":"an Ironborn lookout"},{"actor":"Unknown","character":"a Tortured Lannister"},{"actor":"Unknown","character":"the Fury gunnery officer"},{"actor":"Unknown","character":"Lannister bannerman 1"},{"actor":"Unknown","character":"Lannister bannerman 2"},{"actor":"Unknown","character":"Lannister bannerman 3"}]}
