{"title":"Valar Morghulis","season":"2","episode":"10","date":"Sun Jun 03 2012","authors":["David Benioff","D.B. Weiss"],"directors":["Alan Taylor"],"info":"\"Valar Morghulis\" is the tenth and final episode of the second season of Game of Thrones. It is the twentieth episode of the series overall. It premiered on June 3, 2012. It was written by executive producers David Benioff & D.B. Weiss and directed by co-executive producer Alan Taylor.","plot":"Tyrion awakens to a changed situation. King Joffrey doles out rewards to his subjects. As Theon stirs his men to action, Luwin offers some final advice. Brienne silences Jaime; Arya receives a gift from Jaqen; Dany goes to a strange place; Jon proves himself to Qhorin.","summary":[{"location":"In the Seven Kingdoms","content":"Tyrion Lannister convalesces from the wound he suffered during the Battle of the Blackwater at the hands of Ser Mandon Moore. He is informed by a gloating Grand Maester Pycelle that he is no longer Acting Hand of the King, as his father Tywin Lannister has returned to the city and will take over his duties as Hand. Varys visits and tells him that Bronn has been relieved of his command of the gold cloaks and his hill tribesmen have gone home with their plunder; Tyrion has lost all of his power. Varys thanks Tyrion for his part in defending the city, noting that no one else will do so. Shae urges Tyrion to leave with her for Pentos, but he refuses. \nKing Joffrey rewards those who served him well in the battle. Lord Tywin Lannister is officially named Hand of the King and Savior of the City. Littlefinger is awarded Harrenhal for brokering the alliance between Houses Lannister and Tyrell. Loras Tyrell asks that Joffrey wed his sister Margaery to unite their houses. Queen Cersei Lannister and Pycelle make a show of convincing Joffrey to set aside his betrothal to Sansa Stark, given the treachery of House Stark. Joffrey plays along and agrees to wed Margaery. In private, Sansa is overjoyed to be free, until Littlefinger points out that it will not stop Joffrey from tormenting her; however, he does assure her that he will help her escape, for the sake of her mother.\n\n    Jaime recognized by Stark men  \nFollowing his defeat at the Blackwater, Stannis Baratheon has retreated back to Dragonstone. He rages at Melisandre for not foreseeing his defeat, despite her claims to see the future. Melisandre insists that the Lord of Light only allows her glimpses and that Stannis cannot abandon the war because of a single defeat. Stannis accuses her of lying to him, of knowing nothing about war and angrily begins to strangle her. When Melisandre insists her god is in him, Stannis releases her, realizing she is talking about the creature they created to murder his brother. Melisandre tells Stannis he will betray his men, his family and his beliefs but in the end, it will be worth it; she assures Stannis that he is the Lord's Chosen and he will be king. Stannis is skeptical, but Melisandre has him look into a brazier; Stannis appears to have visions, restoring his faith in the Red Priestess.\nIn the Westerlands, King Robb Stark speaks with his mother Lady Catelyn regarding his love affair with the woman Talisa. Catelyn urges Robb to remember his vow to wed a daughter of House Frey, or face severe consequences. She says that she and Robb's father didn't love each other when they first married, but that he grew to love her over time. She predicts that Robb and his betrothed might build a similar love over time. Robb disregards her advice and marries Talisa in private that night.\nTraveling east to King's Landing, Brienne of Tarth and Jaime Lannister come upon the bodies of three women, hanged by Stark soldiers for having slept with Lannister soldiers. When the men return, the pair try to lie their way out of the situation. Jaime is recognized and Brienne chose to kill the soldiers. In so doing she reveals her prowess as a fighter to Jaime. When Jaime reminds her that she killed Stark men, Brienne responds that she does not serve House Stark, but Catelyn Stark.\nIn Winterfell, Theon Greyjoy is besieged by a northern army under command of Roose Bolton's bastard son. Maester Luwin tells Theon his chances of holding the castle with only twenty men are negligible. Luwin suggests that Theon join the Night's Watch, gaining a chance to redeem himself. When Theon refuses (fearing that Jon Snow will kill him for his betrayal) and tries to rally his men for battle, they betray him; Dagmer knocks Theon out. When Luwin tries to intervene, Dagmer stabs him with a spear. The ironmen place a bag on Theon and depart Winterfell to deliver him to the Bolton army.\nSome time later, Bran, Rickon, Osha and Hodor emerge from their hiding place in Winterfell's crypts and find the castle burning. They discover the dying Luwin in the godswood. He insists that the boys must go north to the Wall, as there are too many enemies in the south and Jon will be able to keep them safe and tell their mother of their survival. Luwin affirms his pride at having served the Starks before asking Osha to give him a quick death.\nTraveling away from Harrenhal, Arya, Gendry and Hot Pie cross paths with Jaqen H'ghar, who has been waiting for them. He offers to take Arya with him to Braavos, where she can learn his skills of killing and find a way to kill those on her list. She declines, wanting to be reunited with her family. Jaqen gives her an iron coin and the words \"Valar Morghulis,\" telling her to speak them to any man from Braavos should she ever need to find him again. Jaqen bids Arya farewell, using her real name, and departs, changing his face to that of a different man as he leaves.\n\nA"},{"location":"Across the Narrow Sea","content":"Daenerys in her vision of the Iron Throne room.  \nDaenerys Targaryen arrives at House of the Undying and is magically separated from Jorah and Kovarro. She finds herself in an empty circular room with many doors. She chooses one and opens it. She is presented with tempting visions. First the snowy, ruined throne room of King's Landing where she turns away from the Iron Throne. She then walks through the gates of the Wall surrounded by more snow, and into Drogo's tent. She finds Drogo and what would have been her infant son Rhaego. They talk about whose dream they are in, and Daenerys silently leaves after touching Rhaego's hair. She returns to the room with many doors and finds her dragons chained to a pedestal in front of her. Pyat Pree appears and explains that she and her brood are the source of his restored magic. Daenerys is also chained by Pyat's magic. The young queen is unconcerned however, and simply regards Pree with a cool, almost lazy gaze. She calmly utters a single word: \"Dracarys\"; after a couple of tries, all three dragons unleash their fiery breath, and Pyat Pree is incinerated.\nDaenerys knows that Xaro has betrayed her. She returns to his palace to confront him and finds Doreah in bed with him. She takes his key and uses it to open his Valyrian stone vault. She is surprised when it is empty, but observes that this proves something can easily come from nothing. On her orders, Doreah and Xaro are locked into the empty vault to die, their pleas cut off by the closing door. Daenerys salvages enough from Xaro's household to buy a ship. On Jorah's orders, the Dothraki seize Xaro's gold and jewels while Daenerys triumphantly watches with her three dragons.\n\nB"},{"location":"Beyond the Wall","content":"The King-Beyond-the-Wall's Camp.  \nJon Snow and Qhorin Halfhand are marched towards the camp of the King-Beyond-the-Wall, Mance Rayder, as captives of the Lord of Bones. Qhorin realizes that he will have to sacrifice himself in order to facilitate the ruse of Jon deserting to the wildlings, so he stuns one of his captors and acquires a sword, attacking Jon with the seeming intention of killing him for treachery. The Lord of Bones lets them fight, and Ygritte gives Jon back his sword. Qhorin enrages Jon by insulting his parentage. After a fierce duel, Jon mortally wounds Qhorin per Qhorin's own instructions, who whispers to Jon \"We are the watchers on the Wall\" before he breathes his last, signalling to him that he has done the right thing and reminding Jon that he must find out all he can about the wildlings' plans and get back to the Wall. By killing Qhorin, the wildlings believe Jon has betrayed his oath and release him. Impressed, the Lord of Bones cuts Jon free. Ygritte shows him their vast army, gathering in a valley below. She promises to take him to their King and, with no other choice, Jon follows her.\nAt the Fist of the First Men, Sam, Grenn and Edd are foraging for fuel when they hear three horn blasts; the warning call for White Walkers. The three run back to the Fist. Sam is left behind, caught in a sudden blizzard. Seeing shadowy figures moving through the blowing snow, Sam hides behind a rock and watches as dozens of Wights walk past him, led by a White Walker riding an undead horse-wight. Sam cowers in fear, but the White Walker seemingly ignores him. Raising a spear with a blade of ice, the creature gives a piercing shriek, and the army of wights and White Walkers, numbering several hundred, advances on the Fist."}],"firsts":["Gelmarr (first identified)","Stygg (first identified)","Rhaego (in visions/illusions)","Tom"],"deaths":["Tom, stabbed through the groin by Brienne","Maester Luwin, mercy-killed by Osha (at his request) after being stabbed by Dagmer","Pyat Pree, burned by Drogon, Rhaegal and Viserion","Qhorin Halfhand, stabbed by Jon Snow with Longclaw","Doreah, locked inside Xaro's vault to suffocate or starve","Xaro Xhoan Daxos, locked inside his vault to suffocate or starve"],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Lena Headey","character":"Queen Cersei Lannister"},{"actor":"Nikolaj Coster-Waldau","character":"Ser Jaime Lannister"},{"actor":"Michelle Fairley","character":"Lady Catelyn Stark"},{"actor":"Emilia Clarke","character":"Khaleesi Daenerys Targaryen"},{"actor":"Aidan Gillen","character":"Lord Petyr Baelish"},{"actor":"Iain Glen","character":"Ser Jorah Mormont"},{"actor":"Kit Harington","character":"Jon Snow"},{"actor":"Charles Dance","character":"Lord Tywin Lannister"},{"actor":"Richard Madden","character":"King Robb Stark"},{"actor":"Isaac Hempstead-Wright","character":"Prince Bran Stark"},{"actor":"Sophie Turner","character":"Princess Sansa Stark"},{"actor":"Maisie Williams","character":"Princess Arya Stark"},{"actor":"Alfie Allen","character":"Prince Theon Greyjoy"},{"actor":"John Bradley","character":"Samwell Tarly"},{"actor":"Jack Gleeson","character":"King Joffrey Baratheon"},{"actor":"Natalie Dormer","character":"Lady Margaery Tyrell"},{"actor":"Stephen Dillane","character":"King Stannis Baratheon"},{"actor":"Carice van Houten","character":"Melisandre"},{"actor":"Conleth Hill","character":"Lord Varys"},{"actor":"Sibel Kekilli","character":"Shae"},{"actor":"Jason Momoa","character":"Khal Drogo"},{"actor":"Donald Sumpter","character":"Maester Luwin"},{"actor":"Julian Glover","character":"Grand Maester Pycelle"},{"actor":"Ian Hanmore","character":"Pyat Pree"},{"actor":"Natalia Tena","character":"Osha"},{"actor":"Tom Wlaschiha","character":"Jaqen H'ghar"},{"actor":"Simon Armstrong","character":"Qhorin Halfhand"},{"actor":"Gwendoline Christie","character":"Brienne of Tarth"},{"actor":"Rose Leslie","character":"Ygritte"},{"actor":"Nonso Anozie","character":"Xaro Xhoan Daxos"},{"actor":"Joe Dempsie","character":"Gendry"},{"actor":"Oona Chaplin","character":"Lady Talisa Maegyr"},{"actor":"Esme Bianco","character":"Ros"},{"actor":"Finn Jones","character":"Ser Loras Tyrell"},{"actor":"Mark Stanley","character":"Grenn"},{"actor":"Ben Crompton","character":"Eddison Tollett"},{"actor":"Ben Hawkey","character":"Hot Pie"},{"actor":"Ralph Ineson","character":"Dagmer Cleftjaw"},{"actor":"Roxanne McKee","character":"Doreah"},{"actor":"Steven Cole","character":"Kovarro"},{"actor":"Kristian Nairn","character":"Hodor"},{"actor":"Art Parkinson","character":"Prince Rickon Stark"},{"actor":"Edward Dogliani","character":"Lord of Bones"},{"actor":"Forbes KB","character":"Black Lorren"},{"actor":"Daniel Portman","character":"Podrick Payne"},{"actor":"Patrick O'Kane","character":"Jaqen's New Face"},{"actor":"Michael Shaeffer","character":"a Stark soldier"},{"actor":"Christopher Reilly","character":"Soldier Tom"},{"actor":"Terry Byrne","character":"a Septon"},{"actor":"Ross Mullan","character":"a White Walker"},{"actor":"Wren Ros Elliot-Sloan","character":"Rhaego"},{"actor":"Noel Cecil","character":"Wight"}]}
