{"title":"What is Dead May Never Die","season":"2","episode":"3","date":"Sun Apr 15 2012","authors":["Bryan Cogman"],"directors":["Alik Sakharov"],"info":"\"What is Dead May Never Die\" is the third episode of the second season of Game of Thrones. It is the thirteenth episode of the series overall. It premiered on April 15, 2012. It was written by story editor Bryan Cogman and directed by cinematographer Alik Sakharov.","plot":"Catelyn Stark treats with King Renly in the hope of winning an alliance. Tyrion undertakes a complex plan in King's Landing to expose an enemy. At Winterfell, Bran's dreams continue to trouble him.","summary":[{"location":"Beyond the Wall","content":"Craster drags his captive Jon Snow back to his keep. He had caught Jon spying on him while he left a baby in the forest for the White Walkers and has beaten him bloody. Craster orders the men of the Night's Watch out of his home, blaming Jon. Lord Commander Jeor Mormont questions Jon about his actions. Jon realizes that Jeor has known all along that Craster is sacrificing his sons. However, Mormont considers Craster too valuable a contact to risk offending, as he is one of their few sources of information and shelter beyond the Wall. Mormont himself is disgusted by Craster's human sacrifices (not to mention his incestuous relationships with his own daughters), but he will not interfere, and forbids Jon from doing so, as Craster was helped many members of the Night's Watch, among them, Benjen Stark. Jon reveals seeing ​something take the child. Jeor predicts that whatever it was Jon will see it again.\nSamwell Tarly gives Gilly a thimble that once belonged to his mother. He promises to come back for her when they make the return journey to Castle Black.\n\nI"},{"location":"In the Seven Kingdoms","content":"Bran Stark continues to experience strange dreams where he sees the world from the perspective of his direwolf Summer. He follows Hodor into his own bedroom and looks down on himself sleeping. Later, he confides in Maester Luwin, who is dismissive of their significance.\nCatelyn Stark arrives in the camp of King Renly Baratheon during a tournament. She watches Brienne of Tarth defeat Ser Loras Tyrell and claim a place in Renly's kingsguard. Renly introduces Catelyn to his new wife, Margaery Tyrell. Renly shows off his 100,000 strong army. Catelyn warns Renly to take the war seriously.\n\n    Catelyn is impressed with Brienne.  \nTheon Greyjoy is included in his father Balon's war council. Balon reveals his plan to attack the lightly defended North while their armies are fighting against House Lannister. Theon is fuming when he is assigned a single ship to raid the fishing villages of the Stony Shore while his sister Yara is put in command of thirty ships and told to take Deepwood Motte. Theon implores his father to reconsider, claiming that if the Greyjoys attack the North, they face the possibility of total destruction if they lose, but if they ally with the Starks and win, Balon will be crowned King of the Iron Islands and House Greyjoy will be awarded Casterly Rock and essentially the source of the Lannisters' wealth along with it, but Balon rebuffs Theon and chastises him for becoming loyal to the Starks. Theon challenges his father's lack of faith in him and reminds him that he gave him up as a ward. Balon reacts by hitting his son and storming out as Theon shouts at him from behind. Theon considers warning Robb about his father's actions, but ultimately reaffirms his loyalty to his family by being baptised by a Drowned Priest.\nShae complains to Tyrion Lannister about being confined to his chambers. He liaises with Varys to find her a job that will give her some freedom. Cersei Lannister hosts an awkward dinner for her children and her captive Sansa Stark. Sansa maintains her façade of loyalty to her captors. Shae reports as Sansa's new handmaiden, allowing Sansa to vent some frustration about her inexperience.\n\n    Theon's baptism.  \nTyrion tests the loyalty of the small council by feeding them each a different plan for a marriage alliance involving Princess Myrcella Baratheon. He uncovers Pycelle as an informant to Cersei when Cersei confronts him about the plan he fed to Pycelle. Tyrion insists on pursuing the exposed plan to marry Myrcella into House Martell of Dorne over Cersei's protests. He has Bronn arrest Pycelle for his treachery. Petyr Baelish is furious about being involved in Tyrion's deception. Tyrion placates him by offering him an opportunity to act as an envoy to Renly and Catelyn.\nRenly tries to initiate sex with his lover Loras but is rebuffed. Loras reminds him of the importance of fathering an heir and goes to fetch his sister Queen Margaery. Margaery fails to seduce Renly. She is pragmatic about his homosexuality, and suggests including her brother in their love making, asserting the importance of producing an heir.​\nArya Stark struggles with insomnia and takes advice from Yoren about coping with her painful memories. He tells her to focus on retribution. They are interrupted by the arrival of Ser Amory Lorch with a force of Lannister men and gold cloaks. Yoren marshals the recruits for a battle. He confronts Ser Amory and refuses to comply with his demands that he surrender the Royal bastard Gendry. Yoren dies fighting bravely but his recruits are overcome. During the fight Arya rescues Jaqen H'ghar from a fire near the prisoner wagon. Lommy Greenhands picks up Gendry's helmet and is wounded by a crossbow bolt. Arya is incapacitated by Polliver who takes Needle from her. Gendry and Hot Pie are also captured. Lommy begs Polliver to carry him but Polliver stabs him in the throat with Needle instead. Arya convinces her captors that Lommy was Gendry because he was carrying the helmet. Ser Amory orders the prisoners be taken to Harrenhal."}],"firsts":["Brienne of Tarth","Queen Margaery Tyrell","Ser Colen of Greenpools","Gerald","Ser Amory Lorch","Polliver"],"deaths":["Yoren, pierced through the back of the neck by Amory Lorch","Lommy Greenhands, pierced through the throat by Polliver"],"cast":[{"actor":"Peter Dinklage","character":"Tyrion Lannister"},{"actor":"Lena Headey","character":"Queen Cersei Lannister"},{"actor":"Michelle Fairley","character":"Lady Catelyn Stark"},{"actor":"Aidan Gillen","character":"Lord Petyr Baelish"},{"actor":"Kit Harington","character":"Jon Snow"},{"actor":"Alfie Allen","character":"Theon Greyjoy"},{"actor":"Isaac Hempstead-Wright","character":"Prince Bran Stark"},{"actor":"Sophie Turner","character":"Princess Sansa Stark"},{"actor":"Maisie Williams","character":"Princess Arya Stark"},{"actor":"John Bradley","character":"Samwell Tarly"},{"actor":"Natalie Dormer","character":"Queen Margaery Tyrell"},{"actor":"James Cosmo","character":"Lord Commander Jeor Mormont"},{"actor":"Jerome Flynn","character":"Bronn"},{"actor":"Conleth Hill","character":"Lord Varys"},{"actor":"Sibel Kekilli","character":"Shae"},{"actor":"Donald Sumpter","character":"Maester Luwin"},{"actor":"Ron Donachie","character":"Ser Rodrik Cassel"},{"actor":"Julian Glover","character":"Grand Maester Pycelle"},{"actor":"Robert Pugh","character":"Craster"},{"actor":"Patrick Malahide","character":"King Balon Greyjoy"},{"actor":"Francis Magee","character":"Yoren"},{"actor":"Gethin Anthony","character":"King Renly Baratheon"},{"actor":"Joe Dempsie","character":"Gendry"},{"actor":"Tom Wlaschiha","character":"Jaqen H'ghar"},{"actor":"Gwendoline Christie","character":"Brienne of Tarth"},{"actor":"Finn Jones","character":"Loras Tyrell"},{"actor":"Ben Hawkey","character":"Hot Pie"},{"actor":"Eros Vlahos","character":"Lommy Greenhands"},{"actor":"Gemma Whelan","character":"Princess Yara Greyjoy"},{"actor":"Kristian Nairn","character":"Hodor"},{"actor":"Hannah Murray","character":"Gilly"},{"actor":"Fintan McKeown","character":"Amory Lorch"},{"actor":"Andy Kellegher","character":"Polliver"},{"actor":"Andy Beckwith","character":"Rorge"},{"actor":"Gerard Jordan","character":"Biter"},{"actor":"Jonathan Ryan","character":"a Drowned Priest"},{"actor":"Aimee Richardson","character":"Princess Myrcella Baratheon"},{"actor":"Callum Wharry","character":"Prince Tommen Baratheon"},{"actor":"Maisie Dee","character":"Daisy"},{"actor":"Tobias Winter","character":"Timett"},{"actor":"Ken Fletcher","character":"Gerald"},{"actor":"Darren Killeen","character":"Ser Colen of Greenpools"},{"actor":"Sam Callis","character":"a Goldcloak on the Kingsroad"},{"actor":"Dennis McKeever","character":"Night's Watch Officer 2"},{"actor":"Aaron Archer","character":"Tyrell Soldier"},{"actor":"Darran Watt","character":"Soldier"},{"actor":"Unknown","character":"Night's Watch Officer"}]}
